{
    "item1": ">Item 1.\n \nBusiness\nOur Company\nARC Document Solutions Inc. is a digital printing company. We provide digital printing and document-related services to customers in a growing variety of industries. Our primary services are:\n•\ndigital printing of general and specialized business documents such as those found in marketing and advertising, engineering and construction and other industries, as well as producing highly-customized display graphics of all types and sizes;\n•\nacquiring, placing and managing ARC-certified office printing equipment with proprietary device tracking and print management software at our customers’ offices and job sites;\n•\nscanning documents, indexing them and adding digital search features for use in digital document management, document archives and facilities management, as well as providing other digital imaging services; and,\n•\nreselling digital printing equipment and supplies.\nEach of these services frequently include additional logistics services in the form of distributing and delivering finished documents, installing display graphics, or the digital storage of graphic files. \nWhile our production equipment and services are technologically sophisticated, we have also invested heavily in developing technology applications that improve digital printing and document management process, increase the efficiency of print networks, and provide features that enhance data security. We believe the use of this technology by our customers creates a more valuable relationship.\nOur services, technology and national footprint create economies of scale and production efficiency across geographical boundaries for customers who prefer to work with a single supplier for their digital printing needs. We believe these single-source capabilities provide us with a material advantage over our competition in local and regional markets.\nWe serve more than 35,000 active customers in a wide variety of markets including retail, technology, energy, education, hospitality, public utilities, and others. We also perform work for a majority of the largest design, engineering, and construction-oriented firms in North America. Our largest customers are served by an enterprise sales force called Global Solutions. No individual customer accounts for more than 2.5% of our overall revenue.\nWe believe that no other public company in the U.S. offers the particular set of services we do. We believe we are the largest digital printing provider to the architectural, engineering and construction industry, or AEC, as measured by revenue, number of customers, and number of service centers.\nOur employees are generally long-tenured, highly-experienced, and cross-trained. They provide our services from 146 service centers located throughout North America and in select locations around the world. All of our service centers can provide the complete array of our general services, but each service center varies in scale, size of labor force and capacity based on the size and needs of its particular market.\nOur primary operational objective is to drive as much customer work through our service center network as is practical in order to leverage our production infrastructure, a capable and efficient workforce, and production-grade equipment.\nOur services can be customized to meet the needs of individual customers, as well as address the needs of a broad industry, and we believe we have an excellent reputation for service and reliability. Because of our reputation for high level of service and the benefits that our technology brings to our customers, we find that we are able to charge a reasonable premium for our offering. \nImportantly, we don't believe that we should be compared to conventional printers. We do not produce high-volume, low-margin, commodity offset or lithographic printing, but rather provide short-run, customized, high-quality digital printing services. As such, we believe the customers, end-products, production equipment, labor utilization and economic models of conventional printers are materially different than ours.\nARC was organized as a limited liability company under the name American Reprographics Holdings L.L.C. in 1997. In 2005, we reorganized as a Delaware corporation in connection with our initial public offering under the name American \n6\nReprographics Company. At the end of 2012 we formally changed our corporate name to “ARC Document Solutions, Inc.,” leaving our New York Stock Exchange ticker symbol “ARC” unchanged. We are headquartered in San Ramon, California. We conduct our operations through our wholly-owned subsidiary, ARC Document Solutions, LLC, a Texas limited liability company, and its affiliates. In the years following our inception, our business grew through acquisitions, but for more than a decade acquisitions have not been a focal point for growth. \nPrincipal Products and Services\nSpecifically, our offerings include:\nDigital Printing: \nWe print documents of any size in color and black and white on a variety of materials including plain paper, vinyl, fabric, metal, wood and other three-dimensional substrates. While we can and do print high-page count work such as manuals or catalogs, the documents we typically produce are usually characterized by their high-quality production, low-volume and quick turnaround, and are produced using highly-sophisticated digital printing equipment.\nManaged Print Services: \nWe acquire and manage digital printing equipment and place it in our customers' facilities for their use, based on a service level agreement, or SLA. We lease or own the equipment ourselves, while our customers pay for what they use. Per-use minimum charges are often part of our SLAs. We operate more than 10,000 managed print services, or MPS, locations, ranging in size from one or two pieces of equipment in a single office, to hundreds of pieces equipment in offices around the world. We also provide proprietary software to our customers that are designed to control their print expenses and connect their remote employees with their offices and ARC print centers nationwide. This software is developed and integrated by ARC. \nScanning and Digital Imaging: \nWe scan hard-copy small format or large format documents in color or black and white, typically providing them to our customers as searchable PDF files. We also use our patented optical character recognition technology to make documents searchable, and we host them on proprietary applications for use as part of our ARC Facilities solutions. The types of documents that we scan include office files, construction plans and other small or large documents. We also process, distribute and print-on-demand images we capture for our customers. Our large, centralized Scanning and Digital Imaging centers are compliant with the Health Insurability Portability and Accountability Act of 1996, or HIPAA, so we can convert documents that include protected health information, or PHI. Our unique software creates efficient search tags on scanned data for easy search and retrieval. We offer Cloud-based document management software and other digital hosting services to our customers or make files available for our customers to host themselves. \nEquipment and Supplies Sales: \nWe sell equipment and supplies to a small segment of our customer base. We also provide ancillary services such as equipment service and maintenance, often as a way to generate recurring revenue in addition to a one-time sale. In addition, we offer certified used equipment available for sale or for use in our MPS offering. \nOperations\nThe majority of our products and services are available from each of our service centers. As noted earlier, our primary operational objective is to optimize our business performance by driving as much customer work through our service center network as is practical, leveraging our production infrastructure, workforce, and production-grade equipment. All our production centers are digitally connected and we operate standard software and systems to support seamless movement of customers digital data and print anywhere within the ARC system.\nIn addition, we can provide many of our services in our customers’ offices. Our geographic presence is concentrated in the U.S., with additional service centers in Canada, the United Arab Emirates (UAE), China, India, and the United Kingdom. Our origin as a company was in California, and the initial expansion of our business was concentrated there. We derive approximately 30% of our total revenue from the products and services delivered in California.\nAll of our production facilities are connected via a Software-Defined Wide Area Network, or SD-WAN. Our cloud offerings are hosted by Amazon Web Services. We employ a combination of proprietary and industry-leading technologies to provide redundancy, backup and security of all data in our systems. All of our technology operations are designed to meet ISO 29001 standards for data security, and several of our service centers are HIPAA-compliant allowing us to manage document conversions and other scanning tasks involving protected health information, or PHI.\nIn response to the pandemic, most of our corporate, financial and administrative staff have been working entirely or partially from home, while our service center staff continue to work in our facilities and adhere to strict safety and health protocols.\n7\nSeasonality is a small part of our business, with sales of Digital Printing for construction clients influenced by seasonality and building cycles. Sales of display graphics are affected by retail trends, marketing calendars, advertising campaigns and branding initiatives, as well as the marketing and communication needs of our office and real estate development clients. \nMPS sales are driven by the generation of office documents and our customers' desire to improve business processes and reduce print-related costs. Scanning and Digital Imaging sales are influenced primarily by the desire for document workflow improvements. Equipment and Supplies sales are driven by purchasing cycles of individual customers, as well as by new features and advancements from equipment manufacturers.\nStrategic Focus\nOur strategic focus areas include driving profitable growth, optimizing our business performance, and returning value to our stockholders.\nDriving profitable growth\n: We intend to expand the markets and industries we serve while leveraging our long-term relationships with existing customers. Our outside sales efforts are focused on developing new customers and markets that are identified and targeted by our centralized corporate marketing team. Account-based sales have been generally shifted to in-house service centers where work is performed, existing customer relationships are strongest, and additional contacts within these accounts can be easily discovered.\nO\nptimizing our business performance\n: We intend to leverage our service centers and cross-trained workforce to create efficiencies in our operations, lower our costs, and provide exceptional service to our customers. We believe that the more work we are able to drive through our service centers, the greater our efficiencies become.\nReturning value to our stockholders\n: We intend to continue focusing our capital allocation strategy on benefiting our stockholders by using our cash flows to fund our dividend program and repurchase shares of our common stock in the open market. \nHuman Capital Management\nWe employed approximately 1,900 people as of December 31, 2023. Approximately 70% of our employees are located in the U.S. Approximately 98% of our team are full-time employees, with 60% representing non-exempt roles working in production functions. There are 14 engineers employed in our corporate headquarters in San Ramon, California, to develop, maintain, and support our proprietary software solutions. We also operate a technology center in Kolkata, India, with approximately 200 employees at that location who, in addition to supporting our San Ramon technology team, also support our research and development efforts. Approximately 90 service employees and managers work in our service centers in Canada, 50 in the United Kingdom, and another 200 in India, United Arab Emirates and China. None of our employees are currently represented by labor unions.\nWe have long embraced inclusion, diversity and equity in our workforce from the top down. Two of our four board members are women. Our Chairman and Chief Executive Officer, our Chief Operating Officer and our Chief Technology Officer are Southeast Asian, our Chief Financial Officer is Hispanic, and our Corporate Counsel and Corporate Secretary is a woman. Similar racial and gender diversity is represented across our workforce. \nWe believe our success is a direct result of the contributions and commitment of our employees. In 2023, ARC adjusted its compensation plans throughout the year to help facilitate employee retention. We also make profit-sharing and incentive plans part of most employees' compensation package. We believe that profit-sharing plans in particular encourage team efforts and cohesion within local and regional employee groups.\nOur employee benefit offerings include price-competitive, high-quality medical insurance plans that include incentives for physical fitness, and we offer mental health and other employee assistance programs. \nOur Customers\nWe serve more than 35,000 active customers in a wide variety of markets. No single customer accounted for 2.5% or more of our sales in 2023. The size of our customers is wide-ranging, from local restaurant owners and construction subcontractors to international retailers, regional energy companies, and some of the country’s largest school districts. We frequently sell products and services from across our portfolio to a single customer, particularly when working with larger customers. In \n8\naddition, we often sell similar services to different companies within the same industry. Payment terms for account-based customers typically do not exceed 30 days.\nThe types of Digital Printing customers we sell to span a wide variety of industries that include but are not limited to:\n•\nadvertising/media/marketing/promotional/graphic design departments,\n•\nbuilding owners and real estate developers,\n•\ndesign, engineering and construction professionals,\n•\noffice management & IT departments responsible for print and document management,\n•\nfacilities management staff in schools, hospitals and other institutions,\n•\nprocurement departments in businesses of all kinds,\n•\nsmall business owners,\n•\nretail merchandising departments, and\n•\ncity/county/state municipalities.\nThe local markets we serve through our service centers are often highly fragmented with a wide variety of specialized, geographically-differentiated business practices. Larger regional, national and international customers often consolidate the purchasing and the acquisition of our services through a single corporate department. We serve these larger customers through our enterprise sales force which we refer to as our Global Solutions.\nCompetition\nThe level of competition that we face varies in each of our markets, but we believe our service level, the breadth of our offerings, price, quality, responsiveness, and convenience to the customer are common competitive elements in any market.\nWe often compete with single-service firms, e.g., quick printers, copier dealers or scanning bureaus, but we do not know of any other firm that currently provides the full suite of services we offer.\nLocal copy shops and self-serve franchises are often aggressive competitors for digital printing business, but rarely offer the breadth of document management and logistics services that we do. \nThere are several companies in each major metropolitan market that provide MPS and related print services, but we believe these companies cannot provide the same or similar integrated services and technology that we offer. \nLikewise, there are small and regional scanning companies in many of the markets where we compete, but few have the infrastructure, footprint, stewardship guarantees, and privacy certifications that we do.\nWith regard to large national and international customers, we know of no other document solutions companies in the U.S. with the national presence and global reach that we have established for each of our primary services. \nWe believe that we have a strong competitive position in the markets and industries that we serve for the following reasons:\n•\nBroad expertise in specialized digital printing, finishing and installation.\n•\nCapabilities in a wide variety of digital printing formats including large-format, small-format, black and white, color, as well as print capabilities on conventional substrates (paper and paper-based products) and unconventional substrates (vinyl, fabric, plastic, metal, three-dimensional structures, etc.).\n•\nStrong domain expertise in printing specialty documents, especially in the architectural, engineering and construction industries.\n•\nLong-standing positive customer relationships in every industry we serve.\n•\nHigh-ranking organic search engine statistics for our primary services.\n•\nLong-term contracts with high-profile, enterprise-level customers that can be leveraged for referral work.\n•\nA large North American service center footprint of 134 facilities, with additional market presence in Canada, China, the UAE, India, the U.K. and other select international locations.\n•\nThe variety of equipment brands we make available to our customers as compared to the single brands offered by competing equipment manufacturers.\n•\nWe believe we are the only national company that integrates digital printing and document production at (1) customer sites (onsite offerings), (2) a national network of service centers (offsite offerings), and (3) digital management of documents in the cloud (cloud-based offerings). \n9\nSuppliers and Vendors\nWe purchase or lease equipment for use in our production facilities and at our customers’ sites. We also purchase paper, toner and other consumables for the operation of our equipment. As a high-volume purchaser, we believe we receive favorable prices as compared to other service providers. Price increases are typically passed on to customers.\nOur primary vendors of equipment, maintenance services, and digital printing supplies include Hewlett Packard, Canon Solutions America (Océ), and Xerox.\nPurchases from these vendors during 2023 comprised approximately 35% of our total purchases of inventory and supplies. Although there are a limited number of suppliers that could supply our inventory, we believe any shortfalls from existing suppliers could be filled by other suppliers on comparable terms. \nProprietary Rights\nWe rely on a combination of copyright, trademark and trade secret laws, license agreements, nondisclosure and non-competition agreements, reseller agreements, customer contracts, and technical measures to establish and protect our rights in our proprietary technology. We also rely on a variety of technologies that are licensed from third parties to perform key functions.\nWe have registered “ARC Document Solutions,” “ARC,” as well as our historical name and logo, “American Reprographics Company,” as trademarks in the U.S. with the United States Patent and Trademark Office, or USPTO. We have registered “PlanWell”, “PlanWell PDS”, “Riot Creative Imaging”, “ABACUS” and \"SKYSITE” as trademarks with the USPTO and in other countries. We have registered three patents which relate to systems and methods for optimizing data transfers and synchronization of information that enable our facilities management solution. We do not own any other registered trademarks, service marks, or patents, that are material to our business.\nFor a discussion of the risks associated with our proprietary rights, see Item 1A, \"Risk Factors - Our failure to adequately protect the proprietary aspects of our technology solutions may cause us to lose market share.\"\nRegulatory Matters\nData Privacy and Security\nAspects of our business involve collecting, processing, disclosing, storing, and transmitting personal data, which are subject to certain privacy policies, contractual obligations, and laws, regulations, and directives relating to privacy and data protection. We store a substantial amount of customer and employee data, including personal data, on our networks and other systems and the cloud offerings we operate. In addition, the types of data subject to protection as personal data in the United States, and elsewhere have been expanding. In recent years, the collection and use of personal data by companies have come under increased regulatory and public scrutiny, especially in relation to the collection and processing of sensitive data, such as healthcare, biometric, genetic, financial services, and children’s data, precise location data, and data regarding a person’s race or ethnic origins, political opinions, or religious beliefs.  For example, in the United States, protected health information is subject HIPAA, which can provide for civil and criminal penalties for noncompliance. Entities (such as us) that engage in receiving, maintaining, or transmitting protected health information provided by covered entities and other business associates are subject to enforcement under HIPAA.  Our access to protected health information triggers obligations to comply with certain privacy rules and data security requirements under HIPAA.\nThere are a broad variety of other data protection laws in the United States that are applicable to our activities, and a wide range of enforcement agencies at both the state and federal levels that can review companies for privacy and data security concerns based on general consumer protection laws. The Federal Trade Commission and state Attorneys General all are aggressive in reviewing privacy and data security protections for consumers. New laws also are being considered at both the state and federal levels. A broad range of legislative measures also have been introduced at the federal level. Accordingly, failure to comply with federal and state laws (both those currently in effect and future legislation) regarding privacy and security of personal information could expose us to fines and penalties under such laws. In the event of a security breach, we also may have obligations to notify our customers or other parties or individuals about this breach, and this can lead to significant costs and the risk of potential enforcement and/or litigation. There is also a threat of consumer class actions related to these laws and the overall protection of personal data. Even if we are not determined to have violated these laws, government investigations into these issues typically require the expenditure of significant resources and generate negative publicity, which could harm our reputation and our business.\n10\nIn the United States there also are specific state laws that may impact our business activities. For example, the state of California adopted a comprehensive privacy law, the California Consumer Privacy Act (“CCPA”), which took effect in January 2020 and became enforceable in July 2020.  We have been and will continue to be required to devote substantial resources to implement and maintain compliance with the CCPA, and noncompliance could result in regulatory investigations and fines or private litigation. Moreover, in November 2020, California voters approved a privacy law, the California Privacy Rights Act, or CPRA, which amends the CCPA to create privacy rights and obligations in California. More than 12 other states already have passed similar state privacy laws, which already have gone into effect or will go into effect in the future. In addition, the state of Washington passed the My Health My Data Act in 2023 which specifically regulates health information that is not otherwise regulated by the HIPAA rules. Other states have already passed similar laws and other states may do so in the future. All of these privacy laws may impact our business activities and our relationships with business partners, customers and service providers. \nFurthermore, the U.S. Congress is considering comprehensive privacy legislation. At this time, it is unclear whether Congress will pass such a law and if so, when and what it will require and prohibit.  Moreover, it is not clear whether any such legislation would give the FTC any new authority to impose civil penalties for violations of the Federal Trade Commission Act in the first instance, whether Congress will grant the FTC rulemaking authority over privacy and information security, or whether Congress will vest some or all privacy and data security regulatory authority and enforcement power in a new agency, akin to EU data protection authorities.\nEnvironmental\nOur operations are subject to numerous laws and regulations governing environmental protection and occupational health and safety matters. Under these laws and regulations, we may be liable for, among other things, the cost of investigating and remediating contamination, regardless of fault or actions on our part. The amount of any such expense or related natural resource damages for which we may be held responsible could be substantial.  For example, we are currently performing environmental remediation at a property we acquired as part of a business acquisition in the 1990s located in California. For additional discussion regarding the property and our estimated current estimated expenses see the discussion in Note 6, \nCommitments and Contingencies - Site Remediation Obligation\n within Part IV, Item 15 - \"Exhibits and Financial Statement Schedule” of this Annual Report on Form 10-K. \nThe estimate of our final remediation expenses may change over time because of the varying costs of currently available cleanup techniques, unpredictable contaminant reduction rates associated with available cleanup techniques and the difficulty of determining in advance the nature and full extent of contamination. Based on our experience to date, we do not currently anticipate any material adverse effect on our business or consolidated financial position, results of operations or cash flows as a result of future compliance with existing environmental laws and regulations. However, evolving statutory and regulatory standards, their interpretation, more vigorous enforcement policies of regulatory agencies, or stricter or different interpretations of existing statutory and regulatory standards, may require additional expenditures by us, which may be material. Accordingly, there can be no assurance that we will not incur significant environmental compliance costs in the future.\nAvailable Information\nWe use our corporate website, www.e-arc.com, as a channel for routine distribution of important information, including news releases, analyst presentations and financial information. The information on our website is not incorporated by reference into this Annual Report on Form 10-K or into any other report or document we file with the U.S. Securities and Exchange Commission or SEC. We file with, or furnish, to the SEC Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and any amendments to those reports, as well as proxy statements and annual reports to stockholders, and, from time to time, other documents. The reports and other documents filed with or furnished to the SEC are available to investors on or through our corporate website free of charge as soon as reasonably practicable after we electronically file them with or furnish them to the SEC. The SEC maintains an internet site located at http://www.sec.gov that contains reports, proxy and information statements and other information regarding issuers that file electronically with the SEC. Our SEC filings and other documents pertaining to the conduct of our business can be found on the “Investors” section of our website available at ir.e-arc.com. These documents are available in print to any stockholder who requests a copy by writing or by calling ARC Document Solutions.\n11",
    "item1a": ">Item 1A.\n \nRisk Factors\nThe risks and uncertainties set forth below, as well as other risks and uncertainties described elsewhere in this Annual Report on Form 10-K including in our consolidated financial statements and accompanying notes and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” or in other filings with the SEC, could materially and adversely affect our business, financial condition, operating results, and the trading price of our common stock. Additional risks and uncertainties that are not currently known to us or that are not currently believed by us to be material may also harm our business operations and financial results. Because of the following risks and uncertainties, as well as other factors affecting our financial condition and operating results, past financial performance should not be considered to be a reliable indicator of future performance, and investors should not use historical trends to anticipate results or trends in future periods.\nRisks Related to Our Business\nA significant portion of our revenue across all of our product and services is generated from customers in the AEC/O industry. Any decline in that industry could adversely affect our future revenue and profitability.\nWe estimate that customers in the AEC/O industry accounted for approximately 50% of our net sales in 2023; therefore, our results largely depend on the strength of that industry. Our historical operating results reflect the cyclical and variable nature of the AEC/O industry. We believe that the AEC/O industry generally experiences downturns several months after a downturn in the general economy, and that there may be a similar delay in the recovery of the AEC/O industry following a recovery of the general economy. A downturn in the AEC/O industry would diminish demand for all of our products and services, and would therefore negatively affect our revenues and have a material adverse effect on our business, operating results and financial condition.\nWe derive a significant percentage of net sales from within the State of California and our business could be disproportionately harmed by an economic downturn or natural disaster affecting California.\nWe derived approximately 30% of our net sales in 2023 from our operations in California. Accordingly, we are sensitive to economic factors affecting business activity in California, including general and local economic conditions, declines in specific industries, macroeconomic trends, political factors affecting commerce and economic development, and natural disasters (including drought, earthquakes and wildfires) the intensity and frequency of which are being exacerbated by climate change. Any adverse developments affecting California could have a disproportionately negative effect on our results of operations and financial condition.\nOur growth strategy depends, in part, on our ability to successfully market and execute several different, but related, service offerings. Failure to do so could impede our future growth and adversely affect our competitive position.\nAs part of our growth strategy, we intend to continue to offer and grow a variety of service offerings that are relatively new to the company. Our efforts will be affected by our ability to acquire new customers for our new service offerings as well as sell the new service offerings to existing customers. If we fail to procure new customers or sell these services to our existing customers, our growth may be adversely affected and we may incur operating losses as a result of a failure to realize revenue from the investments made in new service offerings.\nBecause a significant portion of our overall costs are fixed, our earnings are highly sensitive to changes in revenue.\nOur network of service centers, equipment and related support activities involves substantial fixed costs which cannot be adjusted quickly to respond to declines in demand for our services. We estimate that approximately 23% of our overall costs were fixed in 2023. As a consequence, our results of operations are subject to relatively high levels of volatility and our earnings could deteriorate rapidly in the face of declining revenues because our ability to reduce fixed costs in the short-term is limited. If we fail to manage our fixed costs appropriately, or to maintain adequate cash reserves to cover such costs, we may suffer material adverse effects on our results of operations and financial condition.\nWe are dependent upon our vendors to continue to supply us with equipment, parts, supplies, and services at comparable terms and price levels as the business grows.\nOur access to equipment, parts, supplies, and services depends upon our relationships with, and our ability to purchase these items on competitive terms from our principal vendors. These vendors are not required to use us to distribute their equipment and are generally free to change the prices and other terms at which they sell to us. In addition, we compete with the selling efforts of some of these vendors. Our reliance on a limited number of principal vendors presents various risks. These include the risk that an interruption in our relationships with our principal vendors for any reason, such as a natural catastrophe, epidemics, pandemics, such as the COVID-19 pandemic, or actions taken in regard to increased tariffs on goods produced in \n12\ncertain countries such as China, we may not be able to develop an alternate source without incurring material additional costs and substantial delays.\n \nSignificant deterioration in relationships with, or in the financial condition of, these significant vendors could have an adverse effect on our ability to sell equipment as well as our ability to provide effective service and technical support to our customers. If one of these vendors terminates or significantly curtails its relationship with us, or if one of these vendors ceases operations, we would be forced to expand our relationships with our other existing vendors or seek out new relationships with previously unused vendors.\nOur failure to adequately protect the proprietary aspects of our technology solutions may cause us to lose market share.\n \nOur success depends on our ability to protect and preserve the proprietary aspects of our technology products. We rely on a combination of patent, copyright, trademark and trade secret protection, confidentiality agreements, license and subscription agreements, and technical measures to establish and protect our rights in our proprietary technologies. These protections, however, may be inadequate. It is also possible that our intellectual property rights could be challenged, invalidated or circumvented, allowing others to use our intellectual property to our competitive detriment. Furthermore, we may, from time to time, be subject to intellectual property litigation which can be expensive, a burden on management’s time and our Company’s resources, and the outcome of any such litigation may be uncertain.\nCompetition in our industry and innovation by our competitors may hinder our ability to execute our business strategy and adversely affect our profitability.\n \nThe markets for our products and services are highly competitive, with competition primarily at local and regional levels. We compete primarily based on the level and quality of customer service, technological leadership, and price. Our future success depends, in part, on our ability to continue to improve our service and product offerings, and develop and integrate new technology solutions. In addition, current and prospective customers may decide to perform certain services themselves instead of outsourcing these services to us. These competitive pressures could adversely affect our sales and consolidated results of operations.\nChanges in laws or regulations relating to privacy or the collection, processing, disclosure, storage, localization, or transmission of personal data, or any actual or perceived failure by us to comply with such laws and regulations, contractual obligations, or applicable privacy policies, could materially adversely affect our business\nAspects of our business involve collecting, processing, disclosing, storing, and transmitting personal data, which are subject to certain privacy policies, contractual obligations, and laws, regulations, and directives relating to privacy and data protection. We store a substantial amount of customer and employee data, including personal data, on our networks and other systems and the cloud offerings we operate. In addition, the types of data subject to protection as personal data in the United States, and elsewhere have been expanding. In recent years, the collection and use of personal data by companies have come under increased regulatory and public scrutiny, especially in relation to the collection and processing of sensitive data, such as healthcare, biometric, genetic, financial services, and children’s data, precise location data, and data regarding a person’s race or ethnic origins, political opinions, or religious beliefs.  For example, in the United States, protected health information is subject to HIPAA, which can provide for civil and criminal penalties for noncompliance. Entities (such as us) that engage in receiving, maintaining, or transmitting protected health information provided by covered entities and other business associates are subject to enforcement under HIPAA.  Our access to protected health information triggers obligations to comply with certain privacy rules and data security requirements under HIPAA.  \nIn addition to potential enforcement by the United States Department of Health and Human Services for potential HIPAA violations, we are also potentially subject to privacy enforcement from the FTC. The FTC has been particularly focused on certain activities related to the processing of sensitive data, including the unpermitted processing of health and genetic data through its recent enforcement actions and is expanding the types of privacy violations that it interprets to be “unfair” under Section 5 of the FTC Act, as well as the types of activities it views to trigger the Health Breach Notification Rule (which the FTC also has the authority to enforce). We will need to account for the FTC’s evolving rules and guidance for proper privacy and data security practices in order to mitigate our risk for a potential enforcement action, which may be costly. If we are subject to a potential FTC enforcement action, we may be subject to a settlement order that requires us to adhere to very specific privacy and data security practices, which may impact our business. We may also be required to pay fines as part of a settlement (depending on the nature of the alleged violations). If we violate any consent order that we reach with the FTC, we may be subject to additional fines and compliance requirements. We face risks of similar enforcement from State Attorneys General and, potentially, other regulatory agencies.\nAny systems failure or security breach that results in the release of, or unauthorized access to, personal data, or any failure or perceived failure by us or our third-party service providers to comply with applicable privacy policies, contractual obligations, or any applicable laws or regulations relating to privacy or data protection, could result in proceedings against us by domestic or foreign government entities or others, including private plaintiffs in litigation.  Such proceedings could result in \n13\nthe imposition of sanctions, fines, penalties, liabilities, government orders, and/or orders requiring that we change our data practices, any of which could have a material adverse effect on our business, operating results, reputation, and financial condition.\nState privacy laws in the United States also may impact our business operations. The state of California has adopted a comprehensive privacy law, the CCPA, which took effect in January 2020 and became enforceable in July 2020. We have been required to devote substantial resources to implement and maintain compliance with the CCPA, and noncompliance could result in regulatory investigations and fines or private litigation. Moreover, in November 2020, California voters approved a privacy law, the CPRA, which amends the CCPA to create additional privacy rights and obligations in California, and went into effect on January 1, 2023. Numerous other states have passed laws similar to the CCPA, which will go into effect in 2023 and beyond. More states may follow. These laws may impose additional costs and obligations on us. The Securities and Exchange Commission also has issued new regulations related to cybersecurity that may require additional reporting and other compliance obligations, as well as creating additional risks related to public notifications concerning cyber incidents.\nFurthermore, the U.S. Congress is considering comprehensive privacy legislation. At this time, it is unclear whether Congress will pass such a law and if so, when and what it will require and prohibit.  Moreover, it is not clear whether any such legislation would give the FTC any new authority to impose civil penalties for violations of the Federal Trade Commission Act in the first instance, whether Congress will grant the FTC rulemaking authority over privacy and information security, or whether Congress will vest some or all privacy and data security regulatory authority and enforcement power in a new agency, akin to EU data protection authorities.\nComplying with these and other changing requirements could cause us to incur substantial costs or pay substantial fines or penalties, require us to change our business practices, require us to take on more onerous obligations in our contracts, or limit our ability to provide certain services in certain jurisdictions, any of which could materially adversely affect our business and operating results.  New laws or regulations restricting or limiting the collection or use of mobile data could also reduce demand for certain of our offerings or require changes to our business practices, which could materially adversely affect our business and operating results.\nIf we or our third-party service providers experience a disruption due to a cybersecurity attack or security breach and unauthorized parties obtain access to our customers’ or vendors’ data, our data, our networks or other systems, or the cloud offerings we operate, our offerings may be perceived as not being secure, our reputation may be harmed, demand for our offerings may be reduced, our operations may be disrupted, we may incur significant legal and financial liabilities, and our business could be materially adversely affected\nAs part of our business, we process, store, and transmit our customers’ and vendors’ data as well as our own, including in our networks and other systems and the cloud offerings we operate. Security breaches may occur due to technological error, computer viruses, or third-party action, including intentional misconduct by computer hackers or state actors, physical break-ins, industrial espionage, fraudulent inducement of employees, customers, or channel partners to disclose sensitive information such as usernames or passwords, and employee, customer, or channel partner error or malfeasance. A security breach could result in unauthorized access to or disclosure, modification, misuse, loss, or destruction of our customers’, prospects’, vendors’, or channel partners’ data, our data (including our proprietary information, intellectual property, or trade secrets), our networks or other systems, or the cloud offerings we operate. Third parties may also conduct attacks designed to prevent access to critical data or systems through ransomware or temporarily deny customers access to our cloud environments.\nWe, and our service providers, may in the future experience attempts by third parties to identify and exploit software and service vulnerabilities, penetrate or bypass our security measures, and gain unauthorized access to our or our customers’ or service providers’ cloud environments, networks, and other systems. Security measures that we or our third-party service providers have implemented may not be effective against all current or future security threats. Because there are many different security breach techniques and such techniques continue to evolve, we may be unable to anticipate, detect, or mitigate attempted security breaches and implement adequate preventative measures.\nAny security breach, ransomware attack, or successful denial of service attack could result in a loss of customer confidence in the security of our offerings and damage to our brand, reduce the demand for our offerings, disrupt our normal business operations, require us to spend material resources to investigate or correct the breach, require us to notify affected customers or individuals and/or applicable regulators and others, provide identity theft protection services to individuals, expose us to legal liabilities, including litigation, regulatory enforcement actions, and indemnity obligations, and materially adversely affect our revenues and operating results.\n \nOur software services operate in conjunction with and are dependent on third-party products and components across a broad ecosystem.\n \nIf there is a security vulnerability in one of these products or components, and if there is a security exploit targeting it, we could face increased costs, liability claims, customer dissatisfaction, reduced revenue, or harm to our reputation or competitive position. Our insurance policies may not be adequate to compensate us for the \n14\npotential losses arising from any cybersecurity breach or incident. In addition, such insurance may not be available to us in the future on economically reasonable terms, or at all. Further, our insurance may not cover all claims made against us and could have high deductibles in any event, and defending a suit, regardless of its merit, could be costly and divert management attention.\nThese risks will increase as we continue to grow the scale of our Digital Printing and Scanning and Digital Imaging services and process, store, and transmit increasingly large amounts of our customers’, vendors’, and our own data. In particular, as remote working conditions have led businesses to increasingly rely on virtual environments and communication systems, there has been an increase in cyberattacks and other malicious activities.\nDamage or disruption to our facilities, including our technology center, could impair our ability to effectively provide our services and may have a significant effect on our revenues, expenses and financial condition.\nOur IT systems are an important part of our operations. We currently store customer data on a variety of servers, including servers hosted by Amazon Web Services and at our technology center located in San Ramon, California near known earthquake fault zones. Although we have redundant systems and offsite backup procedures in place, interruption in service, damage to or destruction of our technology center or a disruption of our data storage processes resulting from sustained process abnormalities, human error, acts of terrorism, violence, war or a natural disaster, such as fire, earthquake or flood, could result in delays, in reduced levels of customer service and have a material adverse effect on the markets in which we operate and on our business operations.\nAlthough we currently maintain general property damage insurance, if we incur losses from uninsured events, we could incur significant expenses which would adversely affect our results of operations, cash flows and financial condition.\nCatastrophic events, including global pandemics such as the COVID-19 pandemic, could materially adversely affect our business, results of operations and/or financial condition.\nThe occurrence of a major earthquake, fire, flood or other weather events, power loss, telecommunications failure, software or hardware malfunctions, pandemics (including the COVID-19 pandemic), cyber-attack, war, terrorist attack or other catastrophic event that our disaster recovery plans do not adequately address, could adversely affect our employees, our systems, our ability to produce and distribute our products, and our reputation. \nA catastrophic event resulting in the destruction or disruption of our workforce, our systems, our ability to produce and distribute our products, any of our data centers or our critical business or information technology systems could adversely affect our ability to conduct normal business operations and our operating results or cash flows. The adverse effects of any such catastrophic event would be exacerbated if experienced at the same time as another unexpected and adverse event, such as the COVID-19 pandemic.\nAdded risks are associated with our international operations.\nWe have international operations in China, India, the United Kingdom, Canada, and United Arab Emirates. Approximately 12% of our revenues for 2023 were derived from our international operations, with approximately 3% derived from China. We anticipate that future sales to international customers will continue to account for a significant percentage of our revenues. Risks associated with international sales and operations include, but are not limited to:\na.\nPolitical and economic instability, including the war between Ukraine and Russia, the conflict in Israel and neighboring regions and potential hostilities between China and Taiwan;\nb.\nInternational terrorism;\nc.\nGlobal economic sanctions and export controls, including U.S. export controls related to China, sanctions related to Russia, and increased scrutiny of exports of digital imaging and other products;\nd.\nFailure to comply with anti-bribery legislation, including the U.S. Foreign Corrupt Practices Act;\ne.\nChanges in legal and regulatory requirements, including complex trade compliance regulations;\nf.\nU.S. and foreign government policy changes affecting the markets for our products;\ng.\nChanges in tax laws and tariffs;\nh.\nAdditional deterioration in U.S. - China and U.S. - Russia relations;\ni.\nDifficulties in protection and enforcement of intellectual property rights;\nj.\nFailure to comply with the foreign data protection laws;\nk.\nNew and emerging non-U.S. regulations relating to environmental, social and governance and corporate social responsibility matters, which could be costly to comply with;\nl.\nTransportation, including piracy in international waters;\nm.\nCurrency exchange rate fluctuations; and\n15\nn.\nChallenges relating to managing a global workforce with diverse cultures, backgrounds and labor laws.\nThe impact of these factors is difficult to predict, but one or more of them could have a material adverse effect on our financial position, results of operations, or cash flows. Certain international contracts may also include industrial cooperation agreements requiring specific in-country purchases, investments, manufacturing agreements or other financial obligations, known as offset obligations, and may provide for penalties if we fail to meet such requirements.\nOur business could suffer if we fail to attract, retain, and successfully integrate skilled personnel.\nWe believe that our ability to attract, retain, and successfully integrate qualified personnel is critical to our success. As we continue to place more emphasis on document management and storage technology, our need to hire and retain software and other technology-focused personnel has increased, and can be expected to continue to increase. Competition for such personnel, particularly in the San Francisco Bay Area, is intense. If we lose key personnel and/or are unable to recruit qualified personnel, our ability to manage and grow our business will be adversely affected. In addition, the loss of the services of one or more members of our senior management team would disrupt our business and impede our ability to successfully execute our business strategy.\nWe may be exposed to employment-related claims and periodic litigation that could adversely affect our business and results of operations.\nWe are subject to a number of risks inherent to our status as an employer, including claims of misconduct or negligence on the part of our employees, claims by our employees and former employees of discrimination or harassment; claims relating to violations of wage, hour and other workplace regulations; and claims relating to employee benefits, entitlements to employee benefits, or errors in the calculation or administration of such benefits.\nIf we experience significant incidents in any of the above-described areas, we could face substantial out-of-pocket losses, or fines. In addition, such claims may give rise to litigation, which may be time consuming, distracting and costly, and could have a material adverse effect on our business.  \nEnvironmental, health, and safety laws and regulations, and the costs of compliance, could materially adversely affect our financial position, results of operations and cash flows.\nOur operations are subject to numerous laws and regulations governing environmental protection and occupational health and safety matters. Under these laws and regulations, we may be liable for, among other things, the cost of investigating and remediating contamination, regardless of fault or actions on our part. The amount of any such expense or related natural resource damages for which we may be held responsible could be substantial. We have incurred, and in the future may continue to incur, liability under environmental statutes and regulations with respect to the contamination detected at sites we own or operate (including contamination caused by prior owners and operators of such sites, abutters or other persons) and the sites at which we have disposed of hazardous substances. For example, we are currently performing environmental remediation at a property we acquired as part of a business acquisition in the 1990’s located in California. As of December 31, 2023, we have established a reserve totaling $4.5 million with respect to certain presently estimated environmental remediation costs. For additional discussion regarding the property and our estimated expenses see the discussion under the caption “\nSite Remediation Obligation\n” within Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations of this Annual Report on Form 10-K.  \nThe estimate of our final remediation expenses may change over time because of the varying costs of currently available cleanup techniques, unpredictable contaminant reduction rates associated with available cleanup techniques and the difficulty of determining in advance the nature and full extent of contamination. Based on our experience to date, we do not currently anticipate any material adverse effect on our business or consolidated financial position, results of operations or cash flows as a result of future compliance with existing environmental laws and regulations. However, evolving statutory and regulatory standards, their interpretation, more vigorous enforcement policies of regulatory agencies, or stricter or different interpretations of existing statutory and regulatory standards, may require additional expenditures by us, which may be material. Accordingly, there can be no assurance that we will not incur significant environmental compliance costs in the future.\nChanges in tax laws and interpretations could adversely affect our business.\nWe are subject to income and other taxes in the U.S. and in numerous foreign jurisdictions. Our domestic and foreign tax provisions are dependent on the jurisdictions in which profits are determined to be earned and taxed. Additionally, the amount of tax provision is subject to our interpretation of applicable tax laws in the jurisdictions in which we operate. A number of factors influence our effective tax rate, including changes in tax laws and treaties as well as the interpretation of existing laws and rules. Federal, state, and local governments and administrative bodies within the U.S., which represents a majority of our \n16\noperations, and other foreign jurisdictions have implemented, or are considering, a variety of broad tax, trade, and other regulatory reforms that may impact us. \nResults of tax examinations may adversely affect our future results of operations.\nWe are subject to various tax examinations on an ongoing basis. Adverse results of tax examinations for income, payroll, value added, sales-based and other taxes may require future material tax payments if we are unable to sustain our position with the relevant jurisdiction. Where appropriate, we have made accruals for these matters which are reflected in our Consolidated Balance Sheets and Statements of Operations.\nRisks Related to Our Indebtedness\nOur debt instruments impose certain restrictions on our ability to operate which in turn could negatively affect our ability to respond to changing business and market conditions and therefore could have an adverse effect on our business and results of operations.\nAs of December 31, 2023, we had $62.2 million in outstanding short and long-term borrowings under our credit facilities, and finance leases, excluding trade payables and operating leases. The terms of the agreements under which this indebtedness was incurred may limit or restrict, among other things, our ability to incur certain additional debt, make certain restricted payments, consummate certain asset sales, and enter into certain transactions with affiliates.\nWe are also required to maintain a total leverage ratio and fixed charge coverage ratio under our credit agreement with U.S. Bank National Association, dated April 22, 2021, or the 2021 Credit Agreement, as amended on June 15, 2023. Our inability to meet these ratios could result in the acceleration of the repayment of the outstanding obligations under the 2021 Credit Agreement, the termination of the lenders’ commitment to provide our revolving line of credit thereunder, the increase in our effective cost of funds or the cross-default of other credit arrangements. As a result, our ability to operate may be restricted and our ability to respond to business and market conditions may be limited, which could have an adverse effect on our business and operating results.\nRisks Related to Our Common Stock\nThe market prices of our common stock is volatile, and may be impacted by factors other than our financial performance, which could cause the value of an investment in our common stock to decline.\nThe market price of our common stock may fluctuate substantially due to a variety of factors, many of which are beyond our control. Between January 1, 2023, and December 31, 2023, the closing price of our common stock fluctuated from a low of $2.65 to a high of $3.84 per share. \nIn the past, stockholders have sometimes instituted securities class action litigation against companies following periods of volatility in the market price of their securities. Any similar litigation against us could result in substantial costs, divert management's attention as well as our other resources and could have a material adverse effect on our business, results of operations and financial condition.\n17\nThere can be no assurance that we will continue to declare dividends or repurchase shares of our common stock.\nOur Board of Directors has declared quarterly dividends in the past.\n \nOur ability to continue to pay quarterly dividends and to repurchase shares of our common stock is subject to capital availability and periodic determinations by our Board of Directors that dividends and repurchases of shares of our common stock are in the best interests of our stockholders and in compliance with applicable laws. Our dividend payments and repurchases of shares of our common stock may change from time to time. Management currently intends to continue quarterly dividends, and repurchases of shares of our common stock, subject to approval by our Board of Directors, but we cannot provide any assurance as to the timing, sustainability, or any particular amounts of future dividends and repurchases of shares of our common stock. A suspension in our dividend payments or repurchases of shares of our common stock could have a negative effect on the price of our common stock and would have a negative effect on returns on investment to our stockholders.\nOur third amended and restated by-laws provide that the Court of Chancery of the State of Delaware (or, if the Court of Chancery of the State of Delaware does not have jurisdiction, then the federal district court for the District of Delaware) is the exclusive forum for certain litigation that may be initiated by our stockholders, which could limit our stockholders’ ability to obtain a favorable judicial forum for such disputes with us or our directors, officers or employees\nOur amended and restated by-laws provide that, unless we consent in writing to the selection of an alternative forum, the Court of Chancery of the State of Delaware (or, if the Court of Chancery of the State of Delaware does not have jurisdiction, then the federal district court for the District of Delaware) shall, to the fullest extent permitted by law, be the sole and exclusive forum for (i) any derivative action or proceeding brought on behalf of the corporation, (ii) any action asserting a claim of breach of a fiduciary duty owed by any current or former director, officer, other employee or stockholder of the corporation to the corporation or the corporation’s stockholders, (iii) any action asserting a claim arising pursuant to any provision of the General Corporation Law of the State of Delaware or as to which the General Corporation Law of the State of Delaware confers jurisdiction on the Court of Chancery of the State of Delaware, or (iv) any action asserting a claim arising pursuant to any provision of our Certificate of Incorporation or our bylaws or governed by the internal affairs doctrine. This exclusive forum provision would not apply to suits brought to enforce a duty or liability created by the Securities Act, the Exchange Act or any other claim for which the federal courts have exclusive jurisdiction. \nThe choice of forum provision may limit a stockholder’s ability to bring a claim in a judicial forum that it finds favorable for disputes with us or our directors, officers or other employees, which may discourage such lawsuits against us and our directors, officers and other employees. Alternatively, if a court were to find the choice of forum provision contained in our third amended and restated by-laws to be inapplicable or unenforceable in an action, we may incur additional costs associated with resolving such action in other jurisdictions.",
    "item1b": ">Item 1B.\n \nUnresolved Staff Comments\n    \nNone.\nItem 1C.\n \nCybersecurit\ny\nWe believe that cybersecurity is important to how we operate as a company and as such we focus on defining and managing our cybersecurity risk. With the ever-changing cybersecurity landscape and continual emergence of new threats, our Board of Directors, Audit Committee, and senior management team ensure that significant resources are devoted to cybersecurity risk management and the technologies, processes and people that support it. We have steadily increased companywide awareness to strengthen our cybersecurity risk management practice and processes. We employ a risk-based cybersecurity program that leverages the National Institute of Standards and Technology (NIST) framework and is designed to protect, detect, identify, and respond to cybersecurity risks and incidents. We regularly assess critical areas of our cybersecurity program to identify cybersecurity strengths and weaknesses and provide valuable insights for mitigating cyber risks.\nOur cybersecurity team monitors networks and systems for potential signs of suspicious activity by utilizing, among other things, firewalls, intrusion detection systems,  multi-factor authentication, and encryption. Additionally, our cybersecurity program includes a security Incident Management policy to ensure that consistent, methodical, and timely incident response process is completed by the designated response team. The designated cybersecurity incident response team is responsible for managing and coordinating our cybersecurity incident response efforts. The incident management workflow with assigned duties and responsibilities streamlines the incident response and helps improve and mitigate the overall incident impact. \nWe engage cybersecurity consultants, and other third parties to enhance our cybersecurity practices. We conduct penetration testing, vulnerability, and other assessments with the assistance of these third parties. These tests and assessments \n18\nenhance our cybersecurity program. We also use third-party service providers to support our operations and technology initiatives. We evaluate third-party service providers from a cybersecurity risk landscape.\nOur Board of Directors oversees management’s processes for identifying and mitigating risks, including risks pertaining to cybersecurity. On a periodic basis, senior executives, including our Chief Technology Officer (CTO) present to the Board of Directors details of our cybersecurity initiatives and program and any incidents deemed to have a business impact, even if the impact is not material for us. The Board of Directors along with all committee members participate in discussions regarding cybersecurity risks. \nOur Information Technology and Security organization is managed by our Chief Technology Officer who has overall responsibility for monitoring and managing cybersecurity threats and incidents and for implementing cybersecurity policies, programs, procedures, and strategies. The Chief Technology Officer has vast experience in providing cyber security oversight.  \nDespite the continuous risk faced by the Company, we have suffered no incidents that have materially affected or are reasonably likely to materially affect the Company, including our business strategy, results of operations, or financial condition. Notwithstanding the exhaustive approach we take to cybersecurity, we may not be successful in preventing or mitigating a cybersecurity incident that could have a material adverse effect on our business, results of operations and financial condition. While we maintain cybersecurity insurance and have never had a cybersecurity claim, the costs related to cybersecurity threats or disruptions may not be fully insured. See Item 1A. “Risk Factors” for a discussion of cybersecurity risks. ",
    "item2": ">Item 2.\n \nProperties\nAt the end of 2023, we operated 146 service centers, of which 126 were in the United States, eight were in Canada, six  were in China, three were in the United Kingdom, two were in India, and one was in United Arab Emirates. We also occupied a technology center in Kolkata, India, as well as other facilities, including our executive offices located in San Ramon, California.\nIn total, the Company occupied approximately 1.0 million square feet as of December 31, 2023.\nWe lease nearly all of our service centers, and each of our administrative facilities and our technology centers. In addition to the facilities that are owned, our fixed assets are comprised primarily of machinery and equipment, vehicles, and computer equipment. We believe that our facilities are adequate and appropriate for the purposes for which they are currently used in our operations and are well maintained.",
    "item3": ">Item 3.\n \nLegal Proceedings\nWe are involved, and will continue to be involved, in legal proceedings arising out of the conduct of our business, including commercial and employment-related lawsuits. Some of these lawsuits purport or may be determined to be class actions and seek substantial damages, and some may remain unresolved for several years. We establish accruals for specific legal proceedings when it is considered probable that a loss has been incurred and the amount of the loss can be reasonably estimated. Our evaluation of whether a loss is reasonably probable is based on our assessment and consultation with legal counsel regarding the ultimate outcome of the matter. As of December 31, 2023, we have accrued for the potential impact of loss contingencies that are probable and reasonably estimable. We do not currently believe that the ultimate resolution of any of these matters will have a material adverse effect on our results of operations, financial condition, or cash flows. However, the results of these matters cannot be predicted with certainty, and an unfavorable resolution of one or more of these matters could have a material adverse effect on our results of operations, financial condition, or cash flows.\nFor additional discussion regarding certain environmental proceedings see the discussion in Note 6, \nCommitments and Contingencies - Site Remediation Obligation\n within Part IV, Item 15 - \"Exhibits and Financial Statement Schedule” of this Annual Report on Form 10-K.  ",
    "item4": ">Item 4.\n \nMine Safety Disclosures\nNot applicable.\n19\nPART II",
    "item5": ">Item 5.\n \nMarket for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nOur common stock, par value $0.001, is listed on the New York Stock Exchange or NYSE under the stock symbol “ARC”. \nHolders\nAs of February 16, 2024, the approximate number of stockholders of record of our common stock was 126. Because many of the shares of our common stock are held by brokers and other institutions on behalf of stockholders, we are unable to estimate the total number of beneficial owners represented by these stockholders of record.\nDividends\nIn December 2023, our Board of Directors declared a quarterly cash dividend of $0.05 per share of common stock that is payable on February 29, 2024 to stockholders of record as of January 31, 2024. The timing, declaration and payment of future dividends, however, falls within the discretion of our Board of Directors and will depend upon many factors, such as our financial condition and earnings, the capital requirements of our business, restrictions imposed by applicable law and our debt agreements and any other factors the Board of Directors deems relevant from time to time. \nIssuer Purchases of Equity Securities\nThe following table presents information regarding repurchases of our common stock for the periods presented:\n(In thousands, except for price per share)\n(a) Total Number of\nShares Purchased (1) \n(b) Average Price Paid per Share ($)\n(c) Total Number of Shares Purchased as Part of Publicly Announced Plans or Programs\n(d) Approximate Dollar Value of Shares That May Yet Be Purchased Under The Plans or Programs (1)\nPeriod\nOctober 1, 2023—October 31, 2023\n— \n— \n$\n8,676 \nNovember 1, 2023—November 30, 2023\n158 \n$\n2.80 \n158 \n$\n8,234 \nDecember 1, 2023—December 31, 2023\n74 \n$\n2.99 \n74 \n$\n8,013 \nTotal repurchases during the fourth quarter of 2023\n232 \n232 \n(1) On February 23, 2023, we announced that our Board of Directors expanded the repurchase program we previously announced on May 1, 2019 by an additional $5.0 million for an aggregate program size of $20.0 million through March 31, 2026. Under the repurchase program, purchases of shares of common stock may be made from time to time in the open market, or in privately negotiated transactions, in compliance with applicable state and federal securities laws. The timing and amounts of any purchases will be based on market conditions and other factors including price, regulatory requirements, and capital availability. The stock repurchase program does not obligate us to acquire any specific number of shares in any period, and may be expanded, extended, modified or discontinued at any time without prior notice.",
    "item6": ">Item 6.\n [\nReserved.]\n20",
    "item7": ">Item 7.\n Management’s Discussion and Analysis of Financial Condition and Results of Operations\nBusiness Summary\nARC Document Solutions Inc. is a digital printing company. We provide digital printing and document-related services to customers in a growing variety of industries. Our primary services are:\n•\ndigital printing of general and specialized business documents such as those found in marketing and advertising, engineering and construction and other industries, as well as producing highly-customized display graphics of all types and sizes;\n•\nacquiring, placing and managing ARC-certified office printing equipment with proprietary device tracking and print management software at our customers’ offices and job sites;\n•\nscanning documents, indexing them and adding digital search features for use in digital document management, document archives and facilities management, as well as providing other digital imaging services; and,\n•\nreselling digital printing equipment and supplies.\nEach of these services frequently include additional logistics services in the form of distributing and delivering finished documents, installing display graphics, or the digital storage of graphic files. \nFor a more complete description of our business, and product and service offerings, see Part I, Item 1 - \"Business\" - of this Annual Report on Form 10-K.\nCosts and Expenses \nOur cost of sales consists primarily of materials (paper, toner and other consumables), labor, and “indirect costs.” Indirect costs consist primarily of equipment expenses related to our MPS locations (typically our customers’ offices and job sites) and our service centers. Facilities and equipment expenses include maintenance, repairs, rents, insurance, and depreciation. Paper is the largest component of our material cost; however, the impact of paper pricing on our operating margins is mitigated, and in some cases eliminated, as it is often passed on to our customers. We closely monitor material cost as a percentage of net sales to measure volume and waste, and we maintain low levels of inventory. We also track labor utilization, or net sales per employee, to measure productivity and determine staffing levels.\nThe effects of the 2022 global supply chain disruptions on our business eased in 2023. The supply chain disruptions for us were primarily confined to price increases. As noted above, price increases are often passed on to our customers. Our labor costs have increased moderately as we sought to retain valuable employees and competed for new hires in 2023. While these increases had an effect on our results of operations, we believe our cost optimization initiatives allowed us to mitigate their impact and will allow us to continue to manage them in future periods.\nHistorically, our capital expenditure requirements have varied based on our need for printing equipment in our MPS locations and service centers. Over the past several years, the pandemic has reduced the number of employees in our customers’ locations, which has, in turn, reduced the need for equipment. We believe this equipment trend has become permanent and, as a result, we think our past two years of capital expenditures are more indicative of our future capital needs than our longer-term history suggests. \nBecause our relationships with credit providers allow us to obtain attractive lease rates, we have historically chosen to lease rather than purchase most of our equipment. Due in part to the rising cost of capital in 2023, we have adjusted our historical equipment acquisition strategy and used more of our available cash to purchase equipment during the prior year to reduce the impact of interest expense on our operating results.\nResearch and development costs consist mainly of the salaries, leased building space, and computer equipment related to our data storage and development centers in San Ramon, California and Kolkata, India. Such costs are primarily recorded to cost of sales.\n21\nCOVID-19 Pandemic\nThe COVID-19 pandemic adversely impacted our financial performance from 2020 to 2022, but we expect that its acute impact is behind us. We believe, however, that the reduced in office presence of employees brought on by the COVID-19 pandemic are permanent. As a result, our MPS business has been and remains under pressure as most employers have left work-from-home policies in place and less equipment is needed to support them in typical office spaces. By contrast, we believe work-from-home and hybrid work practices benefit our scanning business because employees need access to documents, regardless of where they are working, and document scanning is the first step in making them accessible in the cloud. \nUncertainty around the potential disruption to our business related to the COVID-19 pandemic and its effect on the U.S. economy and our clients’ ongoing business operations has diminished, but we remain watchful and prepared to alter our business operations to protect employees and customers. \nMarket Review\nWe believe the expanding list of industries we serve are generally growing and offer ongoing sales opportunities for our services. \nDemand for digital printing appears high across our customer base, and includes environmental graphics, marketing and promotional work. We believe that the desire to communicate visually—and especially in color—is growing in all areas of commerce, in office environments, in educational venues, and in public spaces of all kinds. While office capacity has fluctuated in recent years due to work-from-home and hybrid work policies, we have experienced minimal desire among our customers to completely abandon in office work, and we have many customers who have expressed a desire to make work spaces more inviting and engaging for the people who occupy them. \n While the demand for MPS has declined from its peak, we believe it remains sought after by many clients, due to our flexible print network capacity, use of certified used equipment to reduce hardware costs, and ability to create efficiencies in the printing environment through our software and services. Unlike MPS, work-from-home and other remote document access requirements increase demand for scanning and digital imaging services.\nIn 2023, construction activity was constrained by higher interest rates and continuing labor shortages. The volume of construction plan printing fell alongside the reduction in construction activity. While we expect building activity to increase as interest rates ease, we do not expect the use of construction plan printing to be commensurate with it.\nEconomic inflation in the U.S., Canada and abroad has materially affected our business over the past year, primarily in the form of higher labor and raw material costs. Price increases in materials continue to be passed on to our customers, as well as some of the labor cost increases. Supply chain disruptions, other than price increases, have largely resolved in 2023, and we believe we remain reasonably protected from them due to the wide variety of suppliers we have developed relationships with over our history.\n22\nResults of Operations\n2023 Versus 2022\n \nYear Ended December 31,\nIncrease (decrease)\n(In millions, except percentages)\n2023 \n(1)\n2022 \n(1)\n$ \n(1)\n%\nDigital Printing\n$\n170.1\n \n$\n174.8 \n$\n(4.7)\n(2.7)\n%\nMPS\n74.8\n \n75.8 \n(1.0)\n(1.3)\n%\nScanning and Digital Imaging\n20.3\n \n17.4 \n3.0\n \n17.0\n \n%\nTotal services sales\n$\n265.2\n \n$\n267.9 \n$\n(2.7)\n(1.0)\n%\nEquipment and Supplies sales\n16.0\n \n18.1 \n(2.1)\n(11.5)\n%\nTotal net sales\n$\n281.2\n \n$\n286.0 \n$\n(4.8)\n(1.7)\n%\nGross profit\n$\n94.4\n \n$\n96.0 \n$\n(1.6)\n(1.7)\n%\nSelling, general and administrative expenses\n$\n76.3\n \n$\n77.5 \n$\n(1.2)\n(1.6)\n%\nAmortization of intangibles\n$\n—\n \n$\n0.1 \n$\n(0.1)\n(57.7)\n%\nSite remediation expense\n$\n4.0\n \n$\n— \n$\n4.0\n \n—\n \n%\nInterest expense, net\n$\n1.6\n \n$\n1.8 \n$\n(0.2)\n(9.1)\n%\nIncome tax provision \n$\n4.4\n \n$\n5.8 \n$\n(1.4)\n(24.8)\n%\nNet income attributable to ARC\n$\n8.2\n \n$\n11.1 \n$\n(2.9)\n(25.8)\n%\nAdjusted net income attributable to ARC\n (2)\n$\n11.8\n \n$\n12.0 \n$\n(0.2)\n(1.8)\n%\nCash flows provided by operating activities\n$\n36.6\n \n$\n37.2 \n$\n(0.6)\n(1.7)\n%\nEBITDA \n(2)\n$\n31.9\n \n$\n39.1 \n$\n(7.3)\n(18.5)\n%\nAdjusted EBITDA \n(2)\n$\n38.1\n \n$\n40.9 \n$\n(2.8)\n(6.8)\n%\n(1)\nColumn does not foot due to rounding.\n(2)\nNon-GAAP financial measure. See \"Non-GAAP Financial Measures\" following \"Results of Operations\" for definitions, reconciliations and more information related to our Non-GAAP disclosures.\nThe following table provides information on the percentages of certain items of selected financial data as a percentage of net sales for the periods indicated:\n \nAs Percentage of Net Sales\nYear Ended December 31,\n \n2023 \n(1)\n2022 \n(1)\nNet Sales\n100.0\n \n%\n100.0 \n%\nCost of sales\n66.4\n \n66.4 \nGross profit\n33.6\n \n33.6 \nSelling, general and administrative expenses\n27.1\n \n27.1 \nAmortization of intangibles\n—\n \n— \nSite remediation expense\n1.4\n \n— \nIncome from operations\n5.0\n \n6.4 \nInterest expense, net\n0.6\n \n0.6 \nIncome before income tax provision\n4.4\n \n5.8 \nIncome tax provision\n1.6\n \n2.0 \nNet income \n2.9\n \n3.8 \nLoss attributable to the noncontrolling interest\n0.1\n \n0.1 \nNet income attributable to ARC\n2.9\n \n%\n3.9 \n%\nEBITDA \n(2)\n11.3\n \n%\n13.7 \n%\nAdjusted EBITDA \n(2)\n13.6\n \n%\n14.3 \n%\n \n(1)\nColumn does not foot due to rounding.\n(2)\nNon-GAAP financial measure. See \"Non-GAAP Financial Measures\" following \"Results of Operations\" for definitions, reconciliations and more information related to our Non-GAAP disclosures.\n23\nFiscal Year Ended December 31, 2023 Compared to Fiscal Year Ended December 31, 2022 \nNet Sales\nNet sales in 2023 decreased 1.7%, compared to 2022. The decrease in net sales was primarily driven by the decrease in sales from Digital Printing and Equipment & Supplies, partially offset by the year-over-year increase in sales from Scanning and Digital Imaging services.\nDigital Printing\n.\n Sales of Digital Printing services in 2023 decreased by $4.7 million, or 2.7%, compared to 2022. Year-over-year sales increased in digital color graphic printing from new and existing customers, and we experienced continuing demand for digital color graphic printing across most of our customer base. This growth was offset by the decrease of sales in digital plan printing for construction, which we attribute to less activity and lower spending on new building projects due to higher interest rates and increased costs of capital. Digital Printing services represented 60% and 61% of total net sales for 2023 and 2022, respectively. \nMPS\n.\n Sales of MPS services in 2023 decreased by $1.0 million, or 1.3%, compared to 2022. Fewer employees returning to the workplace after the pandemic has generally constrained onsite print volumes. Revenues from MPS sales represented approximately 27% of total net sales for both 2023 and 2022.\nThe number of MPS locations has decreased to approximately 10,440 locations as of December 31, 2023 from 10,720 as of December 31, 2022.\nScanning and Digital Imaging\n.\n Year-over-year sales of Scanning and Digital Imaging services increased by $3.0 million, or 17.0%, in 2023, compared to 2022. The increase in sales of our Scanning and Digital Imaging services was primarily attributable to growing demand for paper-to-digital document conversions used in day-to-day business operations, and the creation of digital archives to replace long-term warehoused paper document storage. We are expanding operational capacity in this service line, and plan to continue to drive an expansion of our addressable market for Scanning and Digital Imaging services with increased marketing activity, as well as by targeting building owners and facility managers that require on-demand access to their legacy documents to operate their assets efficiently. We believe that, with the expansion of the markets and industries we serve and the desire of our existing customers to have digital access to documents, our Scanning and Digital Imaging services will continue to grow in the future.\nEquipment and Supplies\n.\n Equipment and Supplies sales decreased by $2.1 million, or 11.5%, in 2023, compared to 2022. The decrease was primarily driven by the ongoing economic slowdown in China, which decreased sales from UNIS Document Solutions Co. Ltd, or UDS, our Chinese joint venture. Equipment and Supplies sales continue to decline in the U.S. as well. We attribute the decrease in sales to our customers' reluctance to acquire equipment while interest rates remain high and, in certain markets including China, economic activity remains depressed. Equipment and Supplies sales derived from UDS, were $1.7 million in 2023, as compared to $2.5 million in 2022. Equipment and Supplies sales represented approximately 6% of total net sales for 2023 for 2022, respectively. \nGross Profit \nGross profit decreased to $94.4 million in 2023, compared to $96.0 million in 2022. Despite a sales decrease of $4.8 million in 2023, gross profit decreased by just $1.6 million. Gross margin remained flat at 33.6% in 2023, compared to 2022. Gross margin stability was driven by improved efficiency in our cost structure and a reduction in depreciation expense of $2.6 million. Offsetting these cost reductions were increased labor expenses related to the growth in Scanning and Digital Imaging Services, as well as wage inflation pressures across our workforce during 2023.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses decreased by $1.2 million, or 1.6%, in 2023 compared to 2022. The decrease was primarily driven by lower commission and bonus accruals due to the decline in net sales and net income attributable to us.\nAmortization of Intangibles\nAmortization of intangibles decreased to less than $0.1 million in 2023 as compared to $0.1 million in 2022, primarily due to the completed amortization of certain customer relationships related to historical acquisitions.\n24\nSite Remediation Expense\nWe are currently involved in a site remediation obligation due to a former gas station that had been situated on a property we obtained as part of a business acquisition in the late 1990s. In 2020, the local County's Department of Environmental Health, or CDEH, approved our remedial clean-up plan, hence a liability on an undiscounted basis for $0.6 million for costs attributable to our clean-up plan was established. Additional review conducted in the fourth quarter of 2023 identified certain additional potential risks arising out of a structure on a neighboring property. As a result, in December of 2023, the CDEH requested that an alternative remedial plan be developed and submitted by March 12, 2024, to address the structural aspects of the site. We are in the process of finalizing an alternative plan with the guidance and expertise of an environmental consulting firm engaged expressly for this purpose. The additional concerns identified in December 2023 require more complex remediation measures for a longer duration than those contained in the plan approved by the CDEH in 2020. In light of the expected increase in expenses associated with remediating the site we have increased the reserve by approximately $4.0 million, reflecting a total reserve on an undiscounted basis of $4.5 million as of December 31, 2023. We have accrued probable and reasonably estimable costs for the resolution of the obligation based upon types of remediation efforts currently anticipated, the volume of contaminants in the impacted areas, regulatory oversight and other costs. The history of this site remediation obligation is summarized in Note 6, \nCommitments and Contingencies - Site Remediation Obligation \nwithin Part IV, Item 15 - \"Exhibits and Financial Statement Schedule” of this Annual Report on Form 10-K.\nInterest Expense, Net\nNet interest expense totaled $1.6 million in 2023, compared to $1.8 million in 2022. The decrease in 2023 compared to 2022 was due to the continuing reduction of our overall debt, partially offset by increases in interest rates.\nIncome Taxes\nWe recorded an income tax provision of $4.4 million in relation to pretax income of $12.5 million for 2023, which resulted in an effective income tax rate of 35.2%. In addition to recurring state and foreign taxes and certain nondeductible expenses, our effective income tax rate for 2023 was impacted by an expiration of tax credits which were offset by a change in valuation allowances against those and other certain deferred tax assets and stock based compensation forfeitures. Excluding the impact of those expirations and valuation allowances, stock based compensation forfeitures and other discrete items, our effective income tax rate for the consolidated company would have been 29.2% and our effective income tax rate attributable to ARC Document Solutions, Inc. would have been 29.1%. \nWe recorded an income tax provision of $5.8 million in relation to pretax income of $16.6 million for 2022, which resulted in an effective income tax rate of 35.1%. In addition to recurring state and foreign taxes and certain nondeductible expenses, our effective income tax rate for 2022 was primarily impacted by a change in valuation allowances against certain deferred tax assets and stock-based compensation forfeitures. Excluding the impact of valuation allowances, stock based compensation forfeitures and other discrete items, our effective income tax rate for the consolidated company would have been 29.4% and our effective income attributable to ARC Document Solutions, Inc. would have been 29.1%.\nNoncontrolling Interest\nNet income attributable to noncontrolling interest represents 35% of the income of our Chinese joint venture with UDS and its subsidiaries, which together comprise our Chinese joint-venture operations.\nImpact of Inflation\nRising costs for raw materials, such as paper, inks and toners were largely passed on to customers through price increases during 2022 and 2023, moderating the impact of inflation on our financial results. As these inflationary pressures continue, however, the increased cost of labor, materials, and other indirect costs require close and active management to avoid material impacts to our cost structure. \nNet Income Attributable to ARC\nNet income attributable to us was $8.2 million in 2023, as compared to $11.1 million in 2022. The decrease in net income attributable to us in 2023 was primarily driven by the increase in the site remediation reserve, net of taxes, noted above. \nEBITDA\nEBITDA margin and Adjusted EBITDA margin is not a recognized measure under GAAP. When analyzing our operating performance, investors should use EBITDA margin and Adjusted EBITDA in addition to, and not as an alternative for, operating income or any other performance measure presented in accordance with GAAP. It is a measure we use to measure our \n25\nperformance and liquidity. We believe EBITDA margin and Adjusted EBITDA reflect an additional way of viewing aspects of our operations that, when viewed with our GAAP results, provides a more complete understanding of factors and trends affecting our business. We believe the measure is used by investors and is a useful indicator to measure our performance. Because not all companies use identical calculations, our presentation of EBITDA margin and Adjusted EBITDA may not be comparable to similarly titled measures of other companies. See Non-GAAP Financial Measures below for additional discussion.\nEBITDA margin decreased to 11.3% in 2023 from 13.7% in 2022. Excluding the effect of the site remediation expense and stock-based compensation, adjusted EBITDA margin decreased slightly to 13.6% in 2023 from 14.3% in 2022. The decrease is largely attributable to lower sales and an increase in labor costs.\nNon-GAAP Financial Measures\nEBITDA, EBITDA margin, Adjusted EBITDA, Adjusted EBITDA margin, adjusted net income and adjusted earnings per share presented in this report are supplemental measures of our performance that are not required by or presented in accordance with accounting principles generally accepted in the United States of America or GAAP. These measures are not measurements of our financial performance under GAAP and should not be considered as alternatives to net income, net income margin, income from operations, diluted earnings per share or any other performance measures presented in accordance with GAAP or as an alternative to cash flows from operating, investing or financing activities as a measure of our liquidity. We have presented these measures because we consider them important supplemental measures of our performance and liquidity. We believe investors may also find these measures meaningful, given how our management makes use of them. The following is a discussion of our use of these measures. \nEBITDA represents net income before interest, taxes, depreciation and amortization. EBITDA margin is a non-GAAP measure calculated by dividing EBITDA by net sales.\nWe use EBITDA and EBITDA margin to measure and compare the performance of our operating divisions. Our operating divisions financial performance includes all of the operating activities except debt and taxation which are managed at the corporate level for U.S. operating divisions. We use EBITDA and EBITDA margin to compare the performance of our operating divisions and to measure performance for determining consolidated-level compensation. In addition, we use EBITDA and EBITDA margin to evaluate potential acquisitions and potential capital expenditures.\nEBITDA and EBITDA margin have limitations as analytical tools, and should not be considered in isolation, or as a substitute for analysis of our results as reported under GAAP. Some of these limitations are as follows:\n•\nThey do not reflect our cash expenditures, or future requirements for capital expenditures and contractual commitments;\n•\nThey do not reflect changes in, or cash requirements for, our working capital needs;\n•\nThey do not reflect the significant interest expense, or the cash requirements necessary, to service interest or principal payments on our debt;\n•\nAlthough depreciation and amortization are non-cash charges, the assets being depreciated and amortized will often have to be replaced in the future, and EBITDA does not reflect any cash requirements for such replacements; and\n•\nOther companies, including companies in our industry, may calculate these measures differently than we do, limiting their usefulness as comparative measures.\nBecause of these limitations, EBITDA and related ratios should not be considered as measures of discretionary cash available to us to invest in business growth or to reduce our indebtedness. We compensate for these limitations by relying primarily on our GAAP results and using EBITDA and EBITDA margin only as supplements.\nOur presentation of adjusted net income and adjusted EBITDA is an attempt to provide meaningful comparisons to our historical performance for our existing and future investors. The unprecedented changes in our end markets over the past several years have required us to take measures that are unique in our history and specific to individual circumstances. Comparisons inclusive of these actions make normal financial and other performance patterns difficult to discern under a strict GAAP presentation. Each non-GAAP presentation, however, is explained in detail in the reconciliation tables below.\n26\nSpecifically, we have presented adjusted net income attributable to ARC and adjusted earnings per share attributable to ARC stockholders for 2023 and 2022 to reflect the exclusion of the site remediation expense and changes in the valuation allowances related to certain deferred tax assets and other discrete tax items. This presentation facilitates a meaningful comparison of our operating results for 2023 and 2022. We believe these changes were the result of items which are not indicative of our actual operating performance.\nWe have presented adjusted EBITDA for 2023 and 2022 to exclude the site remediation expense as it is not indicative of our ongoing operations. We have presented adjusted EBITDA for 2023 and 2022 to also exclude stock-based compensation expense, as it is consistent with the definition of adjusted EBITDA in our Credit Agreement; therefore, we believe this information is useful to investors assessing our financial performance. We calculate adjusted EBITDA margin by dividing adjusted EBITDA by net sales. \nThe following is a reconciliation of cash flows provided by operating activities to EBITDA:\n \n \nYear Ended December 31,\n(In thousands)\n2023\n2022\nCash flows provided by operating activities\n$\n36,583\n \n$\n37,227 \nChanges in operating assets and liabilities\n(4,798)\n1,128 \nNon-cash expenses\n(6,078)\n(7,140)\nIncome tax provision\n4,387\n \n5,832 \nInterest expense, net\n1,633\n \n1,796 \nLoss attributable to the noncontrolling interest\n161\n \n304 \nEBITDA\n$\n31,888\n \n$\n39,147 \nThe following is a reconciliation of net income attributable to ARC Document Solutions, Inc. stockholders to EBITDA and adjusted EBITDA:\n \nYear Ended December 31,\n(In thousands)\n2023\n2022\nNet income attributable to ARC Document Solutions, Inc. stockholders\n$\n8,235\n \n$\n11,094 \nInterest expense, net\n1,633\n \n1,796 \nIncome tax provision\n4,387\n \n5,832 \nDepreciation and amortization\n17,633\n \n20,425 \nEBITDA\n31,888\n \n39,147 \nSite remediation expense\n4,000\n \n— \nStock-based compensation\n2,232\n \n1,773 \nAdjusted EBITDA\n$\n38,120\n \n$\n40,920 \nThe following is a reconciliation of net income margin attributable to ARC Document Solutions, Inc. stockholders to EBITDA margin and adjusted EBITDA margin:\n \nYear Ended December 31,\n \n2023\n (1)\n2022 \n(1)\nNet income margin attributable to ARC Document Solutions, Inc. stockholders\n2.9\n \n%\n3.9 \n%\nInterest expense, net\n0.6\n \n0.6 \nIncome tax provision\n1.6\n \n2.0 \nDepreciation and amortization\n6.3\n \n7.1 \nEBITDA margin\n11.3\n \n13.7 \nSite remediation expense\n1.4\n \n— \nStock-based compensation\n0.8\n \n0.6 \nAdjusted EBITDA margin\n13.6\n \n%\n14.3 \n%\n(1)\nColumn does not foot due to rounding.\n27\nThe following is a reconciliation of net income attributable to ARC Document Solutions, Inc. stockholders to adjusted net income and adjusted earnings per share attributable to ARC Document Solutions, Inc. stockholders:\n \nYear Ended December 31,\n(In thousands, except per share data)\n2023\n2022\nNet income attributable to ARC Document Solutions, Inc. stockholders\n$\n8,235\n \n$\n11,094 \nSite remediation expense\n4,000\n \n— \nIncome tax benefit related to above item\n(1,018)\n— \nDeferred tax valuation allowance and other discrete tax items\n567\n \n905 \nAdjusted net income attributable to ARC Document Solutions, Inc. stockholders\n$\n11,784\n \n$\n11,999 \nActual:\nEarnings per share attributable to ARC Document Solutions, Inc. stockholders:\nBasic\n$\n0.19\n \n$\n0.26 \nDiluted\n$\n0.19\n \n$\n0.26 \nWeighted average common shares outstanding:\nBasic\n42,543\n \n42,214 \nDiluted\n43,484\n \n43,280 \nAdjusted:\nEarnings per share attributable to ARC Document Solutions, Inc. stockholders:\nBasic\n$\n0.28\n \n$\n0.28 \nDiluted\n$\n0.27\n \n$\n0.28 \nWeighted average common shares outstanding:\nBasic\n42,543\n \n42,214 \nDiluted\n43,484\n \n43,280 \nLiquidity and Capital Resources\nOur principal sources of cash have been cash flows from operations and borrowings under our debt and lease agreements. Our recent historical uses of cash have been for ongoing operations, payment of principal and interest on outstanding debt obligations, capital expenditures, dividends and stock repurchases.\nWe continually assess our capital allocation strategy, including decisions relating to dividends, repurchase shares of our common stock, capital expenditures, and debt pay-downs. The timing, declaration and payment of future dividends, however, falls within the discretion of our Board of Directors and will depend upon many factors, including our financial condition and earnings, the capital requirements of our business, restrictions imposed by applicable law and the terms of any of our debt agreements and any other factors the Board of Directors deems relevant from time to time.\nIn February 2023, our Board of Directors approved a stock repurchase program that authorized us to purchase up to $20.0 million of our outstanding common stock through March 31, 2026. Purchases may be made from time to time in the open market at prevailing market prices or in privately negotiated transactions. During the year ended December 31, 2023 we repurchased 1.0 million shares of our common stock for a total purchase price of $3.2 million. During the year ended December 31, 2022 we repurchased 0.6 million shares of our common stock for a total purchase price of $1.7 million.\nTotal cash and cash equivalents as of December 31, 2023 was $56.1 million. Of this amount, $5.7 million was held in foreign countries, with $2.6 million held in China. Repatriation of some of our cash and cash equivalents in foreign countries could be subject to delay for local country approvals and could have potential adverse tax consequences. As a result of holding cash and cash equivalents outside of the U.S., our financial flexibility may be reduced.\nSupplemental information pertaining to our historical sources and uses of cash is presented as follows and should be read in conjunction with our Consolidated Statements of Cash Flows and notes thereto included elsewhere in this report.\n \nYear Ended December 31,\n(In thousands)\n2023\n2022\nNet cash provided by operating activities\n$\n36,583\n \n$\n37,227 \nNet cash used in investing activities\n$\n(10,389)\n$\n(5,574)\nNet cash used in financing activities\n$\n(22,637)\n$\n(34,155)\n28\nOperating Activities\nCash flows from operations are primarily driven by sales and the net profit generated from these sales, excluding non-cash charges.\nThe decrease in cash flows from operations in 2023 was primarily due to the decrease in net income partially offset by the improvement in our collection of accounts receivables.  \nDays sales outstanding, or DSO was 47 days as of December 31, 2023 as compared to 51 days as of December 31, 2022. We are closely managing cash collections.\nDSO is calculated by taking the respective years December 31\nst\n, accounts receivable balance divided by the net sales during the fourth quarter of that year multiplied by the number of total days in a quarter.   \nWe have presented DSO because we consider it an important metric as it is a valuable indicator of the efficiency of the business  and quality of our cash flows. We believe investors may also find this metric meaningful given the importance of cash flows from operations and management's ability to efficiently manage our working capital.\nInvesting Activities\nNet cash used in investing activities was primarily related to capital expenditures. We incurred capital expenditures totaling $10.8 million and $5.9 million, in 2023 and 2022, respectively. The year-over-year increase in capital expenditures is driven primarily by our decision to enter into fewer leases and acquire more equipment outright in 2023 due to increasing interest rates.\nFinancing Activities\nNet cash of $22.6 million used in financing activities in 2023 primarily relates to payments on our finance leases, dividends, and repurchases of shares of our common stock, partially offset by proceeds from stock option exercises.  Our need for printing equipment has significantly decreased over the past several years, resulting in a decrease of $4.2 million in our finance lease liability as of December 31, 2023 compared to the balance in the prior year. This reduction in the finance lease liability will also drive a further reduction in 2024 payments for financed leases. \nOur cash position, working capital, and debt obligations as of December 31, 2023 and 2022 are shown below and should be read in conjunction with our Consolidated Balance Sheets and notes thereto contained elsewhere in this report.\n \nDecember 31,\n(In Thousands)\n2023\n2022\nCash and cash equivalents\n$\n56,093\n \n$\n52,561 \nWorking capital\n$\n37,495\n \n$\n34,906 \nBorrowings from revolving credit facility\n$\n40,000\n \n$\n40,000 \nVarious finance leases\n22,236\n \n26,474 \nTotal debt obligations\n$\n62,236\n \n$\n66,474 \nThe increase of $2.6 million in working capital in 2023 was primarily driven by the increase in cash of $3.5 million and $2.7 million decrease in the current portion of our finance lease liability, partially offset by a $3.0 million decrease in accounts receivable and an increase in accounts payable over 2022. To manage our working capital, we chiefly focus on our DSO and monitor the aging of our accounts receivable, as receivables are the most significant element of our working capital. \nWe believe that our current cash and cash equivalents balance of $56.1 million, the availability under our 2021 Credit Agreement, the availability under our equipment lease lines, and cash flows provided by operations should be adequate to cover the next twelve months and beyond of working capital needs, debt requirements consisting of scheduled principal and interest payments, and planned capital expenditures, to the extent such items are known or are reasonably determinable based on current business and market conditions. See “\nDebt Obligations\n” section for further information related to our 2021 Credit Agreement. \nA significant portion of our revenue across all of our product and services is generated from customers in the AEC/O industry. As a result, our operating results and financial condition can be significantly affected by economic factors that influence the AEC/O industry, including the disruptions in the capital markets, economic sanctions and economic slowdowns or \n29\nrecessions, rising inflation, public health crises, like the COVID-19 pandemic, and interest rates fluctuations. Additionally, a general economic downturn may adversely affect the ability of our customers and suppliers to obtain financing for significant operations and purchases, and to perform their obligations under their agreements with us. We believe that credit constraints in the financial markets could result in a decrease in, or cancellation of, existing business, could limit new business, and could negatively affect our ability to collect our accounts receivable on a timely basis.\nWe have not been actively seeking growth through acquisition since 2009, but will consider acquisitions that we feel add value to the overall company.\nDebt Obligations\nCredit Agreement \nOn June 15, 2023, we entered into an amendment, or the Amendment, to our Credit Agreement dated as of April 22, 2021, or the 2021 Credit Agreement, with U.S. Bank National Association, as administrative agent and the lenders part thereto. The Amendment, among other things, modifies certain terms of the 2021 Credit Agreement to replace the relevant benchmark provisions from the London Interbank Offered Rate to the forward-looking term rate based on the Secured Overnight Financing Rate, or SOFR. The Amendment also modifies certain terms of the 2021 Credit Agreement relating to the payment of dividends and stock repurchases made by us and the related component calculations included in the fixed charge coverage ratio that we are required to maintain. After giving effect to the Amendment, we are permitted to repurchase up to $10.0 million of shares of our common stock in any twelve-month period and all such permitted stock repurchases will be excluded from the calculation of the fixed charge coverage ratio. In addition, we are permitted to make other restricted payments that are not stock repurchases, such as the payment of dividends, of up to $12.0 million during any twelve-month period which will also be excluded from the calculation of the fixed charge coverage ratio. The making of stock repurchases and the payment of dividends and other restricted payments is subject, in each case, to pro forma compliance with the financial covenants and other customary conditions set forth in the 2021 Credit Agreement.\nThe 2021 Credit Agreement provides for the extension of revolving loans in an aggregate principal amount not to exceed $70 million and replaces the Credit Agreement dated as of November 20, 2014, as amended, or the 2014 Credit Agreement. The obligation under the 2021 Credit Agreement matures on April 22, 2026.\nAs of December 31, 2023, our borrowing availability under the Revolving Loan commitment was $27.8 million, after deducting outstanding letters of credit of $2.2 million and an outstanding Revolving Loan balance of $40.0 million.\nLoans borrowed under the 2021 Credit Agreement bear interest, in the case of Term SOFR loans, at a per annum rate equal to the applicable Term SOFR (which rate shall not be less than zero), plus a margin ranging from 1.25% to 1.75%, based on our Total Leverage Ratio (as defined in the 2021 Credit Agreement). Loans borrowed under the 2021 Credit Agreement that are not Term SOFR loans bear interest at a per annum rate equal to the Alternate Base Rate (as such terms is defined in the 2021 Credit Agreement) plus a margin ranging from 0.25% to 0.75%, based on our Total Leverage Ratio. As of December 31, 2023, one month Term SOFR loans borrowed under the 2021 Credit Agreement accrued interest at 6.8%. We pay certain recurring fees with respect to the 2021 Credit Agreement, including administration fees to the administrative agent.\nSubject to certain exceptions, including, in certain circumstances, reinvestment rights, the loans extended under the 2021 Credit Agreement are subject to customary mandatory prepayment provisions with respect to: the net proceeds from certain asset sales; the net proceeds from certain issuances or incurrences of debt (other than debt permitted to be incurred under the terms of the 2021 Credit Agreement); the net proceeds from certain issuances of equity securities; and net proceeds of certain insurance recoveries and condemnation events.\nThe 2021 Credit Agreement contains customary representations and warranties, subject to limitations and exceptions, and customary covenants restricting the ability (subject to various exceptions) we and our subsidiaries to: incur additional indebtedness (including guarantee obligations); incur liens; sell certain property or assets; engage in mergers or other fundamental changes; consummate acquisitions; make investments; pay dividends, other distributions or repurchase equity interest of us or our subsidiaries; change the nature of their business; prepay or amend certain indebtedness; engage in certain transactions with affiliates; amend our organizational documents; or enter into certain restrictive agreements. In addition, the 2021 Credit Agreement contains financial covenants which requires we maintain (i) at all times, a Total Leverage Ratio in an amount not to exceed 2.75 to 1.00; and (ii) a Fixed Charge Coverage Ratio (as defined in the 2021 Credit Agreement), as of the last day of each fiscal quarter, an amount not less than 1.15 to 1.00.  We were in compliance with our covenants as of December 31, 2023. \nThe 2021 Credit Agreement contains customary events of default, including with respect to: nonpayment of principal, interest, fees or other amounts; failure to perform or observe covenants; material inaccuracy of a representation or warranty \n30\nwhen made; cross-default to other material indebtedness; bankruptcy, insolvency and dissolution events; inability to pay debts; monetary judgment defaults; actual or asserted invalidity or impairment of any definitive loan documentation, repudiation of guaranties or subordination terms; certain ERISA related events; or a change of control.\nThe obligations of our subsidiary that is the borrower under the 2021 Credit Agreement are guaranteed by us and each of our other United States domestic subsidiaries. The 2021 Credit Agreement and any interest rate protection and other hedging arrangements provided by any lender party to the credit facility or any affiliate of such a lender are secured on a first priority basis by a perfected security interest in substantially all of our and each guarantor’s assets (subject to certain exceptions).\nCredit Agreement\nThe following table sets forth the outstanding balance, borrowing capacity and applicable interest rate under Credit Agreement.\n \nDecember 31, 2023\nBalance\nAvailable\nBorrowing\nCapacity\nInterest\nRate\n \n(Dollars in thousands)\nRevolving Loans \n(1)\n$\n40,000 \n$\n27,844 \n6.8 \n%\n (1) \n Revolving Loan available borrowing capacity, net of $2.2 million of outstanding standby letters of credit as of December 31, 2023. \nFinance Leases\nAs of December 31, 2023, we had $22.2 million of finance lease obligations outstanding, with a weighted average interest rate of 5.5% and maturities between 2024 and 2029.\nCommitments and Contingencies \nOperating Leases.\n We lease machinery, equipment, and office and operational facilities under non-cancelable operating lease agreements. Certain lease agreements for our facilities generally contain renewal options and provide for annual increases in rent based on the local Consumer Price Index. Refer to Note 7, \nLeasing,\n for the schedule of our future minimum operating lease payments as of December 31, 2023.\nLegal Proceedings\n. We are involved, and will continue to be involved, in legal proceedings arising out of the conduct of our business, including commercial and employment-related lawsuits. Some of these lawsuits purport or may be determined to be class actions and seek substantial damages, and some may remain unresolved for several years. We establish accruals for specific legal proceedings when it is considered probable that a loss has been incurred and the amount of the loss can be reasonably estimated. We evaluate whether a loss is reasonably probable based on our assessment and consultation with legal counsel regarding the ultimate outcome of the matter. As of December 31, 2023, we have accrued for the potential impact of loss contingencies that are probable and reasonably estimable. We do not currently believe that the ultimate resolution of any of these matters will have a material adverse effect on our results of operations, financial condition, or cash flows. However, the results of these matters cannot be predicted with certainty, and an unfavorable resolution of one or more of these matters could have a material adverse effect on our results of operations, financial condition, or cash flows.\nSite Remediation Obligation.\n As part of a business acquisition in the 1990’s, we purchased a site located in California where a former commercial gas station had operated from 1939 until approximately 1986. Prior to our acquisition, the gas station was demolished and its underground storage tanks were removed. \nEnvironmental monitoring of the property was conducted from 1987 through 2017 under the oversight of the local County's Department of Environmental Health (CDEH) and it eventually revealed petroleum products in the soil, groundwater, and the air in between soil particles. As a result, a Corrective Action Implementation Plan (CAIP) detailing remedial clean-up methods at the site was required to be submitted in 2020. Accordingly, we recorded a liability on an undiscounted basis of $0.6 million in 2020, the estimated cost, to remediate the site. \nThe 2020 CAIP was approved by the CDEH, but based on additional site data, the department requested a submission of addenda to the CAIP to address other site conditions. The additional review conducted in the fourth quarter of 2023 identified certain potential risks arising out of a structure on a neighboring property. As a result, in December of 2023, the CDEH requested that an alternative remedial plan be developed and submitted by March 12, 2024, to address the structural aspects of the site. We are in the process of finalizing an alternative plan with the guidance and expertise of an environmental consulting firm engaged expressly for this purpose. The additional concerns identified in 2023 require that the new plan be designed in a \n31\nway that is significantly more expensive than the original plan, is more complicated, and will result in a longer duration to remediate the site.  \nThe Consolidated Balance Sheets include a liability on an undiscounted basis for the site remediation of $4.5 million as of December 31, 2023, of which $2.2 million is classified as a current liability, and $0.6 million as of December 31, 2022.  As of December 31, 2023, the liability represents our estimate of the probable cleanup, investigation, and remediation costs based on available information. We anticipate that most of this liability will be paid out over seven years, but some costs maybe be paid out over a longer period.  \nThe estimate of our final remediation expenses may change over time because of the varying costs of currently available cleanup techniques, unpredictable contaminant reduction rates associated with available cleanup techniques, and the difficulty of determining in advance the nature and full extent of contamination. However, evolving statutory and regulatory standards, their interpretation, more vigorous enforcement policies of regulatory agencies, or stricter or different interpretations of existing statutory and regulatory standards, may require additional expenditures, which may be material. Accordingly, there can be no assurance that we will not incur significant additional environmental compliance costs in the future.\nCritical Accounting Policies and Significant Judgments and Estimates\nOur management prepares financial statements in conformity with GAAP. When we prepare these consolidated financial statements, we are required to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. On an on-going basis, we evaluate our estimates and judgments, including those related to accounts receivable, inventories, deferred tax assets, goodwill and intangible assets, long-lived assets and leases. We base our estimates and judgments on historical experience and on various other factors that we believe to be reasonable under the circumstances, the results of which form the basis for our judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. To the extent that there are material differences between these estimates and actual results, our future financial statement presentation, financial condition, results of operations and cash flows will be affected. We believe that the accounting policies discussed below are critical to understanding our historical and future performance, as these policies relate to the more significant areas involving management's judgments and estimates.\nGoodwill Impairment\nIn accordance with ASC 350, \nIntangibles - Goodwill and Other\n, we assess goodwill for impairment annually as of September 30, and more frequently if events and circumstances indicate that goodwill might be impaired. At September 30, 2023, the Company performed its annual assessment and determined that goodwill was not impaired.\nGoodwill impairment testing is performed at the reporting unit level. Goodwill is assigned to reporting units at the date the goodwill is initially recorded. Once goodwill has been assigned to reporting units, it no longer retains its association with a particular acquisition, and all of the activities within a reporting unit, whether acquired or internally generated, are available to support the value of the goodwill. In 2017, we elected to early-adopt ASU 2017-04 which simplifies subsequent goodwill measurement by eliminating step two from the goodwill impairment test. \nWe determine the fair value of our reporting units using an income approach. Under the income approach, we determined fair value based on estimated discounted future cash flows of each reporting unit. Determining the fair value of a reporting unit is judgmental in nature and requires the use of significant estimates and assumptions, including revenue growth rates and EBITDA margins, discount rates and future market conditions, among others. The level of judgement and estimation is inherently higher in these uncertain economic times.\nThe results of the latest annual goodwill impairment test, as of September 30, 2023, were as follows:\n(Dollars in thousands)\nNumber of\nReporting\nUnits\nRepresenting\nGoodwill of\nNo goodwill balance\n6 \n$\n— \nFair value of reporting units exceeds their carrying values by more than 15%\n1 \n121,051 \n7 \n$\n121,051 \nBased upon a sensitivity analysis, a reduction of approximately 50 basis points of projected EBITDA in 2023 and beyond, assuming all other assumptions remain constant, would result in no further impairment of goodwill.\nBased upon a separate sensitivity analysis, a 50 basis point increase to the weighted average cost of capital would result in \n32\nno further impairment of goodwill.\nGiven the uncertain economic times and the changing document and printing needs of our customers and the uncertainties regarding the effect on our business, there can be no assurance that the estimates and assumptions made for purposes of our goodwill impairment testing in 2023 will prove to be accurate predictions of the future. If our assumptions, including forecasted EBITDA of certain reporting units, are not achieved, then we may be required to record goodwill impairment charges in future periods, whether in connection with our next annual impairment testing in the third quarter of 2024, or on an interim basis, if any such change constitutes a triggering event (as defined under ASC 350, \nIntangibles - Goodwill and Other\n) outside of the quarter when we regularly perform our annual goodwill impairment test. It is not possible at this time to determine if any such future impairment charge would result or, if it does, whether such charge would be material.\nRevenue Recognition\nRevenue is recognized when control of the promised goods or services is transferred to our customers, in an amount that reflects the consideration that we are expected to be entitled to in exchange for those goods or services. We applied practical expedients related to unsatisfied performance obligations for (i) contracts with an original expected length of one year or less and (ii) contracts for which the Company recognizes revenue at the amount to which it has the right to invoice for services performed.\nDigital Printing consists of professional services and software services to (i) reproduce and distribute large-format and small-format documents in either black and white or color, or Ordered Prints and (ii) specialized graphic color printing. Substantially, all the Company’s revenue from Digital Printing comes from professional services to reproduce Ordered Prints. Sales of Ordered Prints are initiated through a customer order or quote and are governed by established terms and conditions agreed upon at the onset of the customer relationship. Revenue is recognized when the performance obligation under the terms of a contract with a customer are satisfied; generally, this occurs with the transfer of control of the re-produced Ordered Prints. Transfer of control occurs at a specific point-in-time, when the Ordered Prints are delivered to the customer’s site or handed to the customer for walk in orders. Revenue is measured as the amount of consideration we expect to receive in exchange for transferring goods or providing services. Taxes collected concurrent with revenue-producing activities are excluded from revenue. \nMPS consists of placement, management, and optimization of print and imaging equipment in the customers' offices, job sites, and other facilities. MPS relieves the Company’s customers of the burden of purchasing print equipment and related supplies and maintaining print devices and print networks, and shifts their costs to a “per-use” basis. MPS is supported by our hosted proprietary technology, Abacus\n®\n, which allows our customers to capture, control, manage, print, and account for their documents. Under its MPS contracts, the Company is paid a fixed rate per unit for each print produced (per-use), often referred to as a “click charge”. MPS sales are driven by the ongoing print needs of the Company’s customers at their facilities. Upon the issuance of ASC 842, \nLeases, \nthe Company concluded that certain of its MPS arrangements, which had previously been accounted for as service revenue under ASC 606, \nRevenue from Contracts with Customers, \nare accounted for as operating leases under ASC 842. The pattern of revenue recognition for the Company's MPS revenue has remained substantially unchanged following the adoption of ASC 842. See Note 7, \nLeasing, \nfor additional information. \nScanning and Digital Imaging combines software and professional services to facilitate the capture, management, access and retrieval of documents and information that have been produced in the past. Scanning and Digital Imaging may include our hosted SKYSITE software and facilities solution to organize, search and retrieve documents, as well as the provision of services that include the capture and conversion of hardcopy and electronic documents into digital files, or Scanned Documents, and their cloud-based storage and maintenance. Sales of Scanning and Digital Imaging professional services, which represent substantially all revenue for this business line, are initiated through a customer order or proposal and are governed by established terms and conditions agreed upon at the onset of the customer relationship. Revenue is recognized when the performance obligation under the terms of a contract with a customer are satisfied; generally, this occurs with the transfer of control of the digital files. Transfer of control occurs at a specific point-in-time, when the Scanned Documents are delivered to the customer either through SKYSITE, our facilities solution or through other electronic media. Revenue is measured as the amount of consideration we expect to receive in exchange for transferring goods or providing services. Taxes collected concurrent with revenue-producing activities are excluded from revenue. \nEquipment and Supplies sales consist of reselling printing, imaging, and related equipment, or Goods, to customers primarily in architectural, engineering and construction firms. Sales of Equipment and Supplies are initiated through a customer order and are governed by established terms and conditions agreed upon at the onset of the customer relationship. Revenue is recognized when the performance obligations under the terms of a contract with a customer are satisfied; generally, this occurs with the transfer of control of the Goods. Transfer of control occurs at a specific point-in-time, when the Goods are delivered to the customer’s site. Revenue is measured as the amount of consideration we expect to receive in exchange for transferring \n33\ngoods or providing services. Taxes collected concurrent with revenue-producing activities are excluded from revenue. We have experienced minimal customer returns or refunds and does not offer a warranty on equipment that it is reselling.\nLeases\nWe recognize lease assets and corresponding lease liabilities for all operating and finance leases on our Consolidated Balance Sheets, excluding short-term leases (leases with terms of 12 months or less) as described under ASU No. 2016-02, \nLeases (Topic 842\n). Some of our long-term operating lease agreements include options to extend, which are also factored into the recognition of their respective assets and liabilities when appropriate based on management’s assessment of the probability that the options will be exercised. Lease payments are discounted using the rate implicit in the lease, or, if not readily determinable, a third-party secured incremental borrowing rate based on information available at lease commencement. Additionally, certain of our lease agreements include escalating rents over the lease terms which, under Topic 842, results in rent being expensed on a straight-line basis over the life of the lease that commences on the date we have the right to control the property.  Finance leases were not impacted by the adoption of ASC 842, as finance lease liabilities and the corresponding ROU assets were already recorded in the balance sheet under the previous guidance, ASC 840. For additional information about the impact of the adoption of ASC 842, see Note 7, \nLeasing\n.\nSite Remediation Obligation\nWe are currently involved in a site remediation obligation due to a former gas station that had been situated on a property we obtained as part of a business acquisition in the late 1990s. We have accrued estimates of the probable and reasonably estimable costs for the resolution of the obligation based upon types of remediation efforts currently anticipated, the volume of contaminants in the impacted areas, regulatory oversight and other costs. \nOur current estimates of future environmental cleanup and remediation liabilities related to the site may change over time due to various factors, including but not limited to, the nature and extent of required future cleanup and removal activities, and the extent and duration of regulatory oversight, among other things. The final outcome of any regulatory inquiries and requirements cannot be predicted with certainty, and unfavorable or unexpected outcomes could result in additional costs that could be material to our results of operations during any particular year of the remediation process. See Note 6, \nCommitments and Contingencies - Site Remediation Obligation\n within Part IV, Item 15 - \"Exhibits and Financial Statement Schedule” of this Annual Report on Form 10-K\n,\n for further discussion on environmental matters.\nIncome Taxes\nDeferred tax assets and liabilities reflect temporary differences between the amount of assets and liabilities for financial and tax reporting purposes. Such amounts are adjusted, as appropriate, to reflect changes in tax rates expected to be in effect when the temporary differences reverse. A valuation allowance is recorded to reduce our deferred tax assets to the amount that is more likely than not to be realized. Changes in tax laws or accounting standards and methods may affect recorded deferred taxes in future periods.\nWhen establishing a valuation allowance, we consider future sources of taxable income such as future reversals of existing taxable temporary differences, future taxable income exclusive of reversing temporary differences and carryforwards and tax planning strategies. A tax planning strategy is an action that: is prudent and feasible; an enterprise ordinarily might not take but would take to prevent an operating loss or tax credit carryforward from expiring unused; and would result in realization of deferred tax assets. In the event we determine that its deferred tax assets, more likely than not, will not be realized in the future, the valuation adjustment to the deferred tax assets will be charged to earnings in the period in which we make such a determination. We have a $1.3 million valuation allowance against certain deferred tax assets as of December 31, 2023.\nIn future quarters we will continue to evaluate our historical results for the preceding twelve quarters and our future projections to determine whether we will generate sufficient taxable income to utilize our deferred tax assets, and whether a valuation allowance is required.\nWe calculate our current and deferred tax provision based on estimates and assumptions that could differ from the actual results reflected in income tax returns filed in subsequent years. Adjustments based on filed returns are recorded when identified.\nIncome taxes have not been provided on certain undistributed earnings of foreign subsidiaries because such earnings are considered to be permanently reinvested.\nThe amount of taxable income or loss we report to the various tax jurisdictions is subject to ongoing audits by federal, state and foreign tax authorities. We estimate of the potential outcome of any uncertain tax issue is subject to management’s assessment of relevant risks, facts, and circumstances existing at that time. We use a more-likely-than-not threshold for \n34\nfinancial statement recognition and measurement of tax positions taken or expected to be taken in a tax return. We record a liability for the difference between the benefit recognized and measured and tax position taken or expected to be taken on its tax return. To the extent that our assessment of such tax positions changes, the change in estimate is recorded in the period in which the determination is made. We report tax-related interest and penalties as a component of income tax expense.\nRecent Accounting Pronouncements\nSee Note 2, \nSummary of Significant Accounting Policies\n to our Consolidated Financial Statements for disclosure on recently adopted accounting pronouncements and those not yet adopted.",
    "item7a": ">Item 7A.\n \nQuantitative and Qualitative Disclosures About Market Risk\nWe are a smaller reporting company, as defined by Rule 12b-2 of the Securities Exchange Act of 1934, as amended, or the Exchange Act, and are not required to provide the information required under this item.",
    "item8": ">Item 8.\n \nFinancial Statements and Supplementary Data\nOur financial statements and the accompanying notes that are filed as part of this Annual Report on Form 10-K are listed under Part IV, Item 15 - \"Exhibits and Financial Statement Schedule” and are set forth beginning on page F-1 immediately following the signature pages of this Annual Report on Form 10-K.\nItem 9.\n \nChanges in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.\n35",
    "item9a": ">Item 9A.\n \nControls and Procedures\nDisclosure Controls and Procedures\nWe maintain disclosure controls and procedures that are designed to ensure that information required to be disclosed in our reports under the Securities Exchange Act of 1934, or the Exchange Act are recorded, processed, summarized, and reported within the time periods specified in the Securities and Exchange Commission’s rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer (our principal executive officer) and our Chief Financial Officer (our principal financial officer), as appropriate, to allow timely decisions regarding required disclosures.\nUnder the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer we conducted an evaluation of the effectiveness of our disclosure controls and procedures (as defined in Rule 13a-15(e) and 15d-15(e) under the Exchange Act as of December 31, 2023. Based on that evaluation, our Chief Executive Officer and our Chief Financial Officer concluded that as of December 31, 2023, our disclosure controls and procedures were effective.\nManagement’s Report on Internal Control Over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) or 15(d)-15(f) of the Exchange Act). Under the supervision and with the participation of our management, including our Chief Executive Officer and our Chief Financial Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based upon the framework in \nInternal Control — Integrated Framework\n (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on that evaluation, our management concluded that our internal control over financial reporting was effective as of December 31, 2023.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nReport of Independent Registered Public Accounting Firm\nCrowe LLP, the independent registered public accounting firm that audited the fiscal year 2023 consolidated financial statements included in this Annual Report on Form 10-K, has issued an attestation report on the effectiveness of our internal control over financial reporting as of December 31, 2023, which is included herein.\nChanges in Internal Control Over Financial Reporting\nThere were no changes to internal control over financial reporting during the quarter ended December 31, 2023, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.",
    "item9b": ">Item 9B.\n \nOther Information\nAdoption or Termination of Trading Arrangements\nNone of our directors or officers (as defined in Rule 16a-1(f)) adopted or terminated a Rule 10b5-1 trading arrangement or a non-Rule 10b5-1 trading arrangement (as defined in Item 408(c) of Regulation S-K) during the three months ended December 31, 2023.",
    "item9": ">Item 9C. \nDisclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\n36\nPART III",
    "item10": ">Item 10.\n \nDirectors, Executive Officers and Corporate Governance\nCertain information regarding our executive officers is included below. All other information regarding directors, executive officers and corporate governance required by this item is incorporated herein by reference to the applicable information in the proxy statement for our 2024 Annual Meeting of Stockholders, or 2024 Annual Meeting, which will be filed with the SEC within 120 days after our fiscal year end of December 31, 2023, and is set forth under “Nominees for Director,” “Corporate Governance Profile,” “Delinquent Section 16(a) Reports” and in other applicable sections in the proxy statement.\nInformation about our Executive Officers\nThe following sets forth certain information regarding all of our executive officers as of February 28, 2024:\n \nName\nAge\nPosition\nKumarakulasingam Suriyakumar\n70\nChairman and Chief Executive Officer Director\nJorge Avalos\n48\nChief Financial Officer\nRahul K. Roy\n64\nChief Technology Officer\nDilantha Wijesuriya\n62\nPresident and Chief Operating Officer\nKumarakulasingam (“Suri”) Suriyakumar \nco-founded the Company in 1989 and has served as ARC Document Solution’s Chief Executive Officer since June 1, 2007. He served as the Company’s Chief Operating Officer from 1991 until his appointment as Chief Executive. He also served as President from 1991 until June of 2022. On July 24, 2008, Mr. Suriyakumar was appointed Chairman of ARC’s Board of Directors. Prior to joining the Company, Mr. Suriyakumar was employed with Aitken Spence & Co. LTD, a highly diversified conglomerate and one of the five largest corporations in Sri Lanka.\nJorge Avalos \nwas appointed Chief Financial Officer of ARC Document Solutions in January of 2015. From 2011 to his appointment as CFO, Mr. Avalos was Chief Accounting Officer and Vice President Finance of ARC. Mr. Avalos joined the Company in June 2006 as the Company’s Director of Finance and became the Company’s Corporate Controller in December 2006, and Vice President, Corporate Controller in December of 2010. Prior to joining the company, Mr. Avalos was employed with Vendare Media Group, an online network and social media company, as its controller. From September 1998 through March 2005, Mr. Avalos was employed in a variety of audit and management roles with PricewaterhouseCoopers LLP.\nRahul K. Roy \njoined ARC Document Solutions as its Chief Technology Officer in September 2000. Prior to joining the Company, Mr. Roy was the founder, President and Chief Executive Officer of MirrorPlus Technologies, Inc., which developed software for the reprographics industry, from August 1993 until it was acquired by the Company in 1999. Mr. Roy also served as the Chief Operating Officer of InPrint, a provider of printing, software, duplication, packaging, assembly, and distribution services to technology companies, from 1993 until it was acquired by the Company in 1999.\nDilantha “Dilo” Wijesuriya\n joined Ford Graphics, a former division of ARC Document Solutions, in January 1991. He subsequently became president of that division in 2001, and became a Company regional operations head in 2004, a position he retained until his appointment as the Company’s Senior Vice President, National Operations in August 2008. Mr. Wijesuriya was appointed Chief Operating Officer in 2011 and made President in June of 2022. Prior to his employment with the Company, Mr. Wijesuriya was a divisional manager with Aitken Spence & Co. LTD, a highly diversified conglomerate and one of the five largest corporations in Sri Lanka.",
    "item11": ">Item 11.\n \nExecutive Compensation\nThe information required by this item is incorporated herein by reference to the applicable information in the proxy statement for our 2024 Annual Meeting and is set forth under “Executive Compensation.”\nThe information in the section of the proxy statement for our 2024 Annual Meeting captioned “Compensation Committee Report” is incorporated by reference herein but shall be deemed furnished, not filed and shall not be deemed to be incorporated by reference into any filing we make under the Securities Act of 1933 or the Exchange Act.\n37",
    "item12": ">Item 12.\n \nSecurity Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this item is incorporated herein by reference to the applicable information in the proxy statement for our 2024 Annual Meeting and is set forth under “Beneficial Ownership of Voting Securities” and “Equity Compensation Plan Information.”",
    "item13": ">Item 13.\n \nCertain Relationships and Related Transactions, and Director Independence\nThe information required by this item is incorporated herein by reference to the applicable information in the proxy statement for our 2024 Annual Meeting and is set forth under “Certain Relationships and Related Transactions” and “Corporate Governance Profile.”",
    "item14": ">Item 14.\n \nPrincipal Accountant Fees and Services\nThe information required by this item is incorporated herein by reference to the proxy statement for our 2024 Annual Meeting and is set forth under “Auditor Fees.”\n38\nPART IV\nItem 15\n. Exhibits and Financial Statement Schedules.\n(a) The following documents are filed as part of this Annual Report on Form 10-K:\n(1) \nFinancial Statements\nReport of Independent Registered Public Accounting Firm - Armanino LLP (PCAOB ID: 32)\nReport of Independent Registered Public Accounting Firm - Crowe LLP (PCAOB ID: \n173\n)\nConsolidated Balance Sheets as of December 31, 2023 and 2022\nConsolidated Statements of Operations for the years ended December 31, 2023 and 2022\nConsolidated Statements of Comprehensive Income for the years ended December 31, 2023 and 2022\nConsolidated Statements of Equity for the years ended December 31, 2023 and 2022\nConsolidated Statements of Cash Flows for the years ended December 31, 2023 and 2022\nNotes to Consolidated Financial Statements\n(2) \nFinancial Statement Schedules\nAll other schedules have been omitted as the required information is not present or is not present in amounts sufficient to require submission of the schedule, or because the information required is included in the Consolidated Financial Statements and notes thereto.\n(3) \nExhibits\nSee Item 15(b) below.\n(b) Exhibits\nThe following exhibits are filed herewith as part of this Annual Report on Form 10-K or are incorporated by reference to exhibits previously filed with the SEC:\n39\nIndex to Exhibits\nNumber\n  \nDescription\n3.1 \n  \nCertificate of Ownership and Merger as filed with Secretary of State of the State of Delaware (incorporated by reference to Exhibit 3.1 to the Registrant’s Form 8-K filed December 27, 2012).\n3.2 \n  \nRestated Certificate of Incorporation, filed March 13, 2013\n.\n3.3 \n  \nThird Amended and Restated Bylaws of ARC Document Solutions, Inc. (incorporated by reference to Exhibit 3.1 to the Registrant’s Form 8-K filed on December 11, 2023).\n4.2 \n  \nDescription of Registered Securities.*\n10.1 \n  \nARC Document Solutions 2005 Stock Plan (incorporated by reference to Exhibit 10.7 to the Registrant’s Registration Statement on Form S-1 A (Reg. No. 333-119788), as amended on January 13, 2005).^\n10.2 \n  \nAmendment No. 1 to ARC Document Solutions 2005 Stock Plan dated May 22, 2007 (incorporated by reference to Exhibit 10.63 to the Registrant’s Form 10-Q filed on August 9, 2007).^\n10.3 \n  \nAmendment No. 2 to ARC Document Solutions 2005 Stock Plan dated May 2, 2008 (incorporated by reference to Exhibit 10.3 to the Registrant’s Form 10-Q filed August 8, 2008). ^\n10.4 \n  \nAmendment No. 3 to ARC Document Solutions 2005 Stock Plan (incorporated by reference to Exhibit 10.1 to the Registrant’s Form 10-Q filed August 7, 2009). ^\n10.5 \n  \nForms of Stock Option Agreements under the 2005 Stock Plan (incorporated by reference to Exhibit 10.8 to the Registrant’s Registration Statement on Form S-1 (Reg. No. 333-119788), as filed on October 15, 2004).^\n10.6 \n  \nForms of Restricted Stock Award Agreements under 2005 Stock Plan (incorporated by reference to Exhibit 10.27 to the Registrant’s Registration Statement on Form S-1 A (Reg. No. 333-119788), as amended on December 6, 2004).^\n10.7 \n  \nForm of Restricted Stock Unit Award Agreement under 2005 Stock Plan (incorporated by reference to Exhibit 10.28 to the Registrant’s Registration Statement on Form S-1 A (Reg. No. 333-119788), as amended on December 6, 2004).^\n10.8 \n  \nForm of Stock Appreciation Right Agreement under 2005 Stock Plan (incorporated by reference to Exhibit 10.29 to the Registrant’s Registration Statement on Form S-1 A (Reg. No. 333-119788), as amended on January 13, 2005).^\n10.9 \n  \nForm of ARC Document Solutions Stock Option Grant Notice - Non-employee Directors (Discretionary Non-statutory Stock Options) (incorporated by reference to Exhibit 10.1 to the Registrant’s Form 8-K filed on December 16, 2005).^\n10.10 \n  \nForm of ARC Document Solutions Non-employee Directors Nonstatutory Stock Option Agreement (Discretionary Grants) (incorporated by reference to Exhibit 10.2 to the Registrant’s Form 8-K filed on December 16, 2005).^\n10.11 \n  \nAmended and Restated ARC Document Solutions 2005 Employee Stock Purchase Plan amended and restated as of July 30, 2009 (incorporated by reference to Exhibit 10.1 to the Registrant’s Form 10-Q filed on November 9, 2009).^\n40\n10.12 \n  \nLease Agreement, for the premises commonly known as 934 and 940 Venice Boulevard, Los Angeles, CA, dated November 19, 1997, by and between American Reprographics Company, L.L.C. (formerly Ford Graphics Group, L.L.C.) and Sumo Holdings LA, LLC (incorporated by reference to Exhibit 10.10 to the Registrant’s Registration Statement on Form S-1 (Reg. No. 333-119788), as filed on October 15, 2004).\n10.13 \n  \nAmendment to Lease for the premises commonly known as 934 and 940 Venice Boulevard, Los Angeles, CA, effective as of August 2, 2005, by and between Sumo Holdings LA, LLC, Landlord and American Reprographics Company, L.L.C. (formerly known as Ford Graphics Group, L.L.C.) Tenant (incorporated by reference to Exhibit 10.2 to the Registrant’s Form 10-Q filed on November 14, 2005 \n10.14 \n  \nLease Agreement for the premises commonly known as 345 Clinton Street, Costa Mesa, CA, dated September 23, 2003, by and between American Reprographics Company (dba Consolidated Reprographics) and Sumo Holdings Costa Mesa, LLC (incorporated by reference to Exhibit 10.16 to the Registrant’s Registration Statement on Form S-1 (Reg. No. 333-119788), as filed on October 15, 2004).\n10.15 \n  \nLease Agreement for the premises commonly known as 616 Monterey Pass Road, Monterey Park, CA, by and dated November 19, 1997, between Dieterich-Post Company and American Reprographics Company, L.L.C. (as successor lessee) (incorporated by reference to Exhibit 10.26 to the Registrant’s Form 10-K filed on March 1, 2007).\n10.16 \n  \nIndemnification Agreement, dated April 10, 2000, among American Reprographics Company, L.L.C., American Reprographics Holdings, L.L.C., ARC Acquisition Co., L.L.C., Mr. Chandramohan, Mr. Suriyakumar, Micro Device, Inc., Dieterich-Post Company, ZS Ford L.P., and ZS Ford L.L.C. (incorporated by reference to Exhibit 10.19 to the Registrant’s Registration Statement on Form S-1 (Reg. No. 333-119788), as filed on October 15, 2004).\n10.17 \n  \nForm of Indemnification Agreement between ARC Document Solutions, Inc. and each of its Directors and Executive Officers (incorporated by reference to Exhibit 10.42 to the Registrant's Form 10-K filed on March 13, 2013).\n10.18 \nLetter Amendment, dated March 13, 2014, by and between ARC Document Solutions, Inc. and Mr. Suriyakumar (incorporated by reference to Exhibit 10.47 to the Registrant's Form 10-K filed on March 14, 2014).^\n10.19 \nAmended and Restated Employment Agreement, dated March 13, 2014, between ARC Document Solutions, Inc. and Mr. Kumarakulasingam (incorporated by reference to Exhibit 10.48 to the Registrant's Form 10-K filed on March 14, 2014).^\n10.20 \nExecutive Employment Agreement, dated May 1, 2014, by and between ARC Document Solutions, Inc. and Rahul K. Roy (incorporated by reference to Exhibit 10.2 to the Registrant's Form 10-Q filed on May 7, 2014).^\n10.21 \nExecutive Employment Agreement, dated May 1, 2014, by and between ARC Document Solutions, Inc. and Dilantha Wijesuriya (incorporated by reference to Exhibit 10.3 to the Registrant's Form 10-Q filed on May 7, 2014).^\n10.22 \nExecutive Employment Agreement, dated May 1, 2014, by and between ARC Document Solutions, Inc. and Jorge Avalos (incorporated by reference to Exhibit 10.4 to the Registrant's Form 10-Q filed on May 7, 2014).^\n10.23 \nARC Document Solutions, Inc. 2014 Stock Incentive Plan (incorporated by reference to Exhibit 10.1 to the Registrant's Form 8-K filed on May 7, 2014).\n41\n10.24 \nAmendment No. 1 to ARC Document Solutions, Inc. 2014 Stock Incentive Plan (incorporated by reference to Exhibit 10.2 to the Registrant's Form 8-K filed on May 7, 2014).\n10.25 \nAmended and Restated Executive Employment Agreement dated May 17, 2014 by and between ARC Document Solutions, Inc. and Mr. Suriyakumar (incorporated by reference to Exhibit 10.1 to the Registrant's Form 8-K filed on May 19, 2014).^\n10.27 \nAmended and Restated Executive Employment Agreement, dated February 1, 2015, by and between ARC Document Solutions, Inc. and Jorge Avalos (incorporated by reference to Exhibit 10.2 to the Registrant's Form 8-K filed on January 30, 2015). ^\n10.29 \nAmended and Restated Executive Employment Agreement, dated June 9, 2015, between ARC Document Solutions, Inc. and Jorge Avalos (incorporated by reference to Exhibit 10.1 to the Registrant's Form 8-K filed on June 16, 2015). ^\n10.30 \nAmended and Restated Executive Employment Agreement, dated June 9, 2015, between ARC Document Solutions, Inc. and Rahul K. Roy (incorporated by reference to Exhibit 10.2 to the Registrant's Form 8-K filed on June 16, 2015). ^\n10.31 \nAmended and Restated Executive Employment Agreement, dated June 9, 2015, between ARC Document Solutions, Inc. and Dilantha Wijesuriya (incorporated by reference to Exhibit 10.3 to the Registrant's Form 8-K filed on June 16, 2015). ^\n10.33 \nAmendment dated May 9, 2016 to Amended and Restated Executive Employment Agreement, dated June 9, 2015, between ARC Document Solutions, Inc. and Rahul K. Roy (incorporated by reference to Exhibit 10.1 to the Registrant's Form 8-K filed on May 3, 2016).^\n10.36 \nAmended and Restated Executive Employment Agreement, dated February 22, 2018 between ARC Document Solutions, Inc. and Kumarakulasingam Suriyakumar (incorporated by reference to Exhibit 10.1 to the Registrant's Form 8-K files on February 23, 2018). ^\n10.37 \nAmendment to the ARC Document Solutions, Inc. 2014 Stock Incentive Plan, dated May 1, 2018 (incorporated by reference to Exhibit 10.1 to the Registrant's Form 8-K filed on May 1, 2018).\n10.38 \nAmendment No 1 to the Amended and Restated Executive Employment Agreement, dated February 13, 2019, between ARC Document Solutions, Inc. and Jorge Avalos (incorporated by reference to Exhibit 10.40 to the Registrant’s Form 10-K filed on March 6, 2019).^\n10.39 \nAmendment No 1 to the Amended and Restated Executive Employment Agreement, dated February 13, 2019, between ARC Document Solutions, Inc. and Dilantha Wijesuriya (incorporated by reference to Exhibit 10.41 to the Registrant’s Form 10-K filed on March 6, 2019).^\n10.41 \nAmendment No. 3 to the Amended and Restated Executive Employment Agreement, dated February 13, 2020, between ARC Document Solutions, Inc. and Jorge Avalos.^\n10.42 \nForms of Stock Option Agreement under the 2014 Stock Incentive Plan, as amended.^\n10.43 \nForms of Restricted Stock Award Agreement under the 2014 Stock Incentive Plan, as amended.^\n42\n10.44 \nAmended and Restated ARC Document Solutions 2005 Employee Stock Purchase Plan, amended and restated as of April 30, 2020 (incorporated by reference to Appendix A to the Registrant’s Proxy Statement filed on April 2, 2020).^\n10.45 \nCredit Agreement, dated April 22, 2021, among ARC Document Solutions, LLC, U.S. Bank National Association, as administrative agent and the lenders party thereto (incorporated by reference to Exhibit 10.1 to the Registrant’s Form 8-K filed on April 26, 2021).\n10.46 \nARC Document Solutions, Inc. 2021 Incentive Plan, as amended (incorporated herein by reference to Appendix A to the Company’s definitive proxy statement on Schedule 14A, filed on March 31, 2023)\n10.47 \nForm of Stock Option Agreement under the 2021 Incentive Plan ^ (incorporated by reference to Exhibit 10.1 to the Registrant’s Form 10-Q filed on May 5, 2021).\n10.48 \nForm of Restricted Stock Award Agreement under the 2021 Incentive Plan ^ (incorporated by reference to Exhibit 10.1 to the Registrant’s Form 10-Q filed on May 5, 2021).\n10.49 \nAmendment No. 4 to the Amended and Restated Executive Employment Agreement, dated June 29, 2022, between ARC Document Solutions, Inc. and Jorge Avalos ^ (incorporated by reference to Exhibit 10.49 to the Registrant’s Form 10-Q filed on August 4, 2022).\n10.50 \nAmendment to Credit Agreement, dated June 15, 2023, among ARC Document Solutions, LLC, U.S. Bank National Association, as administrative agent and the lenders party thereto. \n(incorporated by reference to Exhibit 10.1 to the Registrant's Form 8-K filed on June 21, 2023).\n16.1 \nLetter from Armanino LLP addressed to the United States Securities and Exchange Commission, dated July 27, 2023 (incorporated by reference to Exhibit 16.1 to the Registrant's Form 8-K filed on July 27, 2023).\n21.1 \n  \nList of Subsidiaries.*\n23.1 \nConsent of Armanino LLP, Independent Registered Public Accounting Firm.*\n23.2 \n Consent of Crowe LLP, Independent Registered Public Accounting Firm.*\n31.1 \n  \nCertification of Principal Executive Officer pursuant to Rules 13a-14(a)/15d-14(a) of the Securities Exchange Act of 1934, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.*\n31.2 \n  \nCertification of Principal Financial and Accounting Officer pursuant to Rules 13a-14(a)/15d-14(a) of the Securities Exchange Act of 1934, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.*\n32.1 \n  \nCertification of Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.*\n32.2 \n  \nCertification of Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.*\n97.1\nARC Document Solutions, Inc. Amended and Restated Executive Compensation Recovery Policy*\n101.INS\n  \nXBRL Instance Document *\n43\n101.SCH\n  \nXBRL Taxonomy Extension Schema *\n101.CAL\n  \nXBRL Taxonomy Extension Calculation Linkbase *\n101.DEF\n  \nXBRL Taxonomy Extension Definition Linkbase *\n101.LAB\n  \nXBRL Taxonomy Extension Label Linkbase *\n101.PRE\n  \nXBRL Taxonomy Extension Presentation Linkbase *\n104\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n*\nFiled herewith\n^\nIndicates management contract or compensatory plan or agreement\nItem 16.\n Form 10-K Summary.\nNot applicable.\n44\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \nARC DOCUMENT SOLUTIONS, INC.\nBy:\n \n/s/ KUMARAKULASINGAM SURIYAKUMAR\n \nChairman and Chief Executive Officer\nDate: February 29, 2024 \nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant in the capacities and on the dates indicated.\n \nSignature\n  \nTitle\n  \nDate\n/s/ KUMARAKULASINGAM SURIYAKUMAR\nKumarakulasingam Suriyakumar\n  \nChairman and\nChief Executive Officer and Director (Principal Executive Officer)\n  \nFebruary 29, 2024\n/s/ JORGE AVALOS\nJorge Avalos\n  \nChief Financial Officer (Principal Financial and Accounting Officer)\n  \nFebruary 29, 2024\n/s/ TRACEY LUTTRELL\nTracey Luttrell\nDirector, Corporate Counsel and Corporate Secretary\nFebruary 29, 2024\n/s/ BRADFORD L. BROOKS\nBradford L. Brooks\n  \nDirector\n  \nFebruary 29, 2024\n/s/ CHERYL COOK\nCheryl Cook\n  \nDirector\n  \nFebruary 29, 2024\n/s/ MARK W. MEALY\nMark W. Mealy\n  \nDirector\n  \nFebruary 29, 2024\n45\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\n \nReport of Independent Registered Public Accounting Firm\n  \n  \nArmanino LLP (PCAOB ID: 32)\nF-2\nCrowe LLP  (PCAOB ID: \n173\n)\nF-3\nConsolidated Balance Sheets as of December 31, 2023 and 2022\nF-5\nConsolidated Statements of Operations for the years ended December 31, 2023 and 2022\nF-6\nConsolidated Statements of Comprehensive Income for the years ended December 31, 2023 and 2022\nF-7\nConsolidated Statements of Equity for the years ended December 31, 2023 and 2022\nF-8\nConsolidated Statements of Cash Flows for the years ended December 31, 2023 and 2022\nF-9\nNotes to Consolidated Financial Statements\n  \nF-10\n  \nF-1\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of ARC Document Solutions, Inc.:\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheet of ARC Document Solutions, Inc. and Subsidiaries (collectively the \"Company\" or “ARC”) as of December 31, 2022, the related consolidated statements of operations, comprehensive income, stockholders' equity, and cash flows, for the year ended December 31, 2022, and the related notes (collectively referred to as the \"financial statements\").  \nIn our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2022, and the results of their operations and their cash flows for the year ended December 31, 2022, in conformity with U.S. generally accepted accounting principles. \nBasis for Opinion\nThe Company's management is responsible for these consolidated financial statements. Our responsibility is to express an opinion on the Company's consolidated financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. \nOur audit of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nWe began serving as the Company’s auditors in 2020. In 2023, we became the predecessor auditor.\n/s/ Armanino\nLLP\nSan Francisco, California\nFebruary 23, 2023\nF-2\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nStockholders and the Board of Directors of ARC Document Solutions, Inc.\nSan Ramon, California\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheet of ARC Document Solutions, Inc. (the \"Company\") as of December 31, 2023, the related consolidated statements of operations, comprehensive income, equity, and cash flows for the year ended December 31, 2023, and the related notes (collectively referred to as the \"financial statements\"). We also have audited the Company’s internal control over financial reporting as of December 31, 2023, based on criteria established in Internal Control – Integrated Framework: (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2023, and the results of its operations and its cash flows for the year ended December 31, 2023 in conformity with accounting principles generally accepted in the United States of America.  Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2023, based on criteria established in Internal Control – Integrated Framework: (2013) issued by COSO.\nBasis for Opinions\nThe Company’s management is responsible for these financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying \nManagement's Report on Internal Control Over Financial Reporting appearing under Item 9A\n.  Our responsibility is to express an opinion on the Company’s financial statements and an opinion on the Company’s internal control over financial reporting based on our audits.  We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. \nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects. \nOur audit of the financial statements included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk.  Our audit also included performing such other procedures as we considered necessary in the circumstances.  We believe that our audit provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.  A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nF-3\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements.  Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.  \nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ \nCrowe LLP\nWe have served as the Company's auditor since 2023.\nSan Francisco, California\nFebruary 29, 2024\nF-4\nARC DOCUMENT SOLUTIONS, INC.\nCONSOLIDATED BALANCE SHEETS\n(In thousands, except per share data)\n \nDecember 31,\nDecember 31,\n2023\n2022\nAssets\nCurrent assets:\nCash and cash equivalents\n$\n56,093\n \n$\n52,561\n \nAccounts receivable, net of allowances for credit losses of \n$\n1,857\n and $\n1,947\n35,775\n \n38,748\n \nInventory\n8,818\n \n8,610\n \nPrepaid expenses\n3,988\n \n4,018\n \nOther current assets\n3,978\n \n3,540\n \nTotal current assets\n108,652\n \n107,477\n \nProperty and equipment, net of accumulated depreciation of \n$\n229,122\n and $\n231,913\n40,925\n \n40,214\n \nRight-of-use assets from operating leases\n32,838\n \n28,163\n \nGoodwill\n121,051\n \n121,051\n \nOther intangible assets, net\n162\n \n208\n \nDeferred income taxes, net\n4,383\n \n7,993\n \nOther assets\n2,113\n \n2,209\n \nTotal assets\n$\n310,124\n \n$\n307,315\n \nLiabilities and Equity\nCurrent liabilities:\nAccounts payable\n$\n24,175\n \n$\n22,972\n \nAccrued payroll and payroll-related expenses\n9,401\n \n11,235\n \nAccrued expenses\n18,787\n \n16,882\n \nCurrent operating lease liabilities\n9,924\n \n9,924\n \nCurrent portion of finance leases\n8,870\n \n11,558\n \nTotal current liabilities\n71,157\n \n72,571\n \nLong-term operating lease liabilities\n27,357\n \n23,339\n \nLong-term debt and finance leases\n53,366\n \n54,916\n \nDeferred income taxes\n52\n \n—\n \nOther long-term liabilities\n2,467\n \n199\n \nTotal liabilities\n154,399\n \n151,025\n \nCommitments and contingencies (Note 6)\nStockholders’ equity:\nARC Document Solutions, Inc. stockholders’ equity:\nPreferred stock, $\n0.001\n par value, \n25,000\n shares authorized; \n0\n shares issued and outstanding\n—\n \n—\n \nCommon stock, $\n0.001\n par value, \n150,000\n shares authorized; \n52,526\n and \n51,400\n shares      issued and \n42,783\n and \n43,101\n shares outstanding\n52\n \n51\n \nAdditional paid-in capital\n136,460\n \n132,952\n \nRetained earnings\n44,144\n \n44,416\n \nAccumulated other comprehensive loss\n(\n4,200\n)\n(\n4,187\n)\n176,456\n \n173,232\n \nLess cost of common stock in treasury, \n9,743\n and \n8,299\n shares\n22,390\n \n18,877\n \nTotal ARC Document Solutions, Inc. stockholders’ equity\n154,066\n \n154,355\n \nNoncontrolling interest\n1,659\n \n1,935\n \nTotal equity\n155,725\n \n156,290\n \nTotal liabilities and equity\n$\n310,124\n \n$\n307,315\n \nThe accompanying notes are an integral part of these consolidated financial statements.\nF-5\nARC DOCUMENT SOLUTIONS, INC.\n CONSOLIDATED STATEMENTS OF OPERATIONS\n(In thousands, except per share data)\n \n \nYear Ended  \nDecember 31,\n2023\n2022\nService sales\n$\n265,160\n \n$\n267,891\n \nEquipment and Supplies sales\n16,041\n \n18,119\n \nTotal net sales\n281,201\n \n286,010\n \nCost of sales\n186,800\n \n190,013\n \nGross profit\n94,401\n \n95,997\n \nSelling, general and administrative expenses\n76,333\n \n77,544\n \nAmortization of intangible assets\n41\n \n97\n \nSite remediation expense\n4,000\n \n—\n \nIncome from operations\n14,027\n \n18,356\n \nOther income, net\n(\n67\n)\n(\n62\n)\nInterest expense, net\n1,633\n \n1,796\n \nIncome before income tax provision\n12,461\n \n16,622\n \nIncome tax provision\n4,387\n \n5,832\n \nNet income\n8,074\n \n10,790\n \nLoss attributable to noncontrolling interest\n161\n \n304\n \nNet income attributable to ARC Document Solutions, Inc. stockholders\n$\n8,235\n \n$\n11,094\n \nEarnings per share attributable to ARC Document Solutions, Inc. stockholders:\nBasic\n$\n0.19\n \n$\n0.26\n \nDiluted\n$\n0.19\n \n$\n0.26\n \nWeighted average common shares outstanding:\nBasic\n42,543\n \n42,214\n \nDiluted\n43,484\n \n43,280\n \nThe accompanying notes are an integral part of these consolidated financial statements.\nF-6\nARC DOCUMENT SOLUTIONS, INC.\n CONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(In thousands)\n \n \nYear Ended  \nDecember 31,\n2023\n2022\nNet income\n$\n8,074\n \n$\n10,790\n \nOther comprehensive loss, net of tax\nForeign currency translation adjustments, net of tax\n(\n128\n)\n(\n2,104\n)\nOther comprehensive loss, net of tax\n(\n128\n)\n(\n2,104\n)\nComprehensive income\n7,946\n \n8,686\n \nComprehensive loss attributable to noncontrolling interest\n(\n276\n)\n(\n722\n)\nComprehensive income attributable to ARC Document Solutions, Inc. stockholders\n$\n8,222\n \n$\n9,408\n \nThe accompanying notes are an integral part of these consolidated financial statements.\nF-7\nARC DOCUMENT SOLUTIONS, INC.\n CONSOLIDATED STATEMENTS OF EQUITY\n(In thousands, except per share data)\n \nARC Document Solutions, Inc. Stockholders\n \n \n \nCommon Stock\n \nAccumulated\n \n \nShares\nPar\nValue\nAdditional Paid-in\nCapital\nRetained\nEarnings\nOther Comprehensive\n(Loss) Income\nCommon Stock in\nTreasury\nNoncontrolling\nInterest\nTotal\nBalance at December 31, 2021\n50,584\n \n$\n50\n \n$\n129,881\n \n$\n41,768\n \n$\n(\n2,501\n)\n$\n(\n16,771\n)\n$\n6,565\n \n$\n158,992\n \nStock-based compensation\n152\n \n1,773\n \n1,773\n \nIssuance of common stock under Employee Stock Purchase Plan\n45\n \n98\n \n98\n \nStock options exercised\n619\n \n1\n \n1,200\n \n1,201\n \nTreasury shares\n(\n2,106\n)\n(\n2,106\n)\nCash dividends - common stock ($\n0.20\n per share) \n(\n8,446\n)\n(\n8,446\n)\nDistribution to noncontrolling interest\n(\n3,908\n)\n(\n3,908\n)\nComprehensive income (loss)\n11,094\n \n(\n1,686\n)\n(\n722\n)\n8,686\n \nBalance at December 31, 2022\n51,400\n \n$\n51\n \n$\n132,952\n \n$\n44,416\n \n$\n(\n4,187\n)\n$\n(\n18,877\n)\n$\n1,935\n \n$\n156,290\n \nStock-based compensation\n270\n \n2,232\n \n2,232\n \nIssuance of common stock under Employee Stock Purchase Plan\n51\n \n133\n \n133\n \nStock options exercised\n805\n \n1\n \n1,143\n \n1,144\n \nTreasury shares\n(\n3,513\n)\n(\n3,513\n)\nCash dividends - common stock ($\n0.20\n per share) \n(\n8,507\n)\n(\n8,507\n)\nComprehensive income (loss)\n8,235\n \n(\n13\n)\n(\n276\n)\n7,946\n \nBalance at December 31, 2023\n52,526\n \n$\n52\n \n$\n136,460\n \n$\n44,144\n \n$\n(\n4,200\n)\n$\n(\n22,390\n)\n$\n1,659\n \n$\n155,725\n \nThe accompanying notes are an integral part of these consolidated financial statements.\nF-8\nARC DOCUMENT SOLUTIONS, INC.\n CONSOLIDATED STATEMENTS OF CASH FLOWS\n(In thousands)\n \n \nYear Ended December 31,\n2023\n2022\nCash flows from operating activities\nNet income\n$\n8,074\n \n$\n10,790\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nAllowance for credit losses\n351\n \n320\n \nDepreciation\n17,592\n \n20,328\n \nAmortization of intangible assets\n41\n \n97\n \nAmortization of deferred financing costs\n67\n \n61\n \nStock-based compensation\n2,232\n \n1,773\n \nDeferred income taxes\n5,016\n \n4,927\n \nDeferred tax valuation allowance\n(\n1,326\n)\n264\n \nOther non-cash items, net\n(\n262\n)\n(\n205\n)\nChanges in operating assets and liabilities:\nAccounts receivable\n2,783\n \n(\n195\n)\nInventory\n(\n243\n)\n62\n \nPrepaid expenses and other assets\n9,391\n \n9,746\n \nAccounts payable and accrued expenses\n(\n7,133\n)\n(\n10,741\n)\nNet cash provided by operating activities\n36,583\n \n37,227\n \nCash flows from investing activities\nCapital expenditures\n(\n10,752\n)\n(\n5,881\n)\nOther\n363\n \n307\n \nNet cash used in investing activities\n(\n10,389\n)\n(\n5,574\n)\nCash flows from financing activities\nProceeds from stock option exercises\n1,144\n \n1,201\n \nProceeds from issuance of common stock under Employee Stock Purchase Plan\n133\n \n98\n \nShare repurchases\n(\n3,513\n)\n(\n2,106\n)\nDistribution to noncontrolling interest\n—\n \n(\n3,908\n)\nPayments on long-term debt agreements and finance leases\n(\n11,860\n)\n(\n14,736\n)\nBorrowings under revolving credit facilities\n162,000\n \n154,000\n \nPayments under revolving credit facilities\n(\n162,000\n)\n(\n160,250\n)\nPayment of deferred financing costs\n(\n23\n)\n(\n6\n)\nDividends paid\n(\n8,518\n)\n(\n8,448\n)\nNet cash used in financing activities\n(\n22,637\n)\n(\n34,155\n)\nEffect of foreign currency translation on cash balances\n(\n25\n)\n(\n866\n)\nNet change in cash and cash equivalents\n3,532\n \n(\n3,368\n)\nCash and cash equivalents at beginning of period\n52,561\n \n55,929\n \nCash and cash equivalents at end of period\n$\n56,093\n \n$\n52,561\n \nSupplemental disclosure of cash flow information:\nCash paid for interest\n$\n1,715\n \n$\n1,837\n \nIncome taxes paid, net\n$\n903\n \n$\n167\n \nNoncash financing activities:\nFinance lease obligations incurred\n$\n7,764\n \n$\n9,482\n \nOperating lease obligations incurred\n$\n14,478\n \n$\n8,687\n \nDeclared unpaid dividends\n$\n2,144\n \n$\n2,106\n \nThe accompanying notes are an integral part of these consolidated financial statements.\nF-9\nARC DOCUMENT SOLUTIONS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(In thousands, except per share data or where otherwise noted)\n1. \nDESCRIPTION OF BUSINESS AND BASIS OF PRESENTATION\nARC Document Solutions Inc. is a digital printing company. We provide digital printing and document-related services to customers in a growing variety of industries. ARC offers Digital Printing services, Managed Print Services (\"MPS\"), and Scanning and Digital Imaging services. In addition, ARC also sells Equipment and Supplies. The Company conducts its operations through its wholly-owned operating subsidiary, ARC Document Solutions, LLC, a Texas limited liability company, and its affiliates.\nBasis of Presentation\nThe accompanying Consolidated Financial Statements include the accounts of the Company and its subsidiaries. All intercompany accounts and transactions have been eliminated in consolidation.\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America (“GAAP”) requires management to make estimates and assumptions that affect the amounts reported in the Consolidated Financial Statements and accompanying notes. The Company evaluates its estimates and assumptions on an ongoing basis and relies on historical experience and various other factors that it believes to be reasonable under the circumstances to determine such estimates. Actual results could differ from those estimates and such differences may be material to the Consolidated Financial Statements.\nRisk and Uncertainties\nThe Company generates a significant portion of its revenue from sales of services and products to customers in the architectural, engineering, construction and building owner/operator (\"AEC/O\") industry. As a result, the Company's results largely depend on the strength of that industry. The Company's historical operating results reflect the cyclical and variable nature of the AEC/O industry. ARC believes that the AEC/O industry generally experiences downturns several months after a downturn in the general economy, and that there may be a similar delay in the recovery of the AEC/O industry following a recovery of the general economy. A downturn in the AEC/O industry would diminish demand for all of the Company's products and services, and would therefore negatively affect the Company's revenues and have a material adverse effect on the Company's business, operating results and financial condition.\nAs part of the Company's growth strategy, ARC intends to continue to expand the market and industries it services and increase sales of a variety of service offerings that utilize ARC's existing production methods and infrastructure, but that are relatively new to the Company.  The success of the Company’s efforts will be affected by its ability to acquire new customers for the Company’s new service offerings, as well as to sell the new service offerings to existing customers. The Company’s inability to successfully market and execute these relatively new service offerings could significantly affect its business and reduce its long-term revenue, resulting in an adverse effect on its results of operations and financial condition.\n2. \nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nCash Equivalents\nCash equivalents include demand deposits and short-term investments with a maturity of three months or less when purchased.\n The Company maintains its cash deposits at numerous banks located throughout the United States, Canada, India, United Arab Emirates, the United Kingdom and China, which at times, may exceed federally insured limits. UNIS Document Solutions, Co. Ltd., (\"UDS\"), the Company’s joint venture in China, held $\n2.6\n million and $\n3.2\n million of the Company’s cash and cash equivalents as of December 31, 2023 and 2022, respectively. The Company has not experienced any losses in such accounts and believes it is not exposed to any significant risk on cash and cash equivalents.\nF-10\nConcentrations of Credit Risk and Significant Vendors\nConcentrations of credit risk with respect to trade receivables are limited due to a large, diverse customer base. No individual customer represented more than \n2.5\n% of net sales during 2023 and 2022. \nThe Company has geographic concentration risk as sales in California, as a percent of total sales, were approximately \n30\n% and \n31\n% for 2023 and 2022, respectively.\nThe Company contracts with various suppliers. Although there are a limited number of suppliers that could supply the Company’s inventory, management believes any shortfalls from existing suppliers could be absorbed by its existing suppliers or from other suppliers on comparable terms. However, a change in suppliers could cause a delay in sales and adversely affect results.\nPurchases from the Company’s three largest vendors during 2023 and 2022 comprised approximately \n35\n% of the Company’s total purchases of inventory and supplies.\nAllowance for Credit Losses\nThe Company performs periodic credit evaluations of the financial condition of its customers, monitors collections and payments from customers, and generally does not require collateral. The Company provides for the possible inability to collect accounts receivable by recording an allowance for credit losses. The Company writes off accounts receivable balances when it is considered uncollectible. The Company estimates the allowance for credit losses based on historical experience, aging of accounts receivable, and information regarding the credit worthiness of its customers. Additionally, the Company provides an allowance for returns and discounts based on historical experience.\n \nThe allowance for credit losses activity was as follows:\nBalance at\nBeginning\nof Period\nCharges to\nCost and\nExpenses\nDeductions \n(1)\nBalance at\nEnd of\nPeriod\nYear ended December 31, 2023\nAllowance for credit losses\n$\n1,947\n \n$\n351\n \n$\n(\n441\n)\n$\n1,857\n \nYear ended December 31, 2022\nAllowance for credit losses\n$\n2,104\n \n$\n320\n \n$\n(\n477\n)\n$\n1,947\n \n (1) \nDeductions represent uncollectible accounts written-off net of recoveries.\nInventories\nInventories are valued at the lower of cost (determined on a first-in, first-out basis; or average cost) or net realizable value. Inventories primarily consist of materials for use and resale in digital printing, and equipment for resale. On an ongoing basis, inventories are reviewed and adjusted for estimated obsolescence or unmarketable inventories to reflect the lower of cost or net realizable value. Charges to write-down inventory to realizable value are recorded as an increase in cost of sales.\n \nIncome Taxes\nDeferred tax assets and liabilities reflect temporary differences between the amount of assets and liabilities for financial and tax reporting purposes. Such amounts are adjusted, as appropriate, to reflect changes in tax rates expected to be in effect when the temporary differences reverse. A valuation allowance is recorded to reduce the Company's deferred tax assets to the amount that is more likely than not to be realized. Changes in tax laws or accounting standards and methods may affect recorded deferred taxes in future periods.\nWhen establishing a valuation allowance, the Company considers future sources of taxable income such as future reversals of existing taxable temporary differences, future taxable income exclusive of reversing temporary differences and carryforwards and tax planning strategies. A tax planning strategy is an action that: is prudent and feasible; an enterprise ordinarily might not take but would take to prevent an operating loss or tax credit carryforward from expiring unused; and would result in realization of deferred tax assets. In the event the Company determines that its deferred tax assets, more likely than not, will not be realized in the future, the valuation adjustment to the deferred tax assets will be charged to earnings in the period in which the Company makes such a determination. The Company has a $\n1.3\n million valuation allowance against certain deferred tax assets as of December 31, 2023.\nIn future quarters the Company will continue to evaluate its historical results for the preceding twelve quarters and our future projections to determine whether this will generate sufficient taxable income to utilize the Company's deferred tax assets, and whether a valuation allowance is required.\nF-11\nThe Company calculates current and deferred tax provision based on estimates and assumptions that could differ from the actual results reflected in income tax returns filed in subsequent years. Adjustments based on filed returns are recorded when identified.\nIncome taxes have not been provided on certain undistributed earnings of foreign subsidiaries because such earnings are considered to be permanently reinvested.\nThe amount of taxable income or loss we report to the various tax jurisdictions is subject to ongoing audits by federal, state and foreign tax authorities. The Company estimate of the potential outcome of any uncertain tax issue is subject to management’s assessment of relevant risks, facts, and circumstances existing at that time. The Company uses a more-likely-than-not threshold for financial statement recognition and measurement of tax positions taken or expected to be taken in a tax return. The Company records a liability for the difference between the benefit recognized and measured and tax position taken or expected to be taken on its tax return. To the extent that the Company's assessment of such tax positions changes, the change in estimate is recorded in the period in which the determination is made. The Company will not report tax-related interest and penalties as a component of income tax expense.\nProperty and Equipment, net\nProperty and equipment are stated at cost and are depreciated using the straight-line method over their estimated useful lives, as follows:\n \nBuildings\n  \n10\n-\n20\n years\nLeasehold improvements\n  \n10\n-\n20\n years or lease term, if shorter\nMachinery and equipment\n  \n3\n-\n7\n years\nFurniture and fixtures\n  \n3\n-\n7\n years\nAssets acquired under capital lease arrangements are included in machinery and equipment, are recorded at the present value of the minimum lease payments, and are depreciated using the straight-line method over the life of the asset or term of the lease, whichever is shorter. Expenses for repairs and maintenance are charged to expense as incurred, while renewals and betterments are capitalized. Gains or losses on the sale or disposal of property and equipment are reflected in operating income.\nThe Company accounts for software costs developed for internal use in accordance with ASC 350-40, \nIntangibles – Goodwill and Other - Internal-Use Software,\n which requires companies to capitalize certain qualifying costs incurred during the application development stage of the related software development project. The primary use of this software is for internal use and, accordingly, such capitalized software development costs are depreciated on a straight-line basis over the economic lives of the related products not to exceed \nthree years\n.\n The Company’s machinery and equipment (see Note 4, \nProperty and Equipment, Net\n) includes $\n1.9\n million and $\n1.7\n million of capitalized software development costs as of December 31, 2023 and 2022, net of accumulated amortization of $\n24.2\n million and $\n23.3\n million as of December 31, 2023 and 2022, respectively. Depreciation expense includes the amortization of capitalized software development costs which amounted to $\n0.9\n million and $\n1.0\n million, during the years ended December 31, 2023 and 2022, respectively.\nSoftware development costs for software to be sold, leased, or otherwise marketed are expensed as incurred until the establishment of technological feasibility, at which time those costs are capitalized until the product is available for general release to customers and amortized over the estimated life of the product. Technological feasibility is established upon the completion of a working prototype that has been certified as having no critical bugs and is a release candidate. To date, costs and time incurred between the establishment of technological feasibility and product release have not been material, and all software development costs have been charged to research and development expense in our consolidated statements of comprehensive income (loss).\nImpairment of Long-Lived Assets\nThe Company periodically assesses potential impairments of its long-lived assets in accordance with the provisions of ASC 360, \nAccounting for the Impairment or Disposal of Long-lived Assets\n. An impairment review is performed whenever events or changes in circumstances indicate that the carrying value of the assets may not be recoverable. The Company groups its assets at the lowest level for which identifiable cash flows are largely independent of the cash flows of the other assets and liabilities. The Company has determined that the lowest level for which identifiable cash flows are available is the regional level, which is the operating segment level.\nFactors considered by the Company include, but are not limited to, significant underperformance relative to historical or projected operating results; significant changes in the manner of use of the acquired assets or the strategy for the overall \nF-12\nbusiness; and significant negative industry or economic trends. When the carrying value of a long-lived asset may not be recoverable based upon the existence of one or more of the above indicators of impairment, the Company estimates the future undiscounted cash flows expected to result from the use of the asset and its eventual disposition. If the sum of the expected future undiscounted cash flows and eventual disposition is less than the carrying amount of the asset, the Company recognizes an impairment loss. An impairment loss is reflected as the amount by which the carrying amount of the asset exceeds the fair value of the asset, based on the fair value if available, or discounted cash flows, if fair value is not available.\n The Company had \nno\n long-lived asset impairments in 2023 or 2022.\nGoodwill and Other Intangible Assets\nIn accordance with ASC 350, \nIntangibles - Goodwill and Other\n, the Company assesses goodwill for impairment annually as of September 30, and more frequently if events and circumstances indicate that goodwill might be impaired. \nGoodwill impairment testing is performed at the reporting unit level. Goodwill is assigned to reporting units at the date the goodwill is initially recorded. Once goodwill has been assigned to reporting units, it no longer retains its association with a particular acquisition, and all of the activities within a reporting unit, whether acquired or internally generated, are available to support the value of the goodwill. In 2017, the Company elected to early-adopt ASU 2017-04 which simplifies subsequent goodwill measurement by eliminating step two from the goodwill impairment test. \nThe Company determines the fair value of its reporting units using an income approach. Under the income approach, the Company determined fair value based on estimated discounted future cash flows of each reporting unit. Determining the fair value of a reporting unit is judgmental in nature and requires the use of significant estimates and assumptions, including revenue growth rates and EBITDA margins, discount rates and future market conditions, among others. The level of judgement and estimation is inherently higher in these uncertain economic times.\nOther intangible assets that have finite lives are amortized over their useful lives. Customer relationships are amortized using the accelerated method, based on customer attrition rates, over their estimated useful lives of \n13\n (weighted average) years.\nDeferred Financing Costs\nDirect costs incurred in connection with debt agreements are recorded as incurred and amortized based on the effective interest method for the Company's borrowings under its credit agreement with U.S. Bank National Association, dated April 22, 2021 (the \"2021 Credit Agreement\"), as amended on June 15, 2023.\n At December 31, 2023 and 2022, the Company had $\n0.2\n million in unamortized deferred financing costs. \nFair Values of Financial Instruments\nThe carrying amounts of the Company’s financial instruments, including cash equivalents, short-term investments, accounts receivable, and accounts payable approximate their fair values due to their short maturities. Refer to Note 11,\n Fair Value Measurements\n, in Notes to Consolidated Financial Statements for disclosures regarding fair value measurements in accordance with the authoritative guidance for fair value measurements and disclosures.\nInsurance Liability\nThe Company maintains a high deductible insurance policy for a significant portion of its risks and associated liabilities with respect to workers’ compensation. The Company’s deductible is $\n250\n thousand per individual. The accrued liabilities associated with this program are based on the Company’s estimate of the ultimate costs to settle known claims, as well as claims incurred but not yet reported to the Company, as of the balance sheet date. The Company’s estimated liability is not discounted and is based upon an actuarial report obtained from a third party. The actuarial report uses information provided by the Company’s insurance brokers and insurers, combined with the Company’s judgments regarding a number of assumptions and factors, including the frequency and severity of claims, claims development history, case jurisdiction, applicable legislation, and the Company’s claims settlement practices.\nCommitments and Contingencies\nIn the normal course of business, the Company estimates potential future loss accruals related to legal, workers’ compensation, tax and other contingencies. These accruals require management’s judgment on the outcome of various events based on the best available information. However, due to changes in facts and circumstances, the ultimate outcomes could differ from management’s estimates.\nSite Remediation Obligation - \nThe Company is currently involved in a site remediation obligation due to a former gas station that had been situated on a property the Company obtained as part of a business acquisition in the late 1990s. The \nF-13\nCompany has accrued estimates of the probable and reasonably estimable costs for the resolution of the obligation based upon types of remediation efforts currently anticipated, the volume of contaminants in the impacted areas, regulatory oversight and other costs. \nThe Company's current estimates of future environmental cleanup and remediation liabilities related to the site may change over time due to various factors, including but not limited to, the nature and extent of required future cleanup and removal activities, and the extent and duration of regulatory oversight, among other things. The final outcome of any regulatory inquiries and requirements cannot be predicted with certainty, and unfavorable or unexpected outcomes could result in additional costs that could be material to the Company's results of operations during any particular year of the remediation process. See Note 6, \nCommitments and Contingencies - Site Remediation Obligation \nwithin Part IV, Item 15 - \"Exhibits and Financial Statement Schedule” of this Annual Report on Form 10-K\n,\n for further discussion on this site remediation obligation.\nRevenue Recognition\nRevenue is recognized when control of the promised goods or services is transferred to the Company's customers, in an amount that reflects the consideration that the Company is expected to be entitled to in exchange for those goods or services. The Company applied practical expedients related to unsatisfied performance obligations for (i) contracts with an original expected length of one year or less and (ii) contracts for which the Company recognizes revenue at the amount to which it has the right to invoice for services performed.\nNet sales of the Company’s principal services and products were as follows:\n \n \nYear Ended December 31,\n \n2023\n2022\nService Sales\nDigital Printing\n$\n170,083\n \n$\n174,752\n \nMPS\n74,764\n \n75,782\n \nScanning and Digital Imaging\n20,313\n \n17,357\n \nTotal services sales\n265,160\n \n267,891\n \nEquipment and Supplies Sales\n16,041\n \n18,119\n \nTotal net sales\n$\n281,201\n \n$\n286,010\n \n \nDigital Printing consists of professional services and software services to (i) re-produce and distribute large-format and small-format documents in either black and white or color (“Ordered Prints”) and (ii) specialized graphic color printing. Substantially, all of the Company’s revenue from Digital Printing comes from professional services to re-produce Ordered Prints. Sales of Ordered Prints are initiated through a customer order or quote and are governed by established terms and conditions agreed upon at the onset of the customer relationship. Revenue is recognized when the performance obligation under the terms of a contract with a customer are satisfied; generally, this occurs with the transfer of control of the re-produced Ordered Prints. Transfer of control occurs at a specific point-in-time, when the Ordered Prints are delivered to the customer’s site or handed to the customer for walk in orders. Revenue is measured as the amount of consideration the Company expects to receive in exchange for transferring goods or providing services. Taxes collected concurrent with revenue-producing activities are excluded from revenue. \nMPS consists of placement, management, and optimization of print and imaging equipment in the customers' offices, job sites, and other facilities. MPS relieves the Company’s customers of the burden of purchasing print equipment and related supplies and maintaining print devices and print networks, and shifts their costs to a “per-use” basis. MPS is supported by the Company's hosted proprietary technology, Abacus\n®\n, which allows customers to capture, control, manage, print, and account for their documents. Under its MPS contracts, the Company is paid a fixed rate per unit for each print produced (per-use), often referred to as a “click charge”. MPS sales are driven by the ongoing print needs of the Company’s customers at their facilities. Upon the issuance of ASC 842, \nLeases, \nthe Company concluded that certain of its MPS arrangements, which had previously been accounted for as service revenue under ASC 606, \nRevenue from Contracts with Customers, \nare accounted for as operating leases under ASC 842. The pattern of revenue recognition for the Company's MPS revenue has remained substantially unchanged following the adoption of ASC 842. See Note 7, \nLeasing, \nfor additional information.\nScanning and Digital Imaging, combines software and professional services to facilitate the capture, management, access and retrieval of documents and information that have been produced in the past. Scanning and Digital Imaging includes the Company's hosted SKYSITE ® software and ARC Facilities solution to organize, search and retrieve documents, as well as the \nF-14\nprovision of services that include the capture and conversion of hardcopy and electronic documents into digital files (“Scanned Documents”), and their cloud-based storage and maintenance. Sales of Scanning and Digital Imaging professional services, which represent substantially all revenue for the business line, are initiated through a customer order or proposal and are governed by established terms and conditions agreed upon at the onset of the customer relationship. Revenue is recognized when the performance obligation under the terms of a contract with a customer are satisfied; generally, this occurs with the transfer of control of the digital files. Transfer of control occurs at a specific point-in-time, when the Scanned Documents are delivered to the customer either through SKYSITE, ARC Facilities, or through other electronic media. Revenue is measured as the amount of consideration the Company expects to receive in exchange for transferring goods or providing services. Taxes collected concurrent with revenue-producing activities are excluded from revenue. \nEquipment and Supplies sales consist of reselling printing, imaging, and related equipment (“Goods”) to customers primarily in architectural, engineering and construction firms. Sales of Equipment and Supplies are initiated through a customer order and are governed by established terms and conditions agreed upon at the onset of the customer relationship. Revenue is recognized when the performance obligations under the terms of a contract with a customer are satisfied; generally, this occurs with the transfer of control of the Goods. Transfer of control occurs at a specific point-in-time, when the Goods are delivered to the customer’s site. Revenue is measured as the amount of consideration we expect to receive in exchange for transferring goods or providing services. Taxes collected concurrent with revenue-producing activities are excluded from revenue. The Company has experienced minimal customer returns or refunds and does not offer a warranty on equipment that it is reselling.\nThe Company has established contractual pricing for certain large national customer accounts (“Global Solutions”). These contracts generally establish uniform pricing at all operating segments for Global Solutions. Revenues earned from the Company’s Global Solutions are recognized in the same manner as non-Global Solutions revenues.\nIncluded in revenues are fees charged to customers for shipping, handling, and delivery services. Such revenues amounted to $\n11.0\n million and $\n11.3\n million for 2023 and 2022, respectively.\nRevenues from hosted software licensing activities are recognized ratably over the term of the license. Revenues from software licensing activities comprise less than \n2.5\n% of the Company’s consolidated revenues during the years ended December 31, 2023 and 2022.\nManagement provides for returns, discounts and allowances based on historic experience and adjusts such allowances as considered necessary.\n \nComprehensive Income (Loss)\nThe Company’s comprehensive income (loss) includes foreign currency translation adjustments, net of taxes. \nAsset and liability accounts of international operations are translated into the Company’s functional currency, U.S. dollars, at current rates. Revenues and expenses are translated at the average currency rate for the fiscal year.\nSegment and Geographic Reporting\nThe provisions of ASC 280, \nSegment Reporting\n, require public companies to report financial and descriptive information about their reportable operating segments. The Company identifies operating segments based on the various business activities that earn revenue and incur expense and whose operating results are reviewed by the Company's Chief Executive Officer, who is the Company's chief operating decision maker. Because its operating segments have similar products and services, classes of customers, production processes, distribution methods and economic characteristics, the Company operates as a single reportable segment.\nThe Company recognizes revenues in geographic areas based on the location to which the product was shipped or services have been rendered. \nSee table below for revenues and property and equipment, net, attributable to the Company’s U.S. operations and foreign operations.\n \nYear Ended December 31,\n \n2023\n2022\nU.S.\nForeign\nCountries\nTotal\nU.S.\nForeign\nCountries\nTotal\nRevenues from external customers\n$\n247,474\n \n$\n33,727\n \n$\n281,201\n \n$\n254,559\n \n$\n31,451\n \n$\n286,010\n \nProperty and equipment, net\n$\n35,868\n \n$\n5,057\n \n$\n40,925\n \n$\n34,595\n \n$\n5,619\n \n$\n40,214\n \nF-15\nAdvertising and Shipping and Handling Costs\nAdvertising costs are expensed as incurred and approximated $\n0.7\n million during 2023 and 2022. Shipping and handling costs incurred by the Company are included in cost of sales.\nStock-Based Compensation\nThe Company applies the Black-Scholes valuation model in determining the fair value of share-based payments to employees, which is then amortized on a straight-line basis over the requisite service period.\n \nTotal stock-based compensation for 2023 and 2022, was $\n2.2\n million and $\n1.8\n million, respectively, and was recorded in selling, general, and administrative expenses, consistent with the classification of the underlying salaries. In accordance with ASC 718, \nIncome Taxes\n, any excess tax benefit resulting from stock-based compensation, in the Consolidated Statements of Cash Flows, are classified along with other income tax cash flows as an operating activity.\nThe weighted average fair value at the grant date for options issued in 2023 and 2022, was $\n1.28\n and $\n0.96\n, respectively. \nThe fair value of each option grant was estimated on the date of grant using the Black-Scholes option-pricing model using the following weighted average assumptions for 2023 and 2022:\n \nYear Ended December 31,\n \n2023\n2022\nWeighted average assumptions used:\nRisk free interest rate\n3.7\n \n%\n2.1\n \n%\nExpected volatility\n63.0\n \n%\n56.4\n \n%\nExpected dividend yield\n6.4\n \n%\n6.2\n \n%\nUsing historical exercise data as a basis, the Company determined that the expected term for stock options issued in 2023 and 2022, was and \n7.2\n years and \n6.7\n years, respectively.\nFor fiscal years 2023 and 2022, expected stock price volatility is based on the Company’s historical volatility for a period equal to the expected term. The risk-free interest rate is based on the U.S. Treasury yield curve in effect at the time of grant with an equivalent remaining term\n.  The Company accounts for forfeitures of share-based awards when they occur. \nAs of December 31, 2023, total unrecognized stock-based compensation expense related to nonvested stock-based compensation was approximately $\n2.7\n million, which is expected to be recognized over a weighted average period of approximately \n1.7\n years.\nFor additional information, see Note 9, \nEmployee Stock Purchase Plan and Stock Plan.\nResearch and Development Expenses\nResearch and development activities relate to costs associated with the design and testing of new technology or enhancements and maintenance to existing technology. Such costs are expensed as incurred are primarily recorded to cost of sales.\n In total, research and development amounted to $\n6.2\n million and $\n6.5\n million, during 2023 and 2022, respectively.\nNoncontrolling Interest\nThe Company accounted for its investment in UDS under the purchase method of accounting, in accordance with ASC 805, \nBusiness Combinations\n. UDS has been consolidated in the Company’s financial statements from the date of acquisition.\n Noncontrolling interest, which represents the \n35\n% noncontrolling interest in UDS, is reflected on the Company’s Consolidated Financial Statements. In May of 2022, the Company completed an $\n11.2\n million capital distribution from its Chinese JV. As the Company is \n65\n% owner, $\n7.3\n million came to the Company's US operations, and \n35\n% or $\n3.9\n million went to the JV partner, thus resulting in a $\n3.9\n million decrease in the Company's consolidated cash and noncontrolling interest balance sheet accounts in 2022.\nSales Taxes\nThe Company bills sales taxes, as applicable, to its customers. The Company acts as an agent and bills, collects, and remits the sales tax to the proper government jurisdiction. The sales taxes are accounted for on a net basis, and therefore are not included as part of the Company’s revenue.\nF-16\nEarnings Per Share\nThe Company accounts for earnings per share in accordance with ASC 260, \nEarnings Per Share.\n Basic earnings per share is computed by dividing net income attributable to ARC by the weighted-average number of common shares outstanding for the period. Diluted earnings per common share is computed similarly to basic earnings per share except that the denominator is increased to include the number of additional common shares that would have been outstanding if common shares subject to outstanding options and acquisition rights had been issued and if the additional common shares were dilutive. Common share equivalents are excluded from the computation if their effect is anti-dilutive.\n There were \n4.1\n million and \n3.2\n million common shares excluded from the calculation of diluted net income attributable to ARC per common share as their effect would have been anti-dilutive for 2023 and 2022, respectively. The Company’s common share equivalents consist of stock options issued under the Company’s Stock Plan.\nBasic and diluted weighted average common shares outstanding were calculated as follows for 2023 and 2022:\n \n \nYear Ended December 31,\n \n2023\n2022\nWeighted average common shares outstanding during the period — basic\n42,543\n \n42,214\n \nEffect of dilutive stock awards\n941\n \n1,066\n \nWeighted average common shares outstanding during the period — diluted\n43,484\n \n43,280\n \nRecently Adopted Accounting Pronouncements\nIn June 2016, the FASB issued Accounting Standards Update No. 2016-13, \nFinancial Instruments - Credit Loss (Topic 326)  \n(“ASU 2016-13”), which updates the guidance on recognition and measurement of credit losses for financial assets. The new requirements, known as the current expected credit loss model (\"CECL\") will require entities to adopt an impairment model based on expected losses rather than incurred losses. ASU 2016-13 must be adopted on a modified-retrospective approach. This update was effective for fiscal years beginning after December 15, 2020 including interim periods within those fiscal years. In October 2019, the FASB approved an extension for all non-SEC filers, including small reporting companies, to extend the effective date to fiscal years beginning after December 15, 2022, including interim periods within those fiscal years. Therefore, the effective date for this update was January 1, 2023.  The implementation of CECL did not have a material impact on the Company's consolidated statements of financial condition and results of operations.\nRecent Accounting Pronouncements Not Yet Adopted\nIn December 2023, the FASB issued ASU 2023-09, \n“Income Taxes (Topic 740): Improvements to Income Tax Disclosures,”\n which requires public entities to disclose specific tax rate reconciliation categories, as well as income taxes paid disaggregated by jurisdiction, amongst other disclosure enhancements. The ASU is effective for financial statements issued for annual periods beginning after December 15, 2024, with early adoption permitted. The ASU can be adopted on a prospective or retrospective basis. The Company is evaluating the disclosure requirements related to the new standard.\nF-17\n3. \nGOODWILL AND OTHER INTANGIBLES\nGoodwill\nIn accordance with ASC 350, \nIntangibles - Goodwill and Other\n, the Company assesses goodwill for impairment annually as of September 30, and more frequently if events and circumstances indicate that goodwill might be impaired. At September 30, 2023, the Company performed its assessment and determined that goodwill was \nnot\n impaired.\nGoodwill impairment testing is performed at the reporting unit level. Goodwill is assigned to reporting units at the date the goodwill is initially recorded. Once goodwill has been assigned to reporting units, it no longer retains its association with a particular acquisition, and all of the activities within a reporting unit, whether acquired or internally generated, are available to support the value of the goodwill.  In 2017 the Company elected to early-adopt ASU 2017-04, \nIntangibles - Goodwill and Other (Topic 350): Simplifying the Test for Goodwill Impairment\n, which simplifies subsequent goodwill measurement by eliminating step two from the goodwill impairment test. \nThere can be no assurance that the estimates and assumptions made for purposes of the Company's goodwill impairment analysis in 2023 will prove to be accurate predictions of the future. If the Company’s assumptions, including forecasted EBITDA of certain reporting units, are not achieved, then the Company may be required to record goodwill impairment charges in future periods, whether in connection with the Company’s next annual impairment testing in the third quarter of 2024, or on an interim basis, if any such change constitutes a triggering event (as defined under ASC 350, \nIntangibles-Goodwill and Other\n) outside of the quarter when the Company regularly performs its annual goodwill impairment test. It is not possible at this time to determine if any such future impairment charge would result or, if it does, whether such charge would be material. \nThe carrying amount of goodwill from January 1, 2022 through December 31, 2023 is summarized as follows:\nGross\nGoodwill\nAccumulated\nImpairment\nLoss\nNet\nCarrying\nAmount\nJanuary 1, 2022\n$\n405,558\n \n$\n284,507\n \n$\n121,051\n \nDecember 31, 2022\n$\n405,558\n \n$\n284,507\n \n$\n121,051\n \nDecember 31, 2023\n$\n405,558\n \n$\n284,507\n \n$\n121,051\n \nLong-lived and Other Intangible Assets\nThe Company periodically assesses potential impairments of its long-lived assets in accordance with the provisions of ASC 360, \nAccounting for the Impairment or Disposal of Long-lived Assets\n. An impairment review is performed whenever events or changes in circumstances indicate that the carrying value of the assets may not be recoverable. The Company groups its assets at the lowest level for which identifiable cash flows are largely independent of the cash flows of the other assets and liabilities. The Company has determined that the lowest level for which identifiable cash flows are available is the regional level, which is the operating segment level.\nFactors considered by the Company include, but are not limited to, significant underperformance relative to historical or projected operating results; significant changes in the manner of use of the acquired assets or the strategy for the overall business; and significant negative industry or economic trends. When the carrying value of a long-lived asset may not be recoverable based upon the existence of one or more of the above indicators of impairment, the Company estimates the future undiscounted cash flows expected to result from the use of the asset and its eventual disposition. If the sum of the expected future undiscounted cash flows and eventual disposition is less than the carrying amount of the asset, the Company recognizes an impairment loss. An impairment loss is reflected as the amount by which the carrying amount of the asset exceeds the fair value of the asset, based on the fair value if available, or discounted cash flows, if fair value is not available. The Company assessed potential impairments of its long lived assets as of September 30, 2023 and concluded that there was \nno\n impairment.\nF-18\nThe following table sets forth the Company’s other intangible assets resulting from business acquisitions as of December 31, 2023 and 2022 which continue to be amortized:\n \n \nDecember 31, 2023\nDecember 31, 2022\n \nGross\nCarrying\nAmount\nAccumulated\nAmortization\nNet\nCarrying\nAmount\nGross\nCarrying\nAmount\nAccumulated\nAmortization\nNet\nCarrying\nAmount\nAmortizable other intangible assets\nCustomer relationships\n$\n99,185\n \n$\n99,178\n \n$\n7\n \n$\n99,087\n \n$\n99,073\n \n$\n14\n \nTrade names and trademarks\n20,262\n \n20,107\n \n155\n \n20,281\n \n20,087\n \n194\n \n$\n119,447\n \n$\n119,285\n \n$\n162\n \n$\n119,368\n \n$\n119,160\n \n$\n208\n \nEstimated future amortization expense of other intangible assets for each of the next five fiscal years and thereafter are as follows:\n \n2024\n$\n39\n \n2025\n35\n \n2026\n34\n \n2027\n34\n \n2028\n20\n \nThereafter\n—\n \n$\n162\n \n4. \nPROPERTY AND EQUIPMENT, NET\nProperty and equipment, net consist of the following:\n \nDecember 31,\n \n2023\n2022\nMachinery and equipment\n$\n245,802\n \n$\n246,262\n \nBuildings and leasehold improvements\n21,374\n \n23,128\n \nFurniture and fixtures\n2,871\n \n2,737\n \n270,047\n \n272,127\n \nLess accumulated depreciation\n(\n229,122\n)\n(\n231,913\n)\n$\n40,925\n \n$\n40,214\n \nDepreciation expense was $\n17.6\n million and $\n20.3\n million for 2023 and 2022, respectively.\n5. \nLONG-TERM DEBT\nLong-term debt consists of the following:\n \nDecember 31,\n2023\n2022\nRevolving Loans; \n6.8\n%\n and \n5.6\n% interest rate at December 31, 2023 and 2022, respectively\n40,000\n \n40,000\n \nVarious finance leases; weighted average interest rate of \n5.5\n%\n  and \n5.1\n% at December 31, 2023 and 2022, respectively; principal and interest payable monthly through November 2029\n22,236\n \n26,474\n \n62,236\n \n66,474\n \nLess current portion\n(\n8,870\n)\n(\n11,558\n)\n$\n53,366\n \n$\n54,916\n \nCredit Agreement\nOn June 15, 2023, the Company entered into an amendment (the \"Amendment\") to its Credit Agreement dated as of April \nF-19\n22, 2021 (the \"2021 Credit Agreement\") with U.S. Bank National Association, as administrative agent and the lenders part thereto. The Amendment, among other things, modifies certain terms of the 2021 Credit Agreement to replace the relevant benchmark provisions from the London Interbank Offered Rate to the forward-looking term rate based on the Secured Overnight Financing Rate (\"SOFR\"). The Amendment also modifies certain terms of the 2021 Credit Agreement relating to the payment of dividends and stock repurchases by the Company and the related component calculations included in the fixed charge coverage ratio that the Company is required to maintain. After giving effect to the Amendment, the Company is permitted to repurchase up to $\n10\n million of its stock in any \ntwelve-month\n period and all such permitted stock repurchases will be excluded from the calculation of the fixed charge coverage ratio. In addition, the Company is permitted to make other restricted payments that are not stock repurchases, such as the payment of dividends, of up to $\n12\n million made during any \ntwelve-month\n period which will be excluded from the calculation of the fixed charge coverage ratio. The making of stock repurchases and the payment of dividends and other restricted payments is subject, in each case, to pro forma compliance with the financial covenants and other customary conditions set forth in the 2021 Credit Agreement.\nThe 2021 Credit Agreement provides for the extension of revolving loans in an aggregate principal amount not to exceed $\n70\n million and replaces the Credit Agreement dated as of November 20, 2014, as amended (the \"2014 Credit Agreement\").  The obligation under the 2021 Credit Agreement matures on April 22, 2026. \nAs of December 31, 2023, the Company's borrowing availability of Revolving Loans under the Revolving Loan commitment was $\n27.8\n million, after deducting outstanding letters of credit of $\n2.2\n million and outstanding Revolving Loans of $\n40.0\n million.\nLoans borrowed under the 2021 Credit Agreement bear interest, in the case of Term SOFR loans, at a per annum rate equal to the applicable Term SOFR (which rate shall not be less than zero), plus a margin ranging from \n1.25\n% to \n1.75\n%, based on the Company’s Total Leverage Ratio (as defined in the 2021 Credit Agreement). Loans borrowed under the 2021 Credit Agreement that are not Term SOFR loans bear interest at a per annum rate equal to the Alternate Base Rate (as such terms is defined in the 2021 Credit Agreement) plus a margin ranging from \n0.25\n% to \n0.75\n%, based on the Company’s Total Leverage Ratio. As of December 31, 2023, one month Term SOFR loans borrowed under the 2021 Credit Agreement accrued interest at \n6.8\n%.\nThe Company pays certain recurring fees with respect to the 2021 Credit Agreement, including administration fees to the administrative agent.\nSubject to certain exceptions, including, in certain circumstances, reinvestment rights, the loans extended under the Credit Agreement are subject to customary mandatory prepayment provisions with respect to: the net proceeds from certain asset sales; the net proceeds from certain issuances or incurrences of debt (other than debt permitted to be incurred under the terms of the 2021 Credit Agreement); the net proceeds from certain issuances of equity securities; and net proceeds of certain insurance recoveries and condemnation events of the Company.\nThe 2021 Credit Agreement contains customary representations and warranties, subject to limitations and exceptions, and customary covenants restricting the ability (subject to various exceptions) of the Company and its subsidiaries to: incur additional indebtedness (including guarantee obligations); incur liens; sell certain property or assets; engage in mergers or other fundamental changes; consummate acquisitions; make investments; make certain distributions or repurchase equity interest of the Company or its subsidiaries; change the nature of their business; prepay or amend certain indebtedness; engage in certain transactions with affiliates; amend their organizational documents; or enter into certain restrictive agreements. In addition, the 2021 Credit Agreement contains financial covenants which requires the Company to maintain (i) at all times, a Total Leverage Ratio in an amount not to exceed \n2.75\n to 1.00; and (ii) a Fixed Charge Coverage Ratio (as defined in the 2021 Credit Agreement), as of the last day of each fiscal quarter, an amount not less than \n1.15\n to 1.00. The Company was in compliance with its covenants during the year ended December 31, 2023.\nThe 2021 Credit Agreement allows for payment of dividends. In December 2023, the Company's Board of Directors declared a quarterly cash dividend of $\n0.05\n per share of common stock that is payable on February 29, 2024 to stockholders of record as of January 31, 2024. Accordingly, the Company recorded a dividend payable of $\n2.1\n million within accrued expenses as of December 31, 2023. \nThe 2021 Credit Agreement contains customary events of default, including with respect to: nonpayment of principal, interest, fees or other amounts; failure to perform or observe covenants; material inaccuracy of a representation or warranty when made; cross-default to other material indebtedness; bankruptcy, insolvency and dissolution events; inability to pay debts; monetary judgment defaults; actual or asserted invalidity or impairment of any definitive loan documentation, repudiation of guaranties or subordination terms; certain ERISA related events; or a change of control.\nThe obligations of the Company’s subsidiary that is the borrower under the 2021 Credit Agreement are guaranteed by the Company and each of the Company's other United States subsidiaries. The 2021 Credit Agreement and any interest rate \nF-20\nprotection and other hedging arrangements provided by any lender party to the credit facility or any affiliate of such a lender are secured on a first priority basis by a perfected security interest in substantially all of the borrower’s, the Company’s and each guarantor’s assets (subject to certain exceptions).\n6. \nCOMMITMENTS AND CONTINGENCIES\nOperating Leases.\n The Company leases machinery, equipment, and office and operational facilities under non-cancelable operating lease agreements. Certain lease agreements for the Company’s facilities generally contain renewal options and provide for annual increases in rent based on the local Consumer Price Index. Refer to Note 7, \nLeasing,\n for the schedule of the Company’s future minimum operating lease payments as of December 31, 2023.\nLegal Proceedings\n. The Company is involved, and will continue to be involved, in legal proceedings arising out of the conduct of our business, including commercial and employment-related lawsuits. Some of these lawsuits purport or may be determined to be class actions and seek substantial damages, and some may remain unresolved for several years. The Company establishes accruals for specific legal proceedings when it is considered probable that a loss has been incurred and the amount of the loss can be reasonably estimated. The Company's evaluation of whether a loss is reasonably probable is based on our assessment and consultation with legal counsel regarding the ultimate outcome of the matter. As of December 31, 2023, the Company has accrued for the potential impact of loss contingencies that are probable and reasonably estimable. The Company does not currently believe that the ultimate resolution of any of these matters will have a material adverse effect on our results of operations, financial condition, or cash flows. However, the results of these matters cannot be predicted with certainty, and an unfavorable resolution of one or more of these matters could have a material adverse effect on our results of operations, financial condition, or cash flows.\nSite Remediation Obligation.\n As part of a business acquisition in the 1990’s, the Company purchased a site located in California where a former commercial gas station had operated from 1939 until approximately 1986. Prior to the Company's acquisition, the gas station was demolished and its underground storage tanks were removed. \nEnvironmental monitoring of the property was conducted from 1987 through 2017 under the oversight of the local County's Department of Environmental Health (\"CDEH\") and it eventually revealed petroleum products in the soil, groundwater, and the air in between soil particles. As a result, a Corrective Action Implementation Plan (\"CAIP\") detailing remedial clean-up methods at the site was required to be submitted in 2020. Accordingly, the Company recorded a liability on an undiscounted basis of $\n0.6\n million in 2020, the estimated cost, to remediate the site. \nThe 2020 CAIP was approved by the CDEH, but based on additional site data, the department requested a submission of addenda to the CAIP to address other site conditions. The additional review conducted in the fourth quarter of 2023 identified certain potential risks arising out of a structure on a neighboring property. As a result, in December of 2023, the CDEH requested that an alternative remedial plan be developed and submitted by March 12, 2024, to address the structural aspects of the site. The Company is in the process of finalizing an alternative plan with the guidance and expertise of an environmental consulting firm engaged expressly for this purpose. The additional concerns identified in 2023 require that the new plan be designed in a way that is significantly more expensive than the original plan, is more complicated, and will result in a longer duration to remediate the site.\n \nThe Company's \nConsolidated Balance Sheets\n include a liability on an undiscounted basis for the site remediation of $\n4.5\n million as of December 31, 2023, of which $\n2.2\n million is classified as a current liability, and $\n0.6\n million as of December 31, 2022.  As of December 31, 2023, the liability represents the Company's estimate of the probable cleanup, investigation, and remediation costs based on available information. The Company anticipates that most of this liability will be paid out over \nseven years\n, but some costs may be paid out over a longer period.  \nAs noted above, the estimate of the final remediation expenses may change over time because of the varying costs of currently available cleanup techniques, unpredictable contaminant reduction rates associated with available cleanup techniques, and the difficulty of determining in advance the nature and full extent of contamination. However, evolving statutory and regulatory standards, their interpretation, more vigorous enforcement policies of regulatory agencies, or stricter or different interpretations of existing statutory and regulatory standards, may require additional expenditures by the Company, which may be material. Accordingly, there can be no assurance that the Company will not incur significant additional environmental compliance costs in the future.\nF-21\n7. \nLEASING\nAdoption of ASC Topic 842, Leases\nThe Company accounts for leases under ASC 842, \nLeases.\n ASC 842 requires a dual approach for lessee accounting under which a lessee accounts for leases as finance leases or operating leases. Both finance leases and operating leases result in the lessee recognizing a Right of Use (ROU) asset and a corresponding lease liability. For finance leases the lessee recognizes interest expense and amortization of the ROU asset, and for operating leases the lessee will recognize a straight-line total lease expense. In addition, ASC 842 changes the definition of a lease, which resulted in changes to the classification of certain service contracts with customers to lease arrangements. \nThe Company elected certain additional practical expedients permitted by the new guidance allowing the Company to carry forward historical accounting related to lease identification and classification for existing leases upon adoption. The Company elected, for its equipment asset classes, the practical expedient that allows lessees to treat the lease and non-lease components of leases as a single lease component. Leases with an initial term of 12 months or less are not recorded on the Company's consolidated balance sheet.\n \nLessee Accounting\nThe Company determines whether an arrangement is a lease at contract inception. The Company's material lease contracts are generally for real estate or print equipment, and the determination of whether such contracts contain leases generally does not require significant estimates or judgments. The Company’s leases that are classified as operating leases primarily consist of real estate leases. The Company’s real estate leases contain both lease and non-lease components, which are accounted for separately. The Company’s leases that are classified as finance leases primarily consist of print equipment. Certain print equipment leases have lease and non-lease components, which are accounted for as a single lease component as discussed above. Other than the election to treat the Company's fixed lease payment as a single lease component, the accounting for finance leases will remain unchanged under ASC 842.\nOperating lease ROU assets and liabilities are recognized at commencement date based on the present value of lease payments over the lease term. As most of the Company's operating leases do not provide an implicit rate, the Company uses its incremental borrowing rate based on the information available at commencement date in determining the present value of lease payments. The operating lease ROU assets also include any lease payments made and are reduced by any lease incentives received. The lease terms range from \none\n to \nten years\n, with renewal terms that can extend the lease term from \none\n to \nfive years\n. A portion of the Company’s real estate leases are generally subject to annual changes in the Consumer Price Index (CPI), which are treated as variable lease payments and recognized in the period in which the obligation for those payments was incurred. The Company’s lease agreements do not contain any material residual value guarantees or material restrictive covenants.\n \nF-22\nThe tables below present financial information associated with the Company's leases as of, and the years ended, December 31, 2023 and December 31, 2022.\nClassification\nDecember 31, 2023\nDecember 31, 2022\nAssets\nOperating lease assets\nRight-of-use assets from operating leases\n$\n32,838\n \n$\n28,163\n \nFinance lease assets\nProperty and equipment\n50,317\n \n60,887\n \nLess accumulated depreciation\n(\n31,139\n)\n(\n38,607\n)\nProperty and equipment, net\n19,178\n \n22,280\n \nTotal lease assets\n$\n52,016\n \n$\n50,443\n \nLiabilities\nCurrent\nOperating\nCurrent portion of operating lease liabilities\n$\n9,924\n \n$\n9,924\n \nFinance\nCurrent portion of long-term finance leases\n8,870\n \n11,558\n \nLong-term\nOperating\nLong-term portion of operating lease liabilities\n27,357\n \n23,339\n \nFinance\nLong-term portion of finance leases\n13,366\n \n14,916\n \nTotal lease liabilities\n$\n59,517\n \n$\n59,737\n \nClassification\nYear Ended\nDecember 31, 2023\nDecember 31, 2022\nOperating lease cost\nCost of sales\n$\n13,702\n \n$\n12,940\n \nSelling, general and administrative expenses\n2,951\n \n2,813\n \nTotal operating lease cost\n (1)(2)\n$\n16,653\n \n$\n15,753\n \nFinance lease cost\nAmortization of leased assets\nCost of sales\n$\n10,313\n \n$\n12,718\n \nSelling, general and administrative expenses\n560\n \n461\n \nInterest on lease liabilities\nInterest expense, net\n1,429\n \n1,447\n \nTotal finance lease cost\n12,302\n \n14,626\n \nTotal lease cost\n$\n28,955\n \n$\n30,379\n \n \n(1)\n Includes variable lease costs and short-term lease costs of $\n3,895\n and $\n423\n, respectively for the year ended December 31, 2023.\n(2)\n Includes variable lease costs and short-term lease costs of $\n2,795\n and $\n240\n, respectively for the year ended December 31, 2022.\nF-23\nMaturity of lease liabilities (as of December 31, 2023)\nOperating Leases\n(1) (2)\nFinance Leases\n(3)\n2024\n$\n11,962\n \n$\n9,883\n \n2025\n9,860\n \n6,221\n \n2026\n7,789\n \n4,625\n \n2027\n6,642\n \n2,595\n \n2028\n4,283\n \n1,015\n \nThereafter\n2,345\n \n36\n \nTotal\n42,881\n \n24,375\n \nLess amount representing interest\n5,600\n \n2,139\n \nPresent value of lease liability\n$\n37,281\n \n$\n22,236\n \n(1)\n Reflects payments for non-cancelable operating leases with initial terms of one year or more as of December 31, 2023.  The table above does not include any legally binding minimum lease payments for leases signed but not yet commenced, and such leases are not material in the aggregate. \n(2)\n The Company leased several of its facilities under lease agreements with entities owned by certain of its current and former executive officers which expire through December 2028. The rental payments on these facilities amounted to $\n0.5\n million during 2023. In the table above, annual rental payments of $\n0.6\n million for related parties are included in 2024 through 2028. \n(3)\n The table above does not include any legally binding minimum lease payments for leases signed but not yet commenced, and such leases are not material in the aggregate.\nMaturity of lease liabilities (as of December 31, 2022)\nOperating Leases\n(1) (2)\nFinance Leases\n(3)\n2023\n$\n11,259\n \n$\n12,510\n \n2024\n8,354\n \n7,903\n \n2025\n6,437\n \n4,393\n \n2026\n4,467\n \n2,878\n \n2027\n3,836\n \n1,022\n \nThereafter\n2,983\n \n4\n \nTotal\n37,336\n \n28,710\n \nLess amount representing interest\n4,073\n \n2,236\n \nPresent value of lease liability\n$\n33,263\n \n$\n26,474\n \n(1)\n Reflects payments for non-cancelable operating leases with initial terms of one year or more as of December 31, 2022. The table above does not include any legally binding minimum lease payments for leases signed but not yet commenced, and such leases are not material in the aggregate. \nF-24\n(2)\n The Company leased several of its facilities under lease agreements with entities owned by certain of its current and former executive officers which were due to expire in December 2023 but were renewed for another \nfive years\n in the second half of 2023. The rental payments on these facilities amounted to $\n0.5\n million during 2022. In the table above, annual rental payments of $\n0.5\n million for related parties are included in 2023.\n(3)\n The table above does not include any legally binding minimum lease payments for leases signed but not yet commenced, and such leases are not material in the aggregate.\nDecember 31, 2023\nDecember 31, 2022\nWeighted average remaining lease term (years)\nOperating leases\n4.3\n4.3\nFinance leases\n3.1\n2.8\nWeighted average discount rate\nOperating leases\n6.2\n \n%\n5.2\n \n%\nFinance leases\n5.5\n \n%\n5.1\n \n%\nOther information\nYear Ended December 31, 2023\nYear Ended December 31, 2022\nCash paid for amounts included in the measurement of lease liabilities\nOperating cash flows from operating leases\n$\n14,997\n \n$\n14,907\n \nOperating cash flows from finance leases\n$\n1,424\n \n$\n1,451\n \nFinancing cash flows from finance leases\n$\n11,860\n \n$\n14,736\n \nLessor Accounting\nThe Company concluded that certain of its contracts with customers contain leases under the new leasing standard and accordingly should be accounted for as operating leases upon adoption of ASC 842.  Specifically, certain of the Company's MPS arrangements, which had previously been accounted for as service revenue under ASC 606, \nRevenue from Contracts with Customers, \nare now accounted for as operating leases under ASC 842.  \nThe Company's MPS arrangements consists of the placement, management, and optimization of print and imaging equipment in customers' offices, job sites, and other facilities under which the Company is paid a fixed rate per unit for each print produced (per-use), often referred to as a “click charge.” Accordingly, the fixed rate per unit charged to the customer covers the use of the equipment (i.e., the lease component), as well as the additional services performed by the Company as described above (i.e., the non-lease component). Certain of the Company's MPS contracts provide the customer the option to renew or terminate the agreement, which are considered when assessing the lease term. The Company elected the practical expedient to not separate certain lease and non-lease components related to its MPS arrangements, and accounts for the combined component under ASC 842. The pattern of revenue recognition for the Company's MPS revenue has remained substantially unchanged following the adoption of ASC 842.\nMPS revenue includes $\n68.8\n million of rental income and $\n6.0\n million of service income for the year ended December 31, 2023. MPS revenue includes $\n70.0\n million of rental income and $\n5.8\n million of service income for the year ended December 31, 2022. The Company's property and equipment, net of accumulated depreciation, includes approximately $\n20\n million and $\n23\n million of equipment subject to leases with customers under the Company's MPS arrangements for the years ended December 31, 2023 and December 31, 2022, respectively.  Following termination of an MPS arrangement, the Company will place existing equipment at an alternate customer site pursuant to an MPS arrangement, at one of the Company's service centers, or dispose of the equipment.\nF-25\n8. \nINCOME TAXES\nThe following table includes the consolidated income tax provision for federal, state, and foreign income taxes related to the Company’s total earnings before taxes for 2023 and 2022:\n \n \nYear Ended December 31,\n \n2023\n2022\nCurrent:\nFederal\n$\n—\n \n$\n—\n \nState\n215\n \n154\n \nForeign\n481\n \n487\n \n696\n \n641\n \nDeferred:\nFederal\n2,805\n \n4,142\n \nState\n682\n \n1,040\n \nForeign\n204\n \n9\n \n3,691\n \n5,191\n \nIncome tax provision\n$\n4,387\n \n$\n5,832\n \nThe Company's foreign earnings before taxes were $\n2.0\n million and $\n0.4\n million for 2023 and 2022, respectively.\nThe Company’s US earnings before taxes were $\n10.5\n million and $\n16.2\n million for 2023 and 2022, respectively.\nThe consolidated deferred tax assets and liabilities consist of the following:\n \nDecember 31,\n \n2023\n2022\nDeferred tax assets:\nFinancial statement accruals not currently deductible\n$\n950\n \n$\n985\n \nSite remediation obligation\n1,149\n \n166\n \nAccrued vacation\n765\n \n754\n \nAccrued bonuses\n543\n \n914\n \nDeferred revenue, net\n21\n \n37\n \nFixed assets\n2,980\n \n4,242\n \nRight of use operating lease liabilities\n9,600\n \n8,494\n \nGoodwill and other identifiable intangibles\n1,541\n \n745\n \nStock-based compensation\n2,343\n \n2,365\n \nFederal tax net operating loss carryforward\n11,990\n \n14,593\n \nState tax net operating loss carryforward, net\n4,723\n \n5,182\n \nForeign tax net operating loss carryforward\n487\n \n879\n \nTax credits, net\n213\n \n1,669\n \nGross deferred tax assets\n37,305\n \n41,025\n \nLess: valuation allowance\n(\n1,313\n)\n(\n2,651\n)\nNet deferred tax assets\n$\n35,992\n \n$\n38,374\n \nDeferred tax liabilities:\nGoodwill and other identifiable intangibles\n$\n(\n23,010\n)\n$\n(\n23,197\n)\nRight of use operating lease assets\n(\n8,547\n)\n(\n7,184\n)\nFixed assets\n(\n104\n)\n—\n \nNet deferred tax assets\n$\n4,331\n \n$\n7,993\n \nF-26\nA reconciliation of the statutory federal income tax rate to the Company’s effective tax rate is as follows:\n \n \nYear Ended December 31,\n \n2023\n2022\nStatutory federal income tax rate\n21\n \n%\n21\n \n%\nState taxes, net of federal benefit\n6\n \n6\n \nForeign taxes\n1\n \n1\n \nValuation allowance\n(\n11\n)\n1\n \nTax credits expired\n12\n \n—\n \nGlobal intangible low taxed income\n1\n \n—\n \nSection 162(m) limitation\n3\n \n2\n \nStock based compensation\n1\n \n3\n \nDiscrete items for federal, state and foreign taxes\n1\n \n1\n \nEffective income tax rate\n35\n \n%\n35\n \n%\nIn accordance with ASC 740-10, \nIncome Taxes\n, the Company evaluates the need for deferred tax asset valuation allowances based on a more likely than not standard. The ability to realize deferred tax assets depends on the ability to generate sufficient taxable income within the carryback or carryforward periods provided for in the tax law for each applicable tax jurisdiction. The Company considers the following possible sources of taxable income when assessing the realization of deferred tax assets:\n•\nFuture reversals of existing taxable temporary differences;\n•\nFuture taxable income exclusive of reversing temporary differences and carryforwards;\n•\nTaxable income in prior carryback years; and\n•\nTax-planning strategies.\nThe assessment regarding whether a valuation allowance is required or should be adjusted also considers all available positive and negative evidence factors, including but not limited to:\n•\nNature, frequency, and severity of recent losses;\n•\nDuration of statutory carryforward periods;\n•\nHistorical experience with tax attributes expiring unused; and\n•\nNear- and medium-term financial outlook.\nThe Company utilizes a rolling three years of actual and current year anticipated results as the primary measure of cumulative income/losses in recent years, as adjusted for permanent differences. The evaluation of deferred tax assets requires judgment in assessing the likely future tax consequences of events that have been recognized in the Company's financial statements or tax returns and future profitability. The Company's accounting for deferred tax consequences represents its best estimate of those future events. Changes in the Company's current estimates, due to unanticipated events or otherwise, could have a material effect on its financial condition and results of operations.  The Company has a $\n1.3\n million valuation allowance against certain deferred tax assets as of December 31, 2023.\nBased on the Company’s current assessment, the remaining net deferred tax assets as of December 31, 2023 are considered more likely than not to be realized. The valuation allowance of $\n1.3\n million may be increased or reduced as conditions change or if the Company is unable to implement certain available tax planning strategies. The realization of the Company’s net deferred tax assets ultimately depends on future taxable income, reversals of existing taxable temporary differences or through a loss carry back. \nAs of December 31, 2023, the Company had approximately $\n57.1\n million of consolidated federal, $\n75.8\n million of state and $\n2.9\n million of foreign net operating loss carryforwards available to offset future taxable income, respectively. Certain \nF-27\nfederal net operating loss carryforwards will begin to expire in 2032. Certain state net operating loss carryforwards will begin to expire in 2024. The foreign net operating loss carryforwards begin to expire in 2024. As of December 31, 2023, the Company had approximately $\n0.2\n million of foreign tax credit carryforwards which will expire in 2024.\nThe Company and some of its subsidiaries file income tax returns in the U.S. federal jurisdiction, and various states and foreign jurisdictions. The Company is not under examination in any U.S. federal, state or foreign jurisdiction. Due to net operating losses, substantially all the tax years from 2011 remain open to examination by the tax authorities.\nThere were \nno\n unrecognized tax benefits as of and for the years ended December 31, 2023 or 2022. The Company does not include interest and penalties related to uncertain tax positions as a component of income tax expense. The Company does not anticipate any significant changes to unrecognized tax benefits over the next 12 months. During the years ended December 31, 2023 and 2022, \nno\n interest or penalties were required to be recognized related to unrecognized tax benefits.\n \n9. \nEMPLOYEE STOCK PURCHASE PLAN AND STOCK PLAN\nEmployee Stock Purchase Plan\nUnder the Company’s Employee Stock Purchase Plan (the “ESPP”) eligible employees may purchase up to a calendar year maximum per eligible employee of the lesser of (i) \n2,500\n shares of common stock, or (ii) a number of shares of common stock having an aggregate fair market value of $\n25\n thousand as determined on the date of purchase at \n85\n% of the fair market value of such shares of common stock on the applicable purchase date. The compensation expense in connection with the ESPP in 2023 and 2022, was $\n23\n thousand and $\n17\n thousand, respectively.\nEmployees purchased the following shares in the periods presented:\n \n \nYear Ended December 31,\n \n2023\n2022\nShares purchased\n50\n \n45\n \nAverage price per share\n$\n2.64\n \n$\n2.16\n \nStock Plan\nOn April 29, 2021, the Company's stockholders approved the Company's 2021 Incentive Plan, replacing the 2014 Stock Incentive Plan, as amended, which is the only equity incentive plan under which the Company can currently grant equity incentive awards. The 2021 Incentive Plan provides for the grant of incentive and non-statutory stock options, stock appreciation rights, restricted stock, restricted stock units, stock bonuses and other forms of awards granted or denominated in the Company's common stock or units of the Company's common stock, as well as cash bonus awards, to employees, directors and consultants of the Company. On April 26, 2023, the Company's stockholders approved an amendment to the 2021 Incentive Plan (\"Amended 2021 Plan\") to increase the aggregate number of equity incentive shares authorized for issuance by \n5,000,000\n shares of common stock. Under the Amended 2021 Plan, the Company is authorized to issue up to \n8.5\n million shares plus such additional number of shares of common stock (up to \n6,132,593\n shares) as is equal to the number of shares of common stock subject to awards granted under the 2014 Incentive Plan and the Company's 2005 Stock Plan, which awards expire, terminate or are otherwise surrendered, cancelled, forfeited or repurchased by the Company pursuant to a contractual repurchase right.  At December 31, 2023, \n5.1\n million shares remain available for issuance under the Stock Plan.\nStock options granted under the Company's Stock Plan generally expire no later than \nten years\n from the date of grant. Options generally vest and become fully exercisable over a period of \nthree\n to \nfour years\n from date of award, except that options granted to non-employee directors may vest over a shorter time period. The exercise price of options must be equal to at least \n100\n% of the fair market value of the Company’s common stock on the date of grant. The Company allows for cashless exercises of vested outstanding options.\nDuring 2023 and 2022, the Company granted options to acquire a total of \n1.1\n million shares and \n1.7\n million shares, respectively, of the Company's common stock to certain key employees with an exercise price equal to the fair market value of the Company’s common stock on the date of grant. The granted stock options vest annually over \nthree\n to \nfour years\n from the grant date and expire \n10\n years after the date of grant.\nF-28\nThe following is a further breakdown of the stock option activity under the Stock Plan:\nShares\nWeighted\nAverage\nExercise\nPrice per Share\nWeighted\nAverage\nContractual\nLife\n(In years)\nAggregate\nIntrinsic\nValue\n(In thousands)\nOutstanding at December 31, 2021\n5,462\n \n$\n3.56\n \nGranted\n1,658\n \n$\n3.11\n \nExercised\n(\n618\n)\n$\n2.49\n \nForfeited/Canceled\n(\n533\n)\n$\n5.31\n \nOutstanding at December 31, 2022\n5,969\n \n$\n3.39\n \nGranted\n1,096\n \n$\n3.60\n \nExercised\n(\n805\n)\n$\n2.60\n \nForfeited/Canceled\n(\n82\n)\n$\n3.12\n \nOutstanding at December 31, 2023\n6,178\n \n$\n3.54\n \n5.99\n$\n2,740\n \nVested or expected to vest at December 31, 2023\n6,178\n \n$\n3.54\n \n5.99\n$\n2,740\n \nExercisable at December 31, 2023\n3,582\n \n$\n3.80\n \n4.26\n$\n2,105\n \nThe aggregate intrinsic value in the table above represents the total pretax intrinsic value (the difference between the closing stock price on December 31, 2023 and the exercise price, multiplied by the number of in-the-money options) that would have been received by the option holders had all the option holders exercised their options on December 31, 2023. This amount changes based on the fair market value of the common stock. Total intrinsic value of options exercised during the years ended December 31, 2023 and December 31, 2022 were $\n471\n thousand and $\n292\n thousand, respectively. \nA summary of the Company’s non-vested stock options as of December 31, 2023, and changes during the year then ended is as follows:\nWeighted\nAverage Grant Date\nNon-vested Options\nShares\nFair Market Value per Share\nNon-vested at December 31, 2022\n2,350\n \n$\n0.96\n \nGranted\n1,096\n \n$\n1.28\n \nVested\n(\n835\n)\n$\n0.94\n \nForfeited/Canceled\n(\n15\n)\n$\n1.14\n \nNon-vested at December 31, 2023\n2,596\n \n$\n1.10\n \nThe following table summarizes certain information concerning outstanding options at December 31, 2023:\n \nRange of Exercise Price per Share\nOptions Outstanding at\nDecember 31, 2023\n$\n1.14\n – $\n2.64\n2,218\n \n$\n3.20\n – $\n4.75\n3,196\n \n$\n6.16\n – $\n7.19\n392\n \n$\n8.89\n – $\n9.09\n372\n \n$\n1.14\n – $\n9.09\n6,178\n \nRestricted Stock\nIn 2023, the Company granted \n0.1\n million shares of restricted stock awards to certain key employees with a deemed issuance price per share equal to the closing price of the Company's common stock on the date the restricted stock was granted. These restricted stock awards vest annually over \nthree years\n from the grant date. In addition, the Company granted approximately \n30\n thousand shares of restricted stock awards to each of the Company's \nfour\n non-employee members of its board advisors or board of directors, with a deemed issuance price per share equal to the closing price of the Company's common stock on the date the restricted stock was granted. These restricted stock vests on the \none-year\n anniversary of the grant date.\nF-29\nIn 2022, the Company granted \n0.1\n million shares of restricted stock awards to certain key employees with a deemed issuance price per share equal to the closing price of the Company's common stock on the date the restricted stock was granted. These restricted stock awards vest annually over \nthree years\n from the grant date. In addition, the Company granted approximately \n16\n thousand shares of restricted stock awards to each of the Company's \nthree\n non-employee members of its board of directors with a deemed issuance price per share equal to the closing price of the Company's common stock on the date the restricted stock was granted. These restricted stock vests on the \none-year\n anniversary of the grant date. \nA summary of the Company’s non-vested restricted stock as of December 31, 2023, and changes during the year then ended is as follows:\nWeighted\nAverage Grant Date\nNon-vested Restricted Stock\nShares\nFair Market Value per Share\nNon-vested at December 31, 2022\n719\n \n$\n2.35\n \nGranted\n269\n \n$\n3.31\n \nVested\n(\n365\n)\n$\n2.40\n \nForfeited/Canceled\n—\n \n$\n—\n \nNon-vested at December 31, 2023\n623\n \n$\n2.73\n \nThe total fair value of restricted stock awards vested during the years ended December 31, 2023 and 2022 was $\n1.1\n million and $\n1.7\n million, respectively.\n10. \nRETIREMENT PLANS\nThe Company sponsors a 401(k) Plan, which covers substantially all employees of the Company who have attained age 21. Under the Company’s 401(k) Plan, eligible employees may contribute up to \n75\n% of their annual eligible compensation (or in the case of highly compensated employees, up to \n6\n% of their annual eligible compensation), subject to contribution limitations imposed by the Internal Revenue Service. The Company matches \n20\n% of an employee’s contributions, up to a total of \n4\n% of that employee’s compensation. An independent third party administers the Company’s 401(k) Plan. The Company's total expense under these plans amounted to $\n0.5\n million and $\n0.4\n million annually during fiscal years 2023 and 2022, respectively.\n \n11. \nFAIR VALUE MEASUREMENTS\nIn accordance with ASC 820, \nFair Value Measurement\n, the Company has categorized its assets and liabilities that are measured at fair value into a three-level fair value hierarchy as set forth below. If the inputs used to measure fair value fall within different levels of the hierarchy, the categorization is based on the lowest level input that is significant to the fair value measurement. The three levels of the hierarchy are defined as follows:\nLevel 1-inputs to the valuation methodology are quoted prices (unadjusted) for identical assets or liabilities in active markets.\nLevel 2-inputs to the valuation methodology include quoted prices for similar assets and liabilities in active markets, and inputs that are observable for the asset or liability, either directly or indirectly, for substantially the full term of the financial instrument.\nLevel 3-inputs to the valuation methodology are unobservable and significant to the fair value measurement.\nAs of December 31, 2023, the Company's assets and liabilities that are measured at fair value were not material.\nFair Values of Financial Instruments. \nThe following methods and assumptions were used by the Company in estimating the fair value of its financial instruments for disclosure purposes:\nCash equivalents:\n Cash equivalents are time deposits with maturity of three months or less when purchased, which are highly liquid and readily convertible to cash. Cash equivalents reported in the Company’s Consolidated Balance Sheets were $\n1.2\n million and $\n1.7\n million as of December 31, 2023 and 2022, respectively, and are carried at cost and approximate fair value due to the relatively short period to maturity of these instruments.\nShort- and long-term debt and finance leases:\n The carrying amount of the Company’s finance leases reported in the Consolidated Balance Sheets approximates fair value based on the Company’s current incremental borrowing rate for similar types of borrowing arrangements. The carrying amount reported in the Company’s Consolidated Balance Sheet as of \nF-30\nDecember 31, 2023 for borrowings under its Credit Agreement is $\n40.0\n million. The Company has determined that borrowings under its Credit Agreement of $\n40.0\n million as of December 31, 2023 approximates its fair value.\nF-31\n\n",
    "cik": "1305168",
    "cusip6": "00191G",
    "cusip": [
        "00191G103"
    ],
    "names": [
        "ARC DOCUMENT SOLUTIONS INC"
    ],
    "source": "https://www.sec.gov/Archives/edgar/data/1305168/000130516824000025/0001305168-24-000025-index.htm"
}