{
    "item1": ">Item 1. Business\nOverview and History \nASGN Incorporated (\"ASGN,\" \"we,\" or \"us\") is a leading provider of information technology (IT) services and solutions to the commercial and government sectors. We operate through two segments, Commercial and Federal Government, and across six industry verticals, which together promote balance, strength, and resiliency throughout economic cycles.  \nFrom a revenue and margin perspective, ASGN has grown through a combination of organic growth and strategic acquisitions. Over the last five years, we completed 11 \"tuck-in\" acquisitions. Each of these acquisitions align with our strategy to expand our IT consulting services and solutions capabilities, offer higher-value technical solutions, and become a leading provider of these high-end services to the commercial and federal government markets.\nFrom a client perspective, ASGN has grown by effectively understanding our clients’ IT needs and providing them with qualified professionals who maintain a unique combination of skills, experience, and expertise to meet those needs. Our clients set rigorous requirements for talent, which have only increased as we’ve evolved our business to offer higher-end, higher-value IT consulting solutions. To meet these talent requirements, we use our extensive databases and deep talent pool to quickly identify and pre-screen candidates. We are responsible for recruiting, verifying credentials upon request, hiring, administering pay and benefits, compliance and training, as applicable. As we support clients across a diverse set of industry verticals, no client, other than the U.S. federal government, represented more than 10 percent of revenues in 2023. Revenues from contracts directly with several U.S. federal government agencies combined were approximately 24.3 percent of 2023 consolidated revenues.\nFrom a business advancement perspective, ASGN invests in six core areas, including leadership, recruitment of in-demand skillsets, training and skill development, partnerships, internal artificial intelligence (\"AI\") tools, and client AI roadmaps. \nASGN was incorporated in 1992. Our principal office is located at 4400 Cox Road, Suite 110, Glen Allen, Virginia 23060, and our telephone number is (888) 482-8068. \n \nCommercial Segment\nOur Commercial Segment (71.3 percent of 2023 consolidated revenues) provides a broad spectrum of IT services and solutions to Fortune 1000 and large enterprise clients. Growth in this segment is being driven by digital transformation and innovation requirements, including, but not limited to, that of AI, workforce mobilization, and modern enterprise needs across five industry verticals: (i) Financial Services, (ii) Consumer and Industrial, (iii) Technology, Media and Telecom (\"TMT\"), (iv) Healthcare, and (v) Business and Government Services.\nOur robust commercial talent pool, which includes onshore, nearshore, and offshore professionals, can be deployed in short duration, solution-specific engagements, or on long-term consultative roles. Our roots in IT staffing offer a strong account base and foothold in our clients’ businesses, while our consulting offerings enable us to offer more value to our accounts via higher-end, higher margin work including workforce mobilization, modern enterprise, and digital innovation IT consulting services. Our subject matter experts deliver solutions that are customer focused and value driven across a continuum of cloud, data and analytics, cyber/information security, artificial intelligence/machine learning (\"AI/ML\"), including generative AI (“GenAI”), and digital transformation solutions to support our clients’ modern enterprise and digital needs.  Our clients are looking to meet their business challenges at greater speed and with more accuracy and precision. We are therefore harnessing developing technologies, such as Microsoft’s Copilot and Azure OpenAI, to increase the efficiency of our own teams, while at the same time developing AI roadmaps for our clients that leverage new generative technologies.\nCorporate support activities for this segment are primarily based in Richmond, Virginia. We also have a network of 90 branch offices across the United States, and four branch offices across Canada and Europe. In addition, we have two near-shore delivery centers in Mexico, and we maintain a small delivery center in India.\nConsulting \n— Our business focus and growth strategy of today lies in providing our clients with higher value IT consulting services. A byproduct of our decades-long, trusted client relationships over the years, our customers have engaged us in longer-term consulting contracts. Consulting contracts leverage the same talent pool as our assignment work but offer higher margin opportunities and increased revenue visibility. The average duration of commercial consulting projects is one year.\nAssignment\n — Our business heritage is in providing our clients with experienced IT and creative digital marketing billable professionals for temporary assignments and project engagements. Our billable professionals have knowledge and experience in specialized technical and creative digital marketing services that make them qualified to fill a given assignment or project. Assignment contracts may vary in length but \ntypically range between three and six months in duration. \nFederal Government Segment\nOur Federal Government Segment (28.7 percent of 2023 consolidated revenues), our sixth industry vertical, delivers advanced solutions in cloud and enterprise IT, cybersecurity, AI/ML, application, and digital transformation to some of the world's leading agencies in both the public and private sectors. Our team of skilled experts tackle critical and highly-complex challenges for customers in the U.S. defense, \n2\nintelligence, and federal civilian agencies. We maintain relationships with leading cloud, cybersecurity, and AI/ML providers and hold specialized certifications in these technologies. We have over 1,000 combined certifications, accreditations, and awards in AI/ML alone, and continue to invest in our traditional and generative AI skillsets through our Data and AI Center of Excellence, our hub for training and innovation that empowers federal agencies to harness the full potential of AI technology.\nThe segment provides services under time-and-materials, cost reimbursable, and firm-fixed-price contracts. Contracts range from approximately three to five years in length, providing longer-term revenue visibility and countercyclical support throughout market cycles. We have contract backlog of $3.0 billion as of December 31, 2023, which represents the estimated amount of future revenues to be recognized under awarded contracts including task orders and options. \nCorporate support activities for this segment are based in Fairfax, Virginia, and there are 19 branch offices located across the United States. \nIndustry and Market Dynamics\nASGN is a leading provider of IT services and solutions to the commercial and government sectors. ASGN helps leading corporate enterprises and government organizations develop, implement, and operate critical IT and business solutions through its integrated offering of IT consulting and professional staffing. Our total addressable market is approximately $580 billion, which includes $400 billion in commercial IT consulting, $121 billion in government IT consulting, and $59 billion in professional staffing. Our total addressable market has significantly expanded as clients have actively pulled us into higher-value consulting work for the commercial and government end markets.\nOur business model continues to evolve in line with client needs and expectations to focus on higher-end, higher-margin IT consulting services and solutions capabilities, particularly those related to digital transformation and other areas of technology change and specialization including data analytics, AI/ML, including both traditional and GenAI, big data, process automation, and information security. By employing our professional staffing and consulting services, our clients benefit from cost structure advantages, flexibility to address fluctuating demand in business, and access to greater expertise. We intend to continue to grow our diverse client base by focusing on large, stable accounts that are quick adopters of new technologies. We will invest in our organic growth while simultaneously looking to execute acquisitions in the commercial and federal government end markets focusing on IT consulting companies that provide us with new solution capabilities, industry expertise, or government contract awards.\nCandidates\nWe recruit candidates with backgrounds in IT and creative digital marketing who seek contract or permanent work opportunities. When we place these candidates on projects with clients, they become our employees. Many of these professionals, and those we place via subcontractors, are paid hourly wage or contract rates based on their specific skills. We pay the related costs of employment, including social security taxes, federal and state unemployment taxes, workers’ compensation insurance, and other similar costs for our employees. After achieving minimum service periods and/or hours worked, our professionals are offered access to medical and other voluntary benefit programs (e.g., dental, vision, disability) and the right to participate in our 401(k) retirement savings plan. Each professional’s employment relationship with us is terminable at will. In 2023, we employed approximately 23,500 billable professionals on a full-time-equivalent basis.\nStrategy\nASGN's strategy is to be a leading provider of IT services and professional solutions to the commercial and federal government sectors. We are focused on high-margin, scalable IT work for large commercial enterprise accounts and federal government customers. We have built a sizable consulting platform, with over 55 percent of our revenues in a combination of commercial and federal government IT consulting work in the fourth quarter of 2023. We have grown our IT consulting revenues both organically and through acquisitions, and our goal is to continue this growth. To achieve this goal, our acquisition strategy specifically focuses on IT consulting companies that add new services, technical capabilities, and contracts that support our commercial and federal government customer needs and that are in high demand by our customer base.\nOur strategic innovation efforts and technology investments focus on putting the best productivity tools in the hands of our recruiters, our candidates, and our clients, so that it is seamless for clients and billable professionals to work with ASGN. We position our teams to stay at the forefront of emerging trends in digitization and candidate sourcing, including GenAI technologies that assist teams in creating robust models around candidate search and match to best position our businesses and continuously improve how we serve clients and consultants.\nCompetition\nWe compete with other large publicly-held and privately-owned providers of human capital in the IT consulting and professional services segments on a local, regional, national, and international basis across the commercial and government end markets. With an industry focus that is supported by our solutions, our unique deployment model allows us to provide the right services at the right time. Our experienced engagement leaders and methodologies help our clients solve critical problems and create incremental value for their organizations.\nFrom a talent perspective, we offer more opportunities for the billable professional and are viewed as a better partner for their career objectives. In addition, competitive factors that attract qualified candidates are salaries and benefits; availability and variety of opportunities; quality, duration and location of assignments (if not remote/hybrid); and responsiveness to requests for placement. Many people seeking \n3\ncontract employment through us may also be pursuing employment through other means. Therefore, the speed at which we assign prospective professionals, and the availability of attractive and appropriate assignments, are important factors in our ability to fill open positions. \nFrom a client perspective, the principal competitive factors in obtaining and retaining clients are properly assessing the clients’ specific job and project requirements, the appropriateness of the professional assigned to the client, the price of services, and monitoring our clients’ satisfaction. Although we believe we compete favorably with respect to these factors and maintain an intimacy and institutional knowledge with our clients that enables us to successfully compete in the market, we expect competition to continue to increase particularly as we grow our IT consulting footprint. Nevertheless, our now larger total addressable market in IT consulting offers us a greater revenue opportunity. In addition, unlike our competitors in the traditional consulting space, for the majority of our IT consulting business we do not rely upon a bench to support us; rather, we use our database and a deep labor pool of highly-skilled technical talent developed over decades to provide and build teams that offer our clients a full suite of services tailored to their individual needs. This sophisticated project delivery model offers us a cost advantage over the competition that has enabled us to grow above industry averages.\nHuman Capital\nOur workforce is and will always be the core of our business. Our diverse talent pool strengthens our position as a leading global IT professional services firm, and we aim to recruit diverse leaders in their respective areas of expertise that support ASGN’s high-performance, innovative, and collaborative culture. In 2023, we employed approximately 3,700 internal employees, including sales directors, account managers, recruiters, and corporate office employees. We support our employees and billable professionals through the following initiatives: \nCulture and Belonging \n— At ASGN, we strive for equity across all levels of employment. Our efforts include training, recruitment, retention, and advancement programs. These programs aim to remove bias in hiring and promotions. Our Diversity, Equity, and Inclusion (“DEI”) Director leads programs aimed at promoting personal and professional growth for employees from diverse backgrounds, providing our employees with increased opportunities to feel motivated, valued, and fulfilled as they achieve personal and professional successes at ASGN. Over 40 percent of our senior level management positions are diverse by racial and ethnic diversity, sexual orientation, gender, disability, or veteran status. While we believe we have assembled a diverse workforce and leadership team, we are committed to continuous improvement to foster an increased sense of belonging. In 2023, we launched a Company-wide inclusion council to collaborate, strategize, and implement initiatives that enrich our workplaces, nurture inclusivity, and drive sustainable growth. Women comprise 27 percent of ASGN’s Board of Directors (\"Board\") and 18 percent of its members identify as being from an underrepresented group.  \nHealth, Safety, and Well-being — \nOur employees enjoy competitive compensation and benefits packages, which include medical, dental, and vision plans; flexible spending accounts; and savings plans. We further support our employees' emotional well-being and physical health with wellness programming and personal growth workshops\n. \nGuided by our Company-wide Employee Wellness and Workplace Health and Safety policies, we continue to seek opportunities to expand our offerings where feasible. Further, ASGN offers flexible and hybrid work schedules to support work-life balance and contribute to the well-being of our employees at work and at home. \nOur goal is to create and maintain a safe, healthy, and happy workplace that motivates and leads to retention across the Company. \nEmployee Engagement, Retention and Development\n — \nWe prioritize career growth through ongoing education and professional development. \nEmployees are provided with comprehensive training, including programming on ethics and integrity, workplace inclusion and belonging, discrimination and harassment, cybersecurity, workplace safety, and career-specific modules. We achieved a 72 percent overall participation rate in our 2023 employee engagement survey. \nWe continue to support ASGN’s Employee Resource Groups (“ERGs”) and Employee Community Groups (“ECGs”) across our brands to foster a diverse and inclusive environment. \nERGs are voluntary, employee-led groups whose aim is to create a safe space, foster an inclusive workplace, and provide support, \nwhile \nECGs are voluntary social circles of employees who join based on shared values, interests, and goals. \nWe have initiated a mentorship program (“ASGN Engage & Empower”) which is a cornerstone of our commitment to foster an environment where every employee has the opportunity to grow, learn, and contribute to their fullest potential. Mentors value the fresh perspectives of the mentees, while mentees feel supported and gain insights into different business areas.\nCollaborative Performance Management\n — We believe in empowering our employees to drive their career growth. This includes seeking varied job roles, cross-functional training, and participating in special projects. Our performance management process focuses on developing clear goals at the start of each calendar year (or at the beginning of one’s term of employment) and providing constructive feedback and support throughout the year to best develop our employees’ careers and position them for success.\nFor more information about our workforce programs and initiatives, please visit the Sustainability section of our website: ASGN.com/Sustainability. Nothing on our website shall be deemed incorporated by reference into this 2023 10-K.\n \nGovernment Regulation\n \nWe take reasonable steps to ensure that our billable professionals possess all current licenses and certifications required for each placement. We provide workers’ compensation insurance, unemployment insurance, and professional liability insurance for our employees. For a further discussion of government regulation associated with our business, see \nPart I, Item 1A.\n \nRisk Factors\n.\n \n4\nAvailable Information and Access to Reports\n \nWe electronically file our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, Proxy Statements, and all amendments to those reports and statements with the Securities and Exchange Commission (\"SEC\"). The SEC maintains an internet site \nsec.gov\n that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. You may also read and copy any of our reports that are filed with the SEC by visiting:\n \n•\nOur website, \nasgn.com\n; or\n•\nBy contacting our Investor Relations Department at info@asgn.com.\nOur reports are available through any of the foregoing means and are available free of charge on our website as soon as practicable after such material is electronically filed with or furnished to the SEC. Also available on our website are copies of our Code of Ethics for the Principal Executive Officer and Senior Financial Officers, Code of Business Conduct and Ethics, Corporate Governance Guidelines, and the charters for the committees of our Board. We intend to disclose any amendment to, or waiver from, a provision of our Code of Ethics for our Principal Executive Officer and Senior Financial Officers on our website promptly after the amendment or waiver has been granted. \n5",
    "item1a": ">Item 1A. Risk Factors\nOur business is subject to various risks, including, but not limited to those described below, any of which could adversely affect our results of operations and financial condition, and as a result, could cause a decline in the trading price of our common stock.\nProfitability and Operational Risks\nIf we are not able to remain competitive in obtaining and retaining clients, our future growth will suffer. Many of our agreements may be terminated by clients at will and the termination of a significant number of such agreements would adversely affect our revenues and results of operations.\nThe professional staffing and consulting services industry is highly competitive and fragmented with limited barriers to entry. We compete in national, regional, and local markets with full-service agencies and in regional and local markets with specialized contract staffing agencies and consulting businesses. The success of our business depends upon our ability to continually secure new consulting projects and assignment contracts from clients and to fill them with our billable professionals.\nMost of our agreements with clients do not provide for exclusive use of our services and many of our agreements may be terminated at will. As such, clients are free to place orders with our competitors. If clients terminate a significant number of our staffing and consulting agreements or do not use us for future assignments and we are unable to generate new work to replace lost revenues, the growth of our business could be adversely affected, and our revenues and results of operations could be harmed. As a result, it is imperative to our business that we maintain positive relationships with our clients. In our consulting business, clients may delay or cancel bookings which may cause expected revenues to be realized in a later period or not at all.  If we are not able to comply with performance requirements, our revenues and relationships with our clients may be adversely affected.\nTo the extent that competitors seek to gain or retain market share by reducing prices or increasing marketing expenditures, we could lose revenues and our margins could decline, which could harm our operating results and cause the trading price of our stock to decline. We expect competition for clients to increase in the future, and the success and growth of our business depends on our ability to remain competitive. In addition, we participate in a number of third-party contracts as a subcontractor and that requires us to participate in vendor management contracts, which may subject us to greater risks or lower margins.\nIf we are unable to attract and retain qualified billable professionals, our business could be adversely affected.\nOur business is substantially dependent upon our ability to attract and retain billable professionals who possess the skills, experience, advanced degrees, certifications, licenses, and clearances which may be required to meet the specified requirements of our clients. We compete for such billable professionals with other staffing and consulting companies, government contractors, and our clients and potential clients. There can be no assurance that qualified professionals will be available to us in adequate numbers to staff our temporary assignments or client projects. Moreover, the employment of our temporary billable professionals is terminable at will and they are often hired to become regular employees of our clients. Attracting and retaining billable professionals depends on several factors, including our ability to provide billable professionals with desirable assignments and competitive wages and benefits. The cost of attracting and retaining billable professionals may be higher than we anticipate if there is an increase in competitive wages and benefits and, as a result, if we are unable to pass these costs on to our clients, our likelihood of achieving or maintaining profitability could decline. In periods of low unemployment, there may be a shortage of, and significant competition for, the skilled professionals sought by our clients. If we are unable to attract and retain a sufficient number of billable professionals to meet client demand, we may be required to forgo revenue opportunities, which may hurt the growth of our business. In periods of high unemployment, due to a large pool of available candidates, clients are able to directly hire and recruit qualified candidates without the involvement of our services.\nSometimes we utilize subcontractors to provide us with qualified professionals. The subcontractors are generally small companies that may lack the resources or experience to comply with complex and fluid wage and hour and other laws. A subcontractor’s failure in this regard could adversely affect our ability to perform and subject us to additional legal liabilities, which could have a material adverse effect on our relationships with clients and on our results of operations.\nOur future performance depends on the Company’s effective execution of our business strategy.\nIn prior years, we have experienced revenue and earnings growth both organically and through acquisitions. There is no assurance that we will be able to continue this pace of growth in the future or meet our strategic objectives for growth, and in fact our growth declined this past year due to macroeconomic conditions. Our growth could be adversely affected by many other factors, including future technology industry conditions, macroeconomic events such as inflation, recession, and interest rate increases, competition, and labor market trends or regulations. If our growth rate continues to decline, or we fail to grow at the pace anticipated and we are unsuccessful in our growth initiatives and strategies, our financial results could be less than our expectations or those of investors or analysts.\nOur business strategy also includes continuing efforts to integrate and optimize our organization, programs, technology, and delivery of services to make us a more agile and effective competitor, to reduce the cost of operating our business, and to increase our operating profit and operating profit margin. We may not be successful in our continuing integration and optimization efforts, which may cause us to fail to achieve the cost savings we anticipate or limit our ability to scale growth. Further, we may fail to prevent the return of costs eliminated in \n6\nthese efforts. If we are not successful in implementing our integration and optimization efforts, our business, financial condition, and results of operations could be adversely affected.\nPerformance under contracts, including those on which we have partnered with third parties, may be adversely affected if we or the third parties fail to deliver on commitments or otherwise breach obligations to our clients.\nOur contracts are complex and, in some instances, may require that we partner with other parties, including software and hardware vendors, to provide the complex solutions required by our clients. Our ability to deliver the solutions and provide the services required by our clients is dependent on our and our partners’ ability to meet our clients’ delivery schedules and other expectations. Our partners may at times be impacted by global events, the changing macroeconomic environment and supply chain disruptions, as well as rapid increases in demand for their products and services, any of which may impact their ability to provide their products and services within our expected timeframes or at anticipated prices.  If we or our partners fail to deliver services on time, our ability to complete the contracts may be adversely affected. \nOur results of operations could be adversely affected if we cannot successfully keep pace with technological changes in the development and implementation of our services.\nOur success depends on our ability to keep pace with rapid technological changes in the development and implementation of our services. We rely on a variety of technologies to support important functions in our business, including the recruitment, placement and monitoring of our billable professionals, our billings, and candidate and client data analytics. If we do not sufficiently invest in new technology and industry developments (such as emerging job and resume posting services), appropriately implement new technologies, or evolve our business at sufficient speed and scale in response to such developments, or if we do not make the right strategic investments to respond to these developments, our services, results of operations, and ability to develop and maintain our business could be adversely affected.\nAI, including GenAI, is a growing component of our business in both the commercial market and government space.  We work both internally and with our enterprise customer base to develop strategic use cases for GenAI technologies.  For example, we recently announced a collaboration with Microsoft to invest in and pilot NextGen AI technologies, including Copilot for Microsoft 365 and Azure OpenAI Service. AI technologies are complex and rapidly evolving, and we face significant competition, including from our own clients, who may develop their own internal AI-related capabilities, which in each case, can lead to reduced demand for our services or solutions. As these technologies evolve, some services and tasks currently performed by our people will likely be replaced by automation. \nThe failure to prevent a cybersecurity incident affecting our systems could result in the disruption of our services or the disclosure or misuse of sensitive information, which could harm our reputation, decrease demand for our services and products, expose us to liability, penalties, and remedial costs, or otherwise adversely affect our financial performance.\nOur daily business operations depend on our information technology systems for a wide variety of functions, including, among other things, identifying consulting and staffing resources, matching personnel with client assignments, and managing our accounting and financial reporting functions. In conducting our business, we routinely collect and retain personal information on these systems about our employees and billing professionals and their dependents. \nAny information-technology systems are at risk of being compromised, whether through malicious activity or human or technological error. Although we devote significant resources to maintain and regularly upgrade our information security technologies, and we have implemented security controls to help protect the security and privacy of our business information, our information technology systems are subject to potential security breaches through third-party service providers, employee negligence, fraud or misappropriation, business email compromise and cybersecurity threats, including denial of service attacks, viruses, ransomware, or other malicious software programs, and third parties gaining unauthorized access to our information technology systems for purposes of misappropriating assets or confidential information, corrupting data, or causing operational disruption. We are continuously exposed to unauthorized attempts to compromise such sensitive information through cyber attacks, insider threats and other information security threats, including physical break-ins and malicious insiders, and we have, from time to time, experienced security incidents. \nAny security incident that results in the compromise of personal information we collect and retain, or that otherwise disrupts or negatively impacts our operations, could harm our reputation, lead to customer or employee attrition, and expose us to regulatory enforcement action or litigation. Because the techniques used in cyber attacks change frequently and may be difficult to detect for periods of time, we may face difficulties in anticipating and implementing adequate security measures to prevent security breaches. In addition, our information technology systems are vulnerable to fire, storm, flood, power loss, computer and network failures, problems with transitioning to upgraded or replacement systems or platforms, flaws in third-party software or services, terrorist attacks, and similar events. All of these risks are also applicable wherever we rely on outside vendors to provide services. For information on our cybersecurity risk management, strategy, and governance, see Item 1C. Cybersecurity.\nWe may not successfully make or integrate acquisitions, which could harm our business and growth.\nAs part of our growth strategy, we have made numerous acquisitions, and we intend to continue to pursue select acquisitions in the future. We compete with other companies for acquisition opportunities and there can be no assurance that we will be able to successfully identify suitable acquisition candidates or be able to complete future acquisitions on favorable terms, if at all. In making acquisitions, we may pay substantial amounts of cash, incur debt, or issue securities to finance our acquisitions, which would adversely affect our liquidity or capital resources or result in dilution to our stockholders. There also can be no assurance that we will realize the benefits expected from any transaction or receive a favorable return on investment from our acquisitions.\n7\nThe integration of an acquisition involves a number of factors that may affect our operations. These factors include diversion of management’s attention from other business concerns, difficulties or delay in the integration of acquired operations, retention of key personnel, significant unanticipated costs or legal liabilities, and tax and accounting issues. Furthermore, once we have integrated an acquired business, the business may not achieve anticipated levels of revenue, profitability or productivity, or otherwise perform as expected. Any of these factors may have a material adverse effect on our results of operations and financial condition.\nAn impairment in the carrying amount of goodwill and other intangible assets could require a write-down that materially and adversely affects our results of operations and net worth.\nAs of December 31, 2023, we had $1.9 billion of goodwill and $497.9 million of net acquired intangible assets. We review goodwill and indefinite-lived intangible assets (consisting entirely of trademarks) for impairment at least annually, and when events or changes in circumstances indicate that the carrying amount may not be recoverable. Intangible assets having finite lives are amortized over their useful lives and are tested for recoverability whenever events or changes in circumstances indicate that the carrying amount may not be recoverable. We may be required to record a charge, which could be material, in our financial statements during the period in which we determine an impairment has occurred. Impairment charges could materially and adversely affect our results of operations in the periods that such charges are recorded.\nFailure to comply with the terms of our debt agreements could affect our operating flexibility. \nOur outstanding debt at December 31, 2023 included a term loan of $498.8 million under our senior secured credit facility due 2030, and $550.0 million of 4.625 percent unsecured senior notes due 2028. We have a $500.0 million senior secured revolving credit facility due 2028, which is fully available as of December 31, 2023. Our term loan has a variable interest rate, making us vulnerable to increases in interest rates. Additionally, we use a portion of our cash provided by operations for interest payments on our debt rather than for our operations. \nOur failure to comply with restrictive covenants under our debt instruments could result in an event of default, which, if not cured or waived, could result in the requirement to repay such borrowings before their due date. Some covenants are tied to our operating results and thus may be breached if we do not perform as expected. We expect to use cash on hand and cash provided by operations to pay our expenses and repay our debt. If we do not have enough cash, we may be required to refinance all or part of our existing debt, sell assets or borrow additional funds. The lenders may require fees and expenses to be paid or other changes to terms in connection with waivers or amendments. If we refinance these borrowings on less favorable terms or our costs and/or the interest rates on our outstanding debt increase, our results of operations and financial condition could be adversely affected by increased costs and/or rates.\nU.S. and global market and economic developments could adversely affect our business, financial condition, and results of operations.\nDemand for the IT services and solutions that we provide is significantly affected by global market and economic conditions, including recessions, inflation, interest rates, tax rates, and economic uncertainty. Our business is particularly susceptible to economic conditions in the United States where our clients or operations are concentrated. As economic activity slows, many clients or potential clients reduce their use of and reliance upon billable professionals, which reduces the demand for the Company’s services and could significantly decrease the Company’s revenues and profits. During periods of reduced economic activity, we may also be subject to increased competition for market share and pricing pressure. As a result, any significant economic downturn in the United States or other countries in which we operate could have a material adverse effect on our business, financial condition, and results of operations. \nNatural disasters, the effects of climate change, pandemics, and other events beyond our control could harm our business.\n \nNatural disasters or other catastrophic events may cause damage or disruption to our operations, international commerce, and the global economy, and thus could have a negative effect on us. Our business operations are subject to interruption from earthquakes, hurricanes, tornadoes, floods, fires, severe weather, power shortages, pandemics and other public health concerns, terrorism, political unrest, telecommunications failure, vandalism, cyber-attacks, geopolitical instability, war and other actual or threatened military conflicts, the effects of climate change, actions taken by the U.S. or other governments in response to any of the foregoing, and other events beyond our control. Although we maintain disaster recovery plans, such events could disrupt our operations or those of our customers and suppliers, including through the inability of employees and billable professionals to work, destruction of facilities, loss of life, and adverse effects on supply chains, power, infrastructure and the integrity of information technology systems, any of which could materially increase our costs and expenses, delay or decrease revenue from our customers, disrupt our ability to maintain business continuity, or otherwise have a material adverse effect on our business, results of operations, financial condition, and prospects. Further, our insurance may not be sufficient to cover losses or additional expenses that we may sustain. In addition, we could incur significant costs to improve the climate-related resiliency of our infrastructure and otherwise prepare for, respond to, and mitigate the effects of climate changes. \nOur business relies heavily on the health and safety of our employees, billable professionals, and customers. The impact of a health crisis such as a pandemic on our business, operations, and future financial performance could include, but is not limited to, adverse impacts to our operating income, operating margin, net income, earnings per share and operating cash flows, as expenses may not decrease at the same rate as revenues decline. In addition, our quarterly and annual revenue growth rates and expenses as a percentage of our revenues may differ significantly from our historical rates, and our future operating results may fall below expectations. \n8\nOur environmental, social and governance (ESG) commitments and disclosures may expose us to reputational risks and legal liability.\n \nWe, as with other companies, are facing increasing scrutiny related to our environmental, social and governance (“ESG”) practices and disclosures from certain investors, shareholder advocacy groups, customers, employees, federal, state, and local governments, and other stakeholders. With this increased focus, public reporting regarding ESG practices is becoming more broadly expected. Such increased scrutiny may result in increased costs, enhanced compliance or disclosure obligations, or other adverse impacts on our business, financial condition, or results of operations. \nFurther, our brand and reputation are associated with our public commitments to various corporate ESG initiatives, including our goals relating to sustainability. Our disclosures on these matters and any failure or perceived failure to achieve or accurately report on our commitments, could harm our reputation and adversely affect our client relationships or our recruitment and retention efforts, as well as expose us to potential legal liability. Increasing focus on ESG matters has resulted in, and is expected to continue to result in, the adoption of legal and regulatory requirements designed to mitigate the effects of climate change on the environment, as well as legal and regulatory requirements requiring climate-related disclosures. If new laws or regulations are more stringent than current legal or regulatory requirements, we may experience increased compliance burdens and costs to meet such obligations. Our selection or application of disclosure frameworks and standards, and the interpretation or application of those frameworks and standards, may change from time to time or may not meet the expectations of investors or other stakeholders. Our processes and controls for reporting ESG matters across our operations and supply chain are evolving along with multiple disparate standards for identifying, measuring, and reporting ESG metrics, including ESG-related disclosures that may be required by the SEC, European, and other regulators. Such standards may change over time, which could result in significant revisions to our current goals, reported progress in achieving such goals, or ability to achieve such goals in the future.\nRisks Related to Government Contracts\nWe may not realize the full value of our Federal Government Segment contract backlog, which may result in lower revenues than anticipated. \nContract backlog, which was $3.0 billion at December 31, 2023, is a useful measure of potential future revenues for our Federal Government Segment. Contract backlog consists of contracts for which funding has been formally awarded (funded backlog of $0.5 billion at December 31, 2023) and unfunded backlog, which represents the estimated future revenues to be earned from negotiated contract awards for which funding has not been awarded, and from unexercised contract options (unfunded backlog of $2.5 billion at December 31, 2023). The U.S. government’s ability to not exercise contract options, to reduce orders, or to modify, curtail or terminate our contracts, makes the calculation of our Federal Government Segment contract backlog subject to numerous uncertainties. Due to the uncertain nature of our contracts with the U.S. government, we may never realize revenue from some of the contracts that are included in our contract backlog. \nChanges in U.S. government spending or budgetary priorities, the failure of government budgets to be approved on a timely basis, or delays in contract awards and other procurement activity may significantly and adversely affect our future financial results.\nOur business depends upon continued U.S. government expenditures on cybersecurity, cloud and enterprise IT, AI/ML, digital transformation, and other programs that we support. During 2023, revenues from contracts directly with U.S. federal government agencies were approximately 24.3 percent of consolidated revenues.  All of our government contracts can be terminated by the U.S. government either for its convenience or if we default by failing to perform under the contract. The U.S. government conducts periodic reviews of U.S. defense strategies and priorities, which may shift Department of Defense budgetary priorities, reduce overall spending, or delay contract or task order awards for defense-related programs from which we would otherwise expect to derive a significant portion of our future revenues. Any of these changes could impair our ability to obtain new contracts or contract renewals. Any new contracting requirements or procurement methods could be costly or administratively difficult for us to implement. Our revenues, cash flows, and operating results could be adversely affected by spending caps or changes in budgetary priorities, as well as by delays in the government budget process, program starts, the award of contracts or task orders under contracts, or by a government shutdown. Considerable uncertainty exists regarding how future budget and program decisions will unfold, including the spending priorities of the U.S. government. Because the U.S. Congress did not complete a budget before the end of the 2023 fiscal year, government operations are currently being funded through short-term continuing resolutions. These continuing resolutions authorize agencies of the U.S. government to continue to operate, but do not authorize new spending initiatives. When the U.S. government operates under a continuing resolution, contract awards may be delayed, canceled, or funded at lower levels which could adversely impact our operations, cash flows, and financial results. Failure to complete a budget for fiscal year 2024 or to provide for another continuing resolution by applicable deadlines may result in a federal government shutdown, which could cause us to incur labor or other costs without reimbursement under customer contracts or the delay or cancellation of key programs, and could adversely impact our operations, cash flows, and financial results.\nWe derive significant revenues from contracts and task orders awarded through a competitive bidding process. Our revenues and profitability may be adversely impacted if we fail to compete effectively in such processes.\nOur contracts and task orders with the federal government are awarded through a competitive bidding process, which creates significant competition and pricing pressure. We spend time and resources to prepare bids and proposals for contracts. Some of these contracts may not be awarded to us or, if awarded, we may not receive meaningful task orders under these contracts. We may encounter delays and additional expenses if our competitors protest or challenge contracts awarded to us in competitive bidding, and any such protest or challenge could result in the resubmission of bids on modified specifications, or in the termination, reduction, or modification of the awarded contract. If we are unable to win particular contracts, we may be prevented from providing services to customers that are purchased under those contracts for a number of years. In addition, upon the expiration of a contract, if the customer requires further services of the type provided by the contract, \n9\nthere is frequently a competitive rebidding process. There can be no assurance that we will win any particular bid, or that we will be able to replace business lost upon expiration or completion of a contract, and the termination or non-renewal of any of our significant contracts could cause our actual results to differ materially and adversely from those anticipated.\nOur earnings and profitability may vary based on the mix of our contracts and may be adversely affected by our failure to accurately estimate and manage costs, time, and resources.\nOur Federal Government Segment generates revenues under various types of contracts: firm-fixed-price, cost reimbursable, and time and materials. Our earnings and profitability may vary materially depending on changes in the proportionate amount of revenues derived from each type of contract. Under firm-fixed-price contracts, we perform specific tasks and services for a fixed price. Compared with cost reimbursable, firm-fixed-price contracts generally offer higher margin opportunities, but involve greater financial risk because we bear the impact of cost overruns. Failure to accurately estimate costs, resources, and technology needed to perform our contracts or to effectively manage and control our costs during the performance of work could result in reduced profits or in losses. Under cost reimbursable contracts, we are reimbursed for allowable costs plus a profit margin or fee. These contracts generally have lower profitability and less financial risk. Under time and materials contracts, we are reimbursed for labor at negotiated hourly billing rates and for certain expenses. We assume financial risk on time and materials contracts because we assume the risk of performing those contracts at negotiated hourly rates.\nA significant loss or suspension of our facility or employee security clearances with the federal government could lead to a reduction in our revenues, cash flows, and operating results.\nWe act as a contractor and a subcontractor to the U.S. federal government and many of its agencies. Some government contracts require us to maintain facility security clearances and require some of our employees to have advanced degrees and/or to maintain individual security clearances. If we are unable to attract or retain qualified employees, our employees lose or are unable to timely obtain security clearances, or we lose a facility clearance, a government agency client may terminate the contract or decide not to renew it upon its expiration. In addition, a security breach by us could cause serious harm to our business, damage our reputation, and prevent us from being eligible for further work on sensitive or classified systems for federal government clients.\nWe are required to comply with numerous laws and regulations related to government contracts, some of which are complex, and our failure to comply could result in fines or civil or criminal penalties, or suspension or debarment, which could materially and adversely affect our results of operations.\nWe must comply with laws and regulations relating to the formation, administration, and performance of federal government contracts. These laws and regulations affect how we conduct business with our federal government customers. Such laws and regulations may potentially impose added costs on our business and our failure to comply with them may lead to civil or criminal penalties, termination of our U.S. government contracts, and/or suspension or debarment from contracting with U.S. government agencies. All of our U.S. government contracts can be terminated by the U.S. government either for its convenience or if we default by failing to perform under the contract. Termination for convenience provisions provide only for our recovery of costs incurred or committed settlement expenses and profit on the work completed prior to termination. Termination for default provisions provide for the contractor to be liable for excess costs incurred by the U.S. government in procuring undelivered items from another source and could damage our reputation and impair our ability to compete for future contracts. Failure to comply with regulations and required practices and procedures could harm our reputation or influence the award of new contracts. \nWe depend on our teaming arrangements and relationships with other contractors and subcontractors. If we are not able to maintain these relationships, or if these parties fail to satisfy their obligations to us or the customer, our revenues, profitability, and growth prospects could be adversely affected.\nWe rely on teaming relationships with other prime contractors and subcontractors in order to submit bids for large procurements or other opportunities where we believe the combination of services, products, and solutions provided by us and our teammates will help us to win and perform the contract. Our future revenues and growth prospects could be adversely affected if other contractors eliminate or reduce their contract relationships with us, or if the U.S. government terminates or reduces these other contractors’ programs, does not award them new contracts, or refuses to pay under a contract. We may have disputes with our subcontractors arising from, among other things, the quality and timeliness of work performed by the subcontractor, customer concerns about the subcontractor, our failure to extend existing task orders or issue new task orders under a subcontract, our hiring of a subcontractor’s personnel, or the subcontractor’s failure to comply with applicable law. If any of our subcontractors fail to satisfactorily perform the agreed-upon services or have regulatory compliance or other problems, our ability to fulfill our obligations as a prime contractor or higher tier subcontractor may be jeopardized. When we are in the role of a subcontractor, we often lack control over fulfillment of a contract, and poor performance on the contract could impact our customer relationship, even when we perform as required. Moreover, our revenues and operating results could be adversely affected if any prime contractor chose to offer directly to the customer services of the type that we provide, or if they team with other companies to provide those services.\n10\nAudits by U.S. government agencies for contracts with federal government clients could result in unfavorable audit results that could subject us to a variety of penalties and sanctions and could harm our reputation and relationships with our customers and adversely impact results of operations.\nFederal government agencies, including the Defense Contract Audit Agency and the Defense Contract Management Agency, routinely audit and investigate government contracts and government contractors’ administrative processes and systems. These agencies review our performance on contracts, pricing practices, cost structure, and compliance with applicable laws, regulations, and standards. Any costs found to be improperly allocated to a specific contract will not be reimbursed, while such costs already reimbursed must be refunded. If a government audit uncovers improper or illegal activities, we may be subject to civil and criminal penalties and administrative sanctions, including termination of contracts, forfeiture of profits, suspension of payments, fines, and suspension or debarment from doing business with federal government agencies in the future.\nLegal and Regulatory Risks\nSignificant legal actions, claims or investigations could subject us to substantial uninsured liabilities, result in damage to our business reputation, result in the discontinuation of our client relationships, and adversely affect our recruitment and retention efforts.\nWe employ people internally and in the workplaces of other businesses. Our ability to control or influence the workplace environment of our clients is limited. Further, many of the individuals that we place with our clients have access to client information systems and confidential information. As the employer of record of our billable professionals, we incur a risk of liability due to the actions of our billable professionals at client sites or with client information and systems, and to our billable professionals for various workplace events, including claims of physical injury, discrimination, harassment, or failure to protect confidential personal information. Other inherent risks include possible claims of errors and omissions, claims related to acquisitions and their earn-outs, intentional misconduct, release, misuse or misappropriation of client intellectual property, criminal activity, torts, or other claims. We have been and could, in the future, be subject to large collective, class, or Private Attorneys General Act (\"PAGA\") actions alleging violation of wage and hour laws. These types of actions typically involve substantial claims and significant defense costs. We also have been subject to legal actions alleging vicarious liability, negligent hiring, discrimination, sexual harassment, retroactive entitlement to employee benefits or pay, retaliation, and related legal theories. We may be subject to liability in such cases even if the contribution to the alleged injury was minimal. Moreover, in most instances, we are required to indemnify clients against some or all of these risks if they are caused by us or our employees, and we could be required to pay substantial sums to fulfill our indemnification obligations. \nA failure of any of our employees internally, or billable professionals in clients' workplaces, to observe our policies and guidelines intended to reduce these risks could result in negative publicity, injunctive relief, investigations and/or charges, payment of monetary damages or fines, or other material adverse impacts on our business. Claims raised by clients stemming from the improper actions of our billable professionals, even if without merit, could cause us to incur significant expense associated with the costs or damages related to such claims. Further, such claims by clients could damage our business reputation and result in the discontinuation of client relationships. Any associated negative publicity could adversely affect our ability to attract and retain clients and qualified billable professionals in the future.\nWe proactively address many of these issues with our robust compliance program. Further, to protect ourselves from the costs and damages of significant legal actions and claims, we maintain workers’ compensation, errors and omissions, cybersecurity, employment practices, and general liability insurance coverage in amounts and with deductibles that we believe are appropriate for our operations. Our insurance policies include a retention amount and may not cover all claims against us or continue to be available to us at a reasonable cost. In addition, we face various employment-related risks not covered by insurance, such as wage and hour laws and employment tax responsibility. If we do not maintain adequate insurance coverage or are made party to significant uninsured claims, we may be exposed to substantial liabilities that could have a material adverse impact on our results of operations and financial condition.\nOur business is subject to government regulation, which in the future could restrict the types of employment services we are permitted to offer or result in additional or increased costs that reduce our revenues and earnings.\nThe IT consulting and staffing services industry is regulated in the United States and other countries in which we operate. We are subject to federal, state, and local laws and regulations governing the employer/employee relationship, such as those related to payment of federal, state, and local payroll and unemployment taxes for our corporate employees and billable professional employees, tax withholding, social security or retirement benefits, licensing, wage and hour requirements, paid sick leave, paid family leave and other leaves, employee benefits, pay equity, non-discrimination, sexual harassment, and workers’ compensation; and we must further comply with immigration laws and a wide variety of notice and administrative requirements, such as record keeping, written contracts, notification, and reporting. We are also subject to U.S. laws and regulations relating to government contracts with federal agencies. In certain other countries, we may not be considered the legal employer of our temporary personnel, however we are still responsible for collecting taxes and social security deductions and transmitting these amounts to the taxing authorities.\nIn addition, we are subject to data privacy, protection, and security laws and regulations, the most significant of which are the European General Data Protection Act (\"GDPR\") and the U.K.’s Data Protection Act 2018 (which implements the GDPR into U.K. law). These laws impose stringent data protection requirements on\n \npersonal information and provide for significant penalties for noncompliance. These laws impact our U.S. operations as well as our European operations as they apply not only to third-party transactions, but also to transfers of information among the Company and its subsidiaries.  Certain U.S. states have also enacted data privacy laws requiring security measures for personal information. Any non-compliance with the data privacy laws applicable to our business could result in governmental enforcement actions, fines, and other penalties that could potentially have an adverse effect on our operations and reputation.\n11\nFuture changes in the laws or governmental regulations affecting our business may result in the prohibition or restriction of certain types of employment services that we are permitted to offer, or the imposition of new or additional compliance requirements that could increase our costs and reduce our revenues and earnings. Due to the substantial number of state and local jurisdictions in which we operate, there also is a risk that we may be unable to adequately monitor actual or proposed changes in, or the interpretation of, the laws or governmental regulations of such states and localities. Any delay in our compliance with changes in such laws or governmental regulations could result in potential fines, penalties, or other sanctions for non-compliance. In addition, although we may elect to bill some or all of any additional costs to our customers, there can be no assurances that we will be able to increase the fees charged to our customers in a timely manner and in a sufficient amount to fully cover any increased costs as a result of future changes in laws or government regulations.\nOur development and use of emerging AI services and solutions involves risks and uncertainties that could expose us to legal, reputational, and financial harm.\nApplicable laws and regulations, both existing and forthcoming, often focus on AI use when that technology is used to influence outcomes or make inferences about individuals, groups, or communities. These new and emerging technologies require use-case-specific governance, with oversight that adequately addresses AI-specific areas of concern, such as transparency, explainability, fairness, harmful bias mitigation, and unique third-party privacy and security risks. If we fail to establish and maintain sufficient oversight, which evolves at the rapid pace with which AI technology is changing, we could be subject to sanctions under the relevant laws, breach of contract claims, contract termination, class action, or individual lawsuits from affected parties, negative press articles, reputational damage, and a loss of confidence from our clients, all of which could adversely affect our existing business, future opportunities, and financial condition.\nOur business may be materially affected by changes to fiscal and tax policies that could adversely affect our results of operations and cash flows.\nOur business is subject to taxation in the United States and the foreign jurisdictions where we operate. Due to economic and political\n \nconditions, tax rates in various jurisdictions may be subject to significant change. Our future effective tax rates could be affected by changes made by the current administration in the United States and in the mix of earnings in countries with differing statutory tax rates or by changes in the tax laws or their interpretation.\nVarious levels of government also are increasingly focused on tax reform and other legislative action to increase tax revenue. Further changes in tax laws in the United States or foreign jurisdictions where we operate, or in the interpretation of such laws, could have a material adverse effect on our business, results of operations, financial condition, or cash flows.\nWe are subject to various business and regulatory risks associated with international operations, which could increase our costs, cause our results of operations to fluctuate, and adversely affect our business. \nWe conduct business outside the United States primarily in Canada and Europe, and we have delivery centers in Mexico and India. Our international operations, which represented approximately two percent of our consolidated revenues in 2023, expose us to, among other things, operational, regulatory, and political risks in the countries in which we operate. \nGeneral Risks\nThe loss of key members of our senior management team could adversely affect the execution of our business strategy and our financial results.\nWe believe that the successful execution of our business strategy and our ability to build upon our business and acquisitions of new businesses depends on the continued employment of key members of our senior management team and good succession plans for their retirement or other departure. As the Company continues to expect to have key personnel retire, we need to implement appropriate succession plans, and if we cannot attract and retain qualified personnel or effectively implement appropriate succession plans, it could have a material adverse impact to our business, financial condition, and/or results of operations. We have provided short-term and long-term incentive compensation to our key management in an effort to retain them, and have prepared succession plans at such time as their employment ends. However, if members of our senior management team become unable or unwilling to continue in their present positions, or our succession plans are not adequate, we could incur significant costs and experience business disruption related to time spent on efforts to replace them, and our financial results and our business could be adversely affected.\nFailure of internal controls may leave us susceptible to errors and fraud.\nManagement does not expect that our disclosure controls and internal controls will prevent all errors and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable assurance that the objectives of the control system are met. Furthermore, because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, would be detected, particularly in our newly acquired companies and international operations. If our internal controls are unsuccessful, our business and results of operations could be adversely affected.\n12\nThe trading price of our common stock has experienced significant volatility.\nThe market price of our stock has fluctuated substantially in the past and could fluctuate substantially in the future, based on a variety of factors, including our operating results; changes in general conditions in the economy and/or the staffing and consulting industries; announcements by our competitors; involvement in a significant litigation matter; a major change in our management; and short sales, hedging, and other derivative transactions in shares of our common stock. In addition, the stock market in general has experienced historical volatility that is unrelated to the operating performance of our Company. Broad market and industry fluctuations may adversely affect the market price of our common stock, regardless of our operating results. Among other things, volatility in our stock price could mean that investors will not be able to sell their shares at or above the prices they pay.  The volatility also could impair our ability in the future to offer common stock as a source of additional capital or as consideration in the acquisition of other businesses, or as compensation for our key employees.\nProvisions in our corporate documents and Delaware law may delay or prevent a change in control that our stockholders consider favorable.\nProvisions in our certificate of incorporation and bylaws could have the impact of delaying or preventing a change of control or changes in our management. These provisions include the following:\n•\nOur Board has the right to elect directors to fill a vacancy in the Board upon the resignation, death, or removal of a director, which prevents stockholders from being able to fill vacancies on our Board until the next applicable annual meeting of stockholders.\n•\nStockholders must provide advance notice to nominate individuals for election to the Board or to propose matters that can be acted upon at a stockholders’ meeting. Further, our Board is divided into three classes and only one class is up for election each year. These provisions may discourage or deter a potential acquirer from conducting a solicitation of proxies to elect the acquirer’s own slate of directors or otherwise attempting to obtain control of us.\n•\nOur Board may issue, without stockholder approval, up to one million shares of undesignated or \"blank check\" preferred stock. The ability to issue undesignated or \"blank check\" preferred stock makes it possible for our Board to issue preferred stock with voting or other rights or preferences that could impede the success of any attempt by, or make it more difficult for, a third party to acquire us.\nAs a Delaware corporation, we are also subject to certain Delaware anti-takeover provisions, including Section 203 of the Delaware General Corporation Law. Under these provisions, a corporation may not engage in a business combination with any large stockholders who hold 15 percent or more of our outstanding voting capital stock in a merger or business combination unless the holder has held the stock for three years, the Board has expressly approved the merger or business transaction, or at least two-thirds of the outstanding voting capital stock not owned by such large stockholder approves the merger or the transaction. These provisions of Delaware law may have the impact of delaying, deferring, or preventing a change of control and may discourage bids for our common stock at a premium over its market price. In addition, our Board could rely on these provisions of Delaware law to discourage, prevent, or delay an acquisition of us.",
    "item1b": ">Item 1B. Unresolved Staff Comments\nNot applicable.\n \n13\nItem 1C. Cybersecurity\nA process for assessing, identifying, and managing cybersecurity related risks is integrated into our overall enterprise risk management (“ERM”) process. Cybersecurity related risks are included in the risk universe that the ERM process participants evaluate to assess top risks to the Company on an annual basis. The Audit Committee of the Board oversees the ERM annual risk assessment. Furthermore, as a digital innovation and transformation company, we are committed to our ever-evolving cyber protocols that safeguard our people, clients, and data. Every year, we assess our approach to information and physical security, risk management, incident response, business continuity management, and personal data privacy and protection. \nASGN takes an enterprise approach to data protection and cybersecurity, focusing on continual process and technology improvements to enable safety, security, and information privacy. All ASGN’s brands align to the Department of Defense’s Cybersecurity Maturity Model Certification (“CMMC”) 2.0 framework and have implemented common technology and data protection and cybersecurity controls and processes, which provides a unified approach to our cybersecurity measures. We have invested in endpoint protection, cloud security, vulnerability management, and data loss prevention, featuring insider threat detection, we also conduct regular threat actor risk assessments and assess the risk posed by third-party vendors. Further, ASGN conducts penetration tests to detect potential security gaps in cloud and on-premise systems. These tests continuously simulate cyber-attacks on physical hardware, network endpoints, and critical applications such as Oracle, SQL and web services. \nASGN maintains a vigilant approach to cybersecurity and operational readiness, with cybersecurity practices designed to reduce the impact of any incident. ASGN has business continuity and disaster recovery policies. Our plans are tested annually to confirm critical business functions can continue with minimal disruption in unforeseen circumstances. \nWe conduct regular internal and external audits to adhere to our security policies and procedures and identify improvement areas. Our audits include: annual audits conducted by third-party service providers, internal audits, compliance audits, risk assessments, and incident response audits. In addition to these audits, ASGN collaborates with industry partners, law enforcement agencies, and government organizations to share intelligence and best practices related to cybersecurity. This collaboration helps us stay ahead of emerging threats and continuously improve our security posture. \nIn 2023, ASGN has not identified risks from known cybersecurity threats, including as a result of any prior cybersecurity incidents, that have materially affected or are reasonably likely to materially affect us, including our operations, business strategy, results of operations, or financial conditions. \nGovernance\nASGN’s data protection and cybersecurity governance structure enables transparency and visibility to key stakeholders: the Company's Board and its Strategy and Technology and Audit Committees, and the Company's Chief Executive Officer. The Board's Strategy and Technology Committee focuses on technology and cybersecurity, while the Board's Audit Committee reviews data security breaches or other issues. Each committee reports to the full Board regarding its activities, including those related to cybersecurity. The full Board also receives briefings from management on our cyber risk management program. Board members receive presentations on cybersecurity topics from the Company's chief information officers across our brands (\"CIOs\") and external experts as part of the Board's continuing education on topics that impact public companies.\nTwo key enabling bodies, ASGN’s Enterprise Security Council and the Security Operations Center (“SOC”), have primary responsibility for our overall cybersecurity risk management program and provide the structure necessary to set policy and direction as well as operationalize our required security posture.\n•\nOur CIOs lead our internal Enterprise Security Council collectively representing ASGN and its Segments which reports to our Chief Executive Officer and the Board's Strategy and Technology Committee. These leaders bring a wealth of experience in security operations, business process re-engineering, software development, ERP systems, and the management of multinational wide area networks. Complementing this expertise, the Enterprise Security Council includes a dedicated team of Cybersecurity Information Professionals (CISP), consisting of brand-specific system engineers and security administrators. The council's primary mandate is to formulate comprehensive data protection and cybersecurity policies for ASGN, oversee the management of emerging security threats, proactively mitigate security risks, and safeguard our valuable assets.\n•\nECS Federal, LLC (\"ECS\"), ASGN’s Federal Government Segment, plays a vital role in safeguarding ASGN through its essential security control function. Serving as a managed services provider for both clients and internal operations, ECS oversees the SOC which is dedicated to monitoring, detecting, and responding to cybersecurity threats across our organization. Operating 24 hours a day, seven days a week, our SOC diligently filters system logs, leveraging proprietary AI/ML tools to identify global threats. We conduct continuous active hunts and forensic analysis inspections on our network, proactively seeking out malware and intrusions.\n14",
    "item2": ">Item 2. Properties\n \nAs of December 31, 2023, we leased office space in the following locations. We believe that our facilities are suitable and adequate for our current operations.\nLocation\nSquare Feet\nLease Expiration\nASGN and Commercial Segment Headquarters\nRichmond, Virginia\n78,000\nApril 2027\nFederal Government Segment Headquarters\nFairfax, Virginia\n46,200\nNovember 2029\nBranch offices \n(1)\nUnited States, Canada, United Kingdom, and Spain\n695,200\nJanuary 2024 through January 2030\nDelivery Centers\nMexico and India\n84,700\nMay 2024 through December 2027\n___________________\n(1)\n We have 113 branch office locations that occupy spaces ranging from approximately 1,683 to 47,000 square feet with lease terms that range from one year to 12.6 years.",
    "item3": ">Item 3. Legal Proceedings\n \nWe are involved in various legal proceedings, claims, and litigation arising in the ordinary course of business, including collective class and PAGA actions alleging violations of wage and hour laws. However, based on the facts currently available, we do not believe that the disposition of matters that are pending or asserted will have a material effect on our financial position, results of operations, or cash flows.",
    "item4": ">Item 4. Mine Safety Disclosures\nNot applicable.\n15\nPART II",
    "item5": ">Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nCommon Stock\n \n— Our common stock is listed on the New York Stock Exchange, or NYSE, under the symbol ASGN. At February 15, 2024 we had 46.5 million shares outstanding, 23 holders of record and an indeterminate number of beneficial owners of our common stock held through brokers and other intermediaries.\nDividend Information\n \n— Since inception, we have not declared or paid any cash dividends on our common stock, and we have no present intention of paying any dividends on our common stock in the foreseeable future. Our Board periodically reviews our dividend policy to determine whether the declaration of dividends is appropriate. The terms of our credit facility restrict our ability to pay dividends. The restriction is variable based upon our leverage ratio and certain other circumstances, as outlined in the agreement.\nSecurities Authorized for Issuance Under Equity Compensation Plan\n \n— Information responsive to this item will be set forth in the Company’s definitive proxy statement for use in connection with its 2024 Annual Meeting of Stockholders (the \"2024 Proxy Statement\") to be filed with the SEC within 120 days after the end of the Company’s fiscal year and is incorporated herein by reference.\nStock Performance Graph\n \n— The following graph compares the performance of ASGN’s common stock price during the period from December 31, 2018 to December 31, 2023 with the composite prices of companies listed on the NYSE and of companies included in the SIC Code No. 736—Personnel Supply Services Companies Index. The graph depicts the results of investing $100 in our common stock, the NYSE market index, and an index of the companies listed in the SIC Code No. 736 on December 31, 2018, and assumes that dividends were reinvested, where applicable, during the period.\n \nThe comparisons shown in the graph below are based upon historical data, and we caution stockholders that the stock price performance shown in the graph below is not indicative of, nor intended to forecast, potential future performance.\n    \nAt December 31, \n2018\n2019\n2020\n2021\n2022\n2023\nASGN\n$\n100.00 \n$\n130.22 \n$\n153.27 \n$\n226.42 \n$\n149.50 \n$\n176.46 \nSIC Code No. 736 Index\n$\n100.00 \n$\n122.83 \n$\n132.23 \n$\n180.23 \n$\n128.44 \n$\n138.26 \nNYSE Market Index\n$\n100.00 \n$\n125.74 \n$\n134.53 \n$\n162.34 \n$\n147.16 \n$\n167.43 \n16\nRecent Sales of Unregistered Securities\n — None.\nCommon Stock Repurchases \n— On April 24, 2023, the Company's Board approved a new stock repurchase program under which the Company may repurchase up to $500.0 million of its common stock over the following two years and this replaces the previous program. Under terms of the programs, purchases can be made in the open market or under a Rule 10b5-1 trading plan. The stock repurchase program does not obligate the Company to acquire any particular amount of the Company's stock and may be suspended at any time at the Company's discretion.\nThe Company's repurchases of its common stock during the three months ended December 31, 2023, and the approximate dollar value of shares that may be purchased under the program as of December 31, 2023, are shown in the table below.\nPeriod\nTotal Number of Shares Purchased\nAverage Price Paid per Share\nTotal Number of Shares Purchased as Part of Publicly Announced Plan\nApproximate Dollar Value of Shares That May Yet be Purchased Under \nthe Plan\n(in millions)\nOctober\n320,306 \n$\n81.10 \n320,306 \n$\n323.1 \nNovember\n335,701 \n$\n87.67 \n335,701 \n$\n293.7 \nDecember\n213,340 \n$\n93.71 \n213,340 \n$\n273.7 \nTotal\n869,347 \n$\n86.73 \n869,347 \n$\n273.7 \nIn connection with our stock-based compensation plans, during the three months ended December 31, 2023, common stock totaling 30,130 shares with an aggregate value of $2.6 million were tendered by employees for payment of applicable statutory tax withholdings. These shares are excluded from the table above.\nDuring the three months ended December 31, 2023, no director or officer of the Company adopted or terminated a “Rule 10b5-1 trading arrangement” or “non-Rule 10b5-1 trading arrangement,” as each term is defined in Item 408(a) of Regulation S-K.",
    "item6": ">Item 6. Selected Financial Data\nNone.",
    "item7": ">Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nThe following discussion should be read in conjunction with the other sections of this \n2023\n 10-K, including the \nSpecial Note on Forward-Looking Statements \nand\n Part I, Item 1A. Risk Factors.\nOVERVIEW\nASGN provides information technology (\"IT\") services and solutions across the commercial and government sectors. ASGN operates through two segments, Commercial and Federal Government. The Commercial Segment, which is the largest segment, provides consulting, creative digital marketing, and permanent placement services primarily to large enterprises and Fortune 1000 companies. The Federal Government Segment provides mission-critical solutions to the Department of Defense, the intelligence community, and federal civilian agencies. Virtually all of the Company's revenues are generated in the United States.\nCritical Accounting Policies and Estimates\nOur financial statements are prepared in conformity with accounting principles generally accepted in the United States (\"GAAP\"), which require us to make certain assumptions and related estimates affecting the amounts reported in the consolidated financial statements. Actual results could differ from those estimates. \nCritical accounting policies are those we believe are both most important to the portrayal of our financial condition and results and require our most difficult, subjective or complex judgments, often because we must make estimates about matters that are inherently uncertain. Judgments and uncertainties affecting the application of those policies may result in materially different amounts being reported under different conditions or using different assumptions. We believe the accounting policies and estimates most critical in understanding the judgments involved in preparing our financial statements are goodwill and acquired intangible assets. \nRecoverability of Goodwill and Acquired Intangible Assets\n — Goodwill is evaluated for impairment annually or more frequently if an event occurs or circumstances change, such as a material deterioration in performance that would indicate an impairment may exist. We perform an annual impairment assessment as of October 31st for each of our reporting units. When evaluating goodwill for impairment, we may first perform a qualitative assessment (“step zero” of the impairment test) to determine whether it is more likely than not that a reporting unit is impaired. If we decide not to perform a qualitative assessment, or if we determine that it is more likely than not the carrying amount of a \nreporting unit exceeds its fair value, then we perform a quantitative assessment (“step one” of the impairment test), and calculate the estimated fair value of the reporting unit. If the carrying amount of the reporting unit exceeds the estimated fair value, an impairment charge would be recorded to reduce the carrying amount to its estimated fair value. \nWe performed a qualitative assessment for the October 31, 2023 annual impairment evaluation for all reporting units. By review of macroeconomic conditions, industry and market conditions, cost factors, overall financial performance compared with prior projections, and other relevant entity-specific events, we determined it was more likely than not that the fair value of each reporting unit exceeded its carrying amount.\nRESULTS OF OPERATIONS FOR THE YEAR ENDED DECEMBER 31, 2023 COMPARED WITH THE YEAR ENDED DECEMBER 31, 2022\nIn this section, we discuss the results of our operations for the year ended December 31, 2023 compared with the year ended December 31, 2022. For a discussion of the year ended December 31, 2022 compared with the year ended December 31, 2021, please refer to \nPart II, Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n in our Annual Report on Form 10-K for the year ended December 31, 2022.\nRevenues\nRevenues for the year were $4.5 billion, down 2.8 percent year-over-year. Revenues in 2023 included approximately $128.0 million from businesses acquired in the prior year through their acquisition date anniversaries. Excluding the contributions from acquisitions, revenues declined 5.6 percent year-over-year. The table below shows our revenues by segment (in millions). \n% of Total \n2023\n2022\nChange\n2023\n2022\nChange\nCommercial:\nAssignment\n$\n2,078.9 \n$\n2,476.1 \n(16.0)\n%\n46.7 \n%\n54.1 \n%\n(7.4)\n%\nConsulting\n1,095.5 \n959.6 \n14.2 \n%\n24.6 \n%\n20.9 \n%\n3.7 \n%\n3,174.4 \n3,435.7 \n(7.6)\n%\n71.3 \n%\n75.0 \n%\n(3.7)\n%\nFederal Government\n1,276.2 \n1,145.4 \n11.4 \n%\n28.7 \n%\n25.0 \n%\n3.7 \n%\nConsolidated\n$\n4,450.6 \n$\n4,581.1 \n(2.8)\n%\n100.0 \n%\n100.0 \n%\nFrom an industry perspective, the Company operates in six broad industry verticals. Commercial Segment revenues (71.3 percent of total revenues) were down 7.6 percent year-over-year and included $53.6 million of revenues from the GlideFast business through its acquisition date anniversary, which was at the beginning of July 2023. Commercial revenues fall into five broad industry verticals: (i) Financial Services, (ii) Consumer and Industrials, (iii) Healthcare, (iv) Technology, Media and Telecom, and (v) Business and Government Services. The Consumer and Industrials industry vertical had low single-digit growth, while the remaining four industry verticals declined year-over-year. Federal Government Segment revenues (28.7 percent of total revenues), the sixth industry vertical, were up 11.4 percent year-over-year and included $74.3 million from Iron Vine through its acquisition date anniversary, which was at the beginning of October 2023. \nTotal IT consulting services revenues were $2.4 billion (53.3 percent of total revenues), up 12.7 percent year-over-year. Federal Government Segment revenues, which are all consulting revenues, were $1.3 billion, up 11.4 percent year-over-year as stated above, and Commercial Segment consulting revenues were $1.1 billion, up 14.2 percent year-over-year. The growth in IT consulting services revenues was offset by a 16.0 percent year-over-year decline in assignment revenues which totaled $2.1 billion (46.7 percent of total revenues), reflecting continued softness in the more discretionary and cyclical portions of the Commercial Segment business. \n \nGross Profit and Gross Margin\nThe table below shows gross profit and gross margin by segment (in millions).\nGross Profit\nGross Margin\n2023\n2022\nChange\n2023\n2022\nChange\nCommercial\n$\n1,017.6 \n$\n1,126.2 \n(9.6)\n%\n32.1 \n%\n32.8 \n%\n(0.7)\n%\nFederal Government\n262.4 \n243.4 \n7.8 \n%\n20.6 \n%\n21.3 \n%\n(0.7)\n%\nConsolidated\n$\n1,280.0 \n$\n1,369.6 \n(6.5)\n%\n28.8 \n%\n29.9 \n%\n(1.1)\n%\nGross profit is comprised of revenues less costs of services, which consist primarily of compensation for our billable professionals, other direct costs, and reimbursable out-of-pocket expenses.\nConsolidated gross profit declined 6.5 percent on revenue decline of 2.8 percent. Gross margin was 28.8 percent, a compression of 110 basis points year-over-year. The compression mainly related to business mix: (i) within the Commercial Segment, a lower mix of certain high-\nmargin assignment revenues, namely, creative digital marketing and permanent placement revenues, which was partially offset by a higher mix of high-margin IT consulting revenues with a year-over-year expansion in margin, and (ii) a higher mix of revenues from the Federal Government Segment, which have a lower gross margin than commercial revenues.\nSelling, General, and Administrative Expenses\nSelling, general, and administrative (\"SG&A\") expenses were $844.2 million (19.0 percent of revenues), compared with $895.0 million (19.5 percent of revenues) in 2022. This improvement was primarily due to lower incentive compensation expense.\nAmortization of Intangible Assets\nAmortization of intangible assets was $71.7 million, up from $65.1 million in 2022. This increase reflects a full year of amortization from businesses acquired in 2022.\n \nInterest Expense\nInterest expense was $66.4 million up from $45.9 million in 2022, primarily as a result of higher interest rates on the senior secured credit facility, and also included $2.3 million of costs related to the August 2023 amendments to the senior secured credit facility. The weighted-average outstanding borrowings and cash-based interest rate were $1.1 billion and 5.9 percent (excluding costs related to the aforementioned amendments) in 2023, and $1.0 billion and 4.1 percent in 2022.\nProvision for Income Taxes\nThe provision for income taxes was $78.4 million, down from $96.7 million in 2022 due to lower income before income taxes. The effective tax rate of 26.3 percent was slightly lower than the effective tax rate of 26.6 percent for 2022. \nIncome from Continuing Operations\nIncome from continuing operations was $219.3 million, down from $266.9 million in 2022.\nIncome from Discontinued Operations\nIncome from discontinued operations was $1.2 million in 2022. \nNet Income\nNet income was $219.3 million in 2023, down from $268.1 million in 2022.\nCommercial Segment - Consulting Metrics\nCommercial consulting bookings are the value of new contracts entered into during a specified period, including adjustments for the effects of changes in contract scope and contract terminations (\"Bookings\"). The underlying contracts are terminable by the client on short notice with little or no termination penalties. Measuring Bookings involves the use of estimates and judgments and there are no independent standards or requirements governing the calculation of bookings. Information regarding Bookings is not comparable to, nor should it be substituted for, an analysis of reported revenues. The book-to-bill ratio for our commercial consulting revenues is the ratio of Bookings to commercial consulting revenues for a specified period. The average duration of commercial consulting projects is one year.\n \nYear Ended December 31,\n(Dollars in millions)\n2023\n2022\n2021\nBookings\n$\n1,351.9 \n$\n1,192.2 \n$\n810.3 \nBook-to-Bill Ratio\n1.2 to 1\n1.2 to 1\n1.3 to 1\nFederal Government Segment Metrics\nContract backlog for our Federal Government Segment represents the estimated amount of future revenues to be recognized under awarded contracts, including task orders and options, at a point in time (\"Contract Backlog\"). These estimates are subject to change and may be affected by the execution of new contracts, the extension or early termination of existing contracts, the non-renewal or completion of current contracts, and adjustments to estimates for previously included contracts. The timing of the execution of new contracts and other changes are affected by the funding cycles of the government and can vary from quarter to quarter. New contract awards are the estimated amount of future revenues to be recognized under contracts awarded during a specified period, including adjustments to estimates for contracts awarded in previous periods (“New Contract Awards”). Information regarding New Contract Awards is not comparable to, nor should it be substituted for, an analysis of reported revenues. Due to variability, New Contract Awards are presented on a trailing-twelve-months (“TTM”) basis. The book-to-bill ratio for our Federal Government Segment is the ratio of New Contract Awards to revenues for a specified period. Contract backlog coverage ratio is calculated as total Contract Backlog divided by TTM revenues.\n17\nYear Ended December 31,\n(Dollars in millions)\n2023\n2022\n2021\nNew Contract Awards\n$\n1,022.2 \n$\n1,073.3 \n$\n1,157.0 \nBook-to-Bill Ratio\n0.8 to 1\n0.9 to 1\n1.1 to 1\nDecember 31,\n(Dollars in millions)\n2023\n2022\n2021\nFunded Contract Backlog\n$\n543.5 \n$\n582.3 \n$\n529.2 \nNegotiated Unfunded Contract Backlog\n2,466.0 \n2,681.2 \n2,472.0 \nContract Backlog\n$\n3,009.5 \n$\n3,263.5 \n$\n3,001.2 \nContract Backlog Coverage Ratio\n2.4 to 1\n2.9 to 1\n2.6 to 1\nLiquidity and Capital Resources\n \nOur working capital, which is current assets less current liabilities, at December 31, 2023 was $579.2 million, and our cash and cash equivalents were $175.9 million. Our cash flows from operating activities have been our primary source of liquidity and have been sufficient to fund our working capital and capital expenditure needs. At December 31, 2023, we had full availability of our $500.0 million revolving credit facility. We believe that our cash and cash equivalents on hand, expected operating cash flows, and availability under our revolving credit facility will be sufficient to fulfill our obligations, working capital requirements, and capital expenditures for the next 12 months.\nNet cash provided by operating activities was $456.9 million in 2023, compared with $307.8 million in 2022. Net cash provided by operating activities before changes in operating assets and liabilities was $400.8 million, compared with $448.5 million in 2022. Changes in operating assets and liabilities resulted in net cash generation of $56.1 million, compared with net cash usage of $140.7 million in 2022. This year-over-year change primarily related to lower accounts receivable due to lower revenues as well as improvement in accounts receivable days sales outstanding (\"DSO\"), compared with 2022 which had increasing accounts receivable due to revenue growth as well as an increase in DSO. \nNet cash used in investing activities in 2023 was $40.5 million and primarily consisted of capital expenditures. In 2022, net cash used in investing activities was $510.0 million and included $484.6 million used to acquire two IT consulting businesses and $37.5 million in capital expenditures. \nNet cash used in financing activities in 2023 was $310.9 million, and primarily consisted of $273.1 million to repurchase the Company's common stock, net repayments of borrowings under the revolving credit facility totaling $31.5 million, a required quarterly principal payment of $1.3 million on the term loan B, as well as the effects of the August 2023 amendments to the Company's senior secured credit facility which generated net proceeds of $8.0 million that were offset by related amendment costs. In 2022, net cash used in financing activities was $256.5 million and primarily consisted of $281.4 million of stock repurchases, as well as net borrowings under the revolving credit facility totaling $31.5 million.\nFor details on the Company’s senior secured credit facility, comprised of a revolving credit facility and term loan B, and unsecured senior notes, see \nNote 9. Long-Term Debt in Item 8. Financial Statements and Supplementary Data.\nCommitments and Contingencies\n \n— The following table sets forth, on an aggregate basis, the amounts of specified contractual cash obligations required to be paid in the future periods shown (in millions): \nContractual Obligations\nLess than 1 year\n1-3 years\n3-5 years\nMore than 5 years\nTotal\nLong-term debt obligations\n(1)\n$\n69.8 \n$\n138.4 \n$\n669.6 \n$\n533.4 \n$\n1,411.2 \nOperating Leases\n(2)\n22.8 \n34.4 \n16.3 \n2.5 \n76.0 \nPurchase obligations\n(3)\n23.2 \n24.4 \n0.1 \n— \n47.7 \n$\n115.8 \n$\n197.2 \n$\n686.0 \n$\n535.9 \n$\n1,534.9 \n_______\n(1)\n Long-term debt obligations include principal payments and estimated interest and fees calculated based on the rates in effect at December 31, 2023.\n(2)  \nRepresents the future minimum lease payments for non-cancelable operating leases.\n(3)  \nPurchase obligations are non-cancelable job board service agreements and software subscriptions, maintenance, and license agreements.\nFor additional information about these contractual cash obligations, see \nNotes 5. Leases, 9. Long-Term Debt \nand\n 10. Commitments and Contingencies\n in \nItem 8.\n \nFinancial Statements and Supplementary Data\n. \n18\nWe have retention policies for our workers’ compensation liability exposures. The workers' compensation loss reserves are based upon an actuarial report obtained from a third party and determined based on claims filed and claims incurred but not reported. We account for claims incurred but not yet reported based on estimates derived from historical claims experience and current trends of industry data. Changes in estimates, differences in estimates, and actual payments for claims are recognized in the period that the estimates changed or the payments were made. The workers' compensation loss reserves were $3.0 million and $2.6 million, net of anticipated insurance and indemnification recoveries of $10.5 million and $10.2 million, at December 31, 2023 and 2022, respectively. We have undrawn stand-by letters of credit outstanding to secure obligations for workers’ compensation claims and other obligations. The undrawn stand-by letters of credit were $3.9 million at December 31, 2023 and 2022.\nWe have a deferred compensation plan liability of $16.6 million and $13.6 million at December 31, 2023 and 2022, which was primarily included in other long-term liabilities. We established a rabbi trust to fund the deferred compensation plan (see \nNote 12. Stock-Based Compensation and Other Employee Benefit Plans \nin \nItem 8.\n \nFinancial Statements and Supplementary Data\n). \nOff-Balance Sheet Arrangements\n \nAs of December 31, 2023, we had no off-balance sheet arrangements.\nAccounting Standards Updates\n \nSee \nNote 3. Accounting Standards Update\n in\n Item 8.\n \nFinancial Statements and Supplementary Data\n for a discussion of new accounting pronouncements. ",
    "item7a": ">Item 7A. Quantitative and Qualitative Disclosures about Market Risk\n \nWe are exposed to certain market risks arising from transactions in the normal course of business, principally risks associated with interest rates. Our exposure to interest rate risk is associated with our debt instruments. See \nNote 9. Long-Term Debt\n in \nItem 8. Financial Statements and Supplementary Data\n for a further description of our debt instruments. A hypothetical 100 basis-point change in interest rates on variable-rate debt would have resulted in interest expense fluctuating approximately $5.0 million based on $498.8 million of debt outstanding for any 12-month period. We have not entered into any market risk sensitive instruments for trading purposes. \n19",
    "item8": ">Item 8. Financial Statements and Supplementary Data\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of ASGN Incorporated\nGlen Allen, Virginia\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of ASGN Incorporated and subsidiaries (the \"Company\") as of December 31, 2023 and 2022, the related consolidated statements of operations and comprehensive income, stockholders' equity, and cash flows, for each of the three years in the period ended December 31, 2023, and the related notes and the financial statement schedule listed in the Index at Item 15(a)(2) (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2023 and 2022, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2023, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2023, based on criteria established in \nInternal Control — Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated February 22, 2024 expressed an unqualified opinion on the Company's internal control over financial reporting.   \nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\n \nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to an account or disclosure that is material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nLong-Term Debt — Senior Secured Credit Facility — Refer to Note 9 to the financial statements\nCritical Audit Matter Description\n \nOn August 31, 2023, the Company entered into an agreement with its lenders amending and restating its senior secured credit facility (the “facility”). The facility refinanced and extended the maturity of the term loan B (“term loan”) and revolving credit facility (the “revolver”). The facility, among other things, increased the borrowings under the term loan to $500.0 million and extended the maturity date to August 31, 2030, and increased the borrowing capacity of the revolver to $500.0 million and extended the maturity date to February 14, 2028. The Company’s accounting for the facility required management to make moderate judgments to determine (1) if the term loan qualified as a debt modification or debt extinguishment, (2) if there were changes to the revolver’s lenders and related borrowing capacity, (3) the related impact upon the accounting treatment of the original remaining deferred financing costs, and the new debt issuance costs and third-party fees, and (4) the identification of and accounting for all terms. \nWe identified the accounting for the facility as a critical audit matter because of management’s moderate judgments to determine whether the facility resulted in a debt modification or a debt extinguishment, including the borrowing capacity analysis, the appropriate treatment of the deferred financing costs and the new debt issuance costs and third-party fees, and the accounting determination for any unusual terms. \nThis required extensive audit effort due to the complexity of the facility and required a high degree of auditor judgment when performing audit procedures to evaluate management’s estimates and judgments and the results of those procedures. Additionally, we involved our specialists in the review of the facility to help identify and account for any unusual terms.\n20\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to management’s judgements used to account for the facility included the following, among others:\n•\nWe tested the effectiveness of controls over the accounting of debt amendments, including management’s control over the appropriate application of GAAP and related analysis. \n•\nWe evaluated management's conclusion regarding the accounting treatment of the facility by performing the following:\n–\nWe obtained and analyzed the executed facility agreement.\n–\nWe obtained and analyzed the Company’s documentation and accounting assessment including its conclusions regarding the appropriate unit of account to use for the evaluation of whether the facility qualified as a debt modification or debt extinguishment, and the related borrowing capacity analysis.\n–\nWe obtained and analyzed the Company’s documentation and accounting assessment including its conclusions reached regarding the appropriate accounting model to apply to the facility for the term loan and the revolver.\n–\nWe obtained and analyzed the Company’s accounting assessment to appropriately record the deferred financing costs and third-party fees related to the facility for the term loan and the revolver. \n–\nWith the assistance of our specialists having experience in accounting for complex debt arrangements, we evaluated whether the facility, including the term loan and the revolver, included unusual terms, and whether management properly assessed and recorded, if necessary, under the appropriate accounting model. \n•\nWe evaluated the Company’s related disclosures to assess their compliance with the applicable accounting standards.\n/s/ \nDELOITTE & TOUCHE LLP\nRichmond, Virginia\nFebruary 22, 2024\nWe have served as the Company's auditor since 1987.\n21\nASGN INCORPORATED AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(In millions, except per share data)\n \n \nDecember 31,\n \n2023\n2022\nASSETS\n \n \nCurrent assets:\n \n \nCash and cash equivalents\n$\n175.9\n \n$\n70.3\n \nAccounts receivable, net\n741.5\n \n853.6\n \nPrepaid expenses and income taxes\n36.8\n \n39.9\n \nOther current assets\n19.1\n \n17.3\n \nTotal current assets\n973.3\n \n981.1\n \nProperty and equipment, net\n81.4\n \n66.3\n \nOperating lease right-of-use assets\n64.2\n \n51.1\n \nIdentifiable intangible assets, net\n497.9\n \n569.6\n \nGoodwill\n1,894.1\n \n1,892.0\n \nOther non-current assets\n33.7\n \n25.6\n \nTotal assets\n$\n3,544.6\n \n$\n3,585.7\n \nLIABILITIES AND STOCKHOLDERS’ EQUITY\n \n \nCurrent liabilities:\n \n \nAccounts payable\n$\n34.0\n \n$\n35.2\n \nAccrued payroll\n236.5\n \n285.1\n \nOperating lease liabilities\n19.5\n \n22.9\n \nOther current liabilities\n104.1\n \n98.7\n \nTotal current liabilities\n394.1\n \n441.9\n \nLong-term debt\n1,036.6\n \n1,066.6\n \nOperating lease liabilities\n49.1\n \n32.3\n \nDeferred income tax liabilities\n156.0\n \n129.2\n \nOther long-term liabilities\n16.7\n \n14.4\n \nTotal liabilities\n1,652.5\n \n1,684.4\n \nCommitments and contingencies (Note 10)\nStockholders’ equity:\n \n \nPreferred stock, $\n0.01\n par value, \n1.0\n million shares authorized, \nno\n shares issued\n—\n \n—\n \nCommon stock, $\n0.01\n par value, \n75.0\n million shares authorized, \n46.7\n million and \n49.5\n million shares outstanding at December 31, 2023 and 2022, respectively\n0.5\n \n0.5\n \nPaid-in capital\n696.0\n \n703.5\n \nRetained earnings\n1,195.6\n \n1,200.0\n \nAccumulated other comprehensive loss\n—\n \n(\n2.7\n)\nTotal stockholders’ equity\n1,892.1\n \n1,901.3\n \nTotal liabilities and stockholders’ equity\n$\n3,544.6\n \n$\n3,585.7\n \nSee notes to consolidated financial statements.\n22\nASGN INCORPORATED AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE INCOME\n(In millions, except per share data)\n \n \nYear Ended December 31,\n \n2023\n2022\n2021\nRevenues\n$\n4,450.6\n \n$\n4,581.1\n \n$\n4,009.5\n \nCosts of services\n3,170.6\n \n3,211.5\n \n2,867.1\n \nGross profit\n1,280.0\n \n1,369.6\n \n1,142.4\n \nSelling, general, and administrative expenses\n844.2\n \n895.0\n \n735.8\n \nAmortization of intangible assets\n71.7\n \n65.1\n \n55.7\n \nOperating income\n364.1\n \n409.5\n \n350.9\n \nInterest expense\n(\n66.4\n)\n(\n45.9\n)\n(\n37.5\n)\nIncome before income taxes\n297.7\n \n363.6\n \n313.4\n \nProvision for income taxes\n78.4\n \n96.7\n \n81.6\n \nIncome from continuing operations\n219.3\n \n266.9\n \n231.8\n \nIncome from discontinued operations, net of income taxes\n— \n1.2\n \n178.1\n \nNet income\n$\n219.3\n \n$\n268.1\n \n$\n409.9\n \n \n \n \nEarnings per share:\nBasic —\nContinuing operations\n$\n4.54\n \n$\n5.27\n \n$\n4.40\n \nDiscontinued operations\n—\n \n0.03\n \n3.38\n \n$\n4.54\n \n$\n5.30\n \n$\n7.78\n \nDiluted —\nContinuing operations\n$\n4.50\n \n$\n5.21\n \n$\n4.33\n \nDiscontinued operations\n—\n \n0.02\n \n3.33\n \n$\n4.50\n \n$\n5.23\n \n$\n7.66\n \nShares and share equivalents used to calculate earnings per share:\n \n \n \nBasic\n48.3\n \n50.6\n \n52.7\n \nDiluted\n48.7\n \n51.3\n \n53.5\n \nReconciliation of net income to comprehensive income:\nNet income\n$\n219.3\n \n$\n268.1\n \n$\n409.9\n \nForeign currency translation adjustment\n2.7\n \n(\n2.4\n)\n0.7\n \nComprehensive income\n$\n222.0\n \n$\n265.7\n \n$\n410.6\n \nSee notes to consolidated financial statements.\n23\nASGN INCORPORATED AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\n(In millions)\n \nCommon Stock\nPaid-in Capital\nRetained Earnings\nOther\nTotal\n \nShares\nPar Value\nBalance at December 31, 2020\n52.9\n \n$\n0.5\n \n$\n661.3\n \n$\n926.3\n \n$\n(\n1.0\n)\n$\n1,587.1\n \nStock-based compensation expense\n— \n— \n52.7\n \n— \n— \n52.7\n \nIssuances under equity plans\n0.5\n \n—\n \n14.3\n \n— \n— \n14.3\n \nTax withholding on restricted stock vesting\n—\n \n— \n(\n16.0\n)\n— \n— \n(\n16.0\n)\nStock repurchase and retirement of shares\n(\n1.6\n)\n— \n(\n21.5\n)\n(\n161.8\n)\n— \n(\n183.3\n)\nOther\n— \n— \n— \n— \n0.7\n \n0.7\n \nNet income\n— \n— \n— \n409.9\n \n— \n409.9\n \nBalance at December 31, 2021\n51.8\n \n0.5\n \n690.8\n \n1,174.4\n \n(\n0.3\n)\n1,865.4\n \nStock-based compensation expense\n— \n— \n49.3\n \n— \n— \n49.3\n \nIssuances under equity plans\n0.5\n \n—\n \n18.9\n \n— \n— \n18.9\n \nTax withholding on restricted stock vesting\n—\n \n— \n(\n16.6\n)\n— \n— \n(\n16.6\n)\nStock repurchase and retirement of shares\n(\n2.8\n)\n—\n \n(\n38.9\n)\n(\n242.5\n)\n— \n(\n281.4\n)\nOther \n— \n— \n— \n— \n(\n2.4\n)\n(\n2.4\n)\nNet income\n— \n— \n— \n268.1\n \n— \n268.1\n \nBalance at December 31, 2022\n49.5\n \n0.5\n \n703.5\n \n1,200.0\n \n(\n2.7\n)\n1,901.3\n \nStock-based compensation expense\n— \n— \n44.0\n \n— \n— \n44.0\n \nIssuances under equity plans\n0.6\n \n—\n \n18.8\n \n— \n— \n18.8\n \nTax withholding on restricted stock vesting\n—\n \n— \n(\n18.3\n)\n— \n— \n(\n18.3\n)\nStock repurchase and retirement of shares\n(\n3.4\n)\n—\n \n(\n52.0\n)\n(\n223.7\n)\n— \n(\n275.7\n)\nOther\n— \n— \n— \n— \n2.7\n \n2.7\n \nNet income\n— \n— \n— \n219.3\n \n— \n219.3\n \nBalance at December 31, 2023\n46.7\n \n$\n0.5\n \n$\n696.0\n \n$\n1,195.6\n \n$\n—\n \n$\n1,892.1\n \nSee notes to consolidated financial statements.\n24\nASGN INCORPORATED AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In millions)\n \n Year Ended December 31,\n \n2023\n2022\n2021\nCash Flows from Operating Activities\n \n \n \nNet income\n$\n219.3\n \n$\n268.1\n \n$\n409.9\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nGain on sale of discontinued operations\n—\n \n—\n \n(\n216.9\n)\nAmortization and depreciation\n100.3\n \n91.4\n \n89.6\n \nStock-based compensation\n44.0\n \n49.3\n \n52.7\n \nDeferred income taxes\n26.9\n \n31.5\n \n(\n19.7\n)\nOther\n10.3\n \n8.2\n \n6.3\n \nChanges in operating assets and liabilities, net of effects of acquisitions:\n \n \nAccounts receivable\n111.0\n \n(\n116.3\n)\n(\n111.1\n)\nPrepaid expenses and income taxes\n3.3\n \n2.0\n \n(\n18.2\n)\nAccounts payable\n(\n2.4\n)\n7.6\n \n(\n23.6\n)\nAccrued payroll\n(\n49.4\n)\n11.3\n \n67.4\n \nPayroll tax deferral and other\n(\n6.4\n)\n(\n45.3\n)\n(\n42.7\n)\nNet cash provided by operating activities\n456.9\n \n307.8\n \n193.7\n \nCash Flows from Investing Activities\n \n \n \nCash paid for property and equipment\n(\n39.9\n)\n(\n37.5\n)\n(\n34.7\n)\nCash paid for acquisitions, net of cash acquired\n—\n \n(\n484.6\n)\n(\n222.8\n)\nCash received from sale of the Oxford business\n—\n \n9.8\n \n503.8\n \nOther\n(\n0.6\n)\n2.3\n \n0.2\n \nNet cash provided by (used in) investing activities\n(\n40.5\n)\n(\n510.0\n)\n246.5\n \nCash Flows from Financing Activities\n \n \n \nProceeds from long-term debt\n571.8\n \n94.0\n \n—\n \nPrincipal payments of long-term debt\n(\n596.6\n)\n(\n62.5\n)\n—\n \nProceeds from employee stock purchase plan\n18.9\n \n18.9\n \n14.3\n \nRepurchase of common stock\n(\n273.1\n)\n(\n281.4\n)\n(\n181.3\n)\nPayment of employment taxes related to release of restricted stock awards\n(\n18.3\n)\n(\n16.6\n)\n(\n16.0\n)\nPayment of contingent consideration\n(\n5.0\n)\n(\n8.1\n)\n—\n \nDebt issuance or amendment costs\n(\n8.6\n)\n(\n0.8\n)\n(\n1.4\n)\nNet cash used in financing activities\n(\n310.9\n)\n(\n256.5\n)\n(\n184.4\n)\nEffect of exchange rate changes on cash and cash equivalents\n0.1\n \n(\n0.6\n)\n(\n0.6\n)\nNet Increase (Decrease) in Cash and Cash Equivalents\n105.6\n \n(\n459.3\n)\n255.2\n \nCash and Cash Equivalents at Beginning of Year\n70.3\n \n529.6\n \n274.4\n \nCash and Cash Equivalents at End of Year\n$\n175.9\n \n$\n70.3\n \n$\n529.6\n \nSupplemental Disclosure of Cash Flow Information\nCash paid for \n—\nIncome taxes\n$\n44.8\n \n$\n54.5\n \n$\n170.3\n \nInterest\n$\n62.1\n \n$\n43.7\n \n$\n35.2\n \n \nSee notes to consolidated financial statements.\n25\nASGN INCORPORATED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n \n1. General\nBasis of Presentation\n — The accompanying consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (\"GAAP\") and the rules of the Securities and Exchange Commission (\"SEC\"). The consolidated financial statements include the accounts of ASGN Incorporated and its wholly-owned subsidiaries (\"ASGN\" or the \"Company\"). The results of operations for acquired companies are included in the consolidated results of the Company from the date of acquisition (see \nNote 6. Acquisitions\n).\n All intercompany accounts and transactions have been eliminated.\n \nUse of Estimates —\n The preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Those estimates determined to be most critical to the preparation of the financial statements are discussed below in \nNote 2. Summary of Significant Accounting Policies.\n Actual results could differ from those estimates.\n2. Summary of Significant Accounting Policies\nRe\nvenue Recognition\n \n—\n \nRevenues are recognized as control of the promised service is transferred to customers, in an amount that reflects the consideration expected in exchange for the services. The Company recognizes revenues on a gross basis as it acts as a principal for all of its revenue transactions. The Company has direct contractual relationships with its customers, bears the risks and rewards of its arrangements, has the discretion to select the billable professionals, and establish the price for the services to be provided. \nThe majority of the Company's services are provided under time-and-materials (\"T&M\") contracts where payments are based on fixed hourly rates for each direct labor hour expended and reimbursements for allowable material costs and out-of-pocket expenses. Revenues for T&M contracts are recognized over time, based on hours worked, because the customer simultaneously receives and consumes the benefits as services are provided. Generally, the performance of the requested service over time is a single performance obligation. To the extent actual direct labor and associated costs vary in relation to the agreed upon billing rates, the generated profit may vary. \nThe Federal Government Segment also provides services under cost reimbursable and firm-fixed-price (\"FFP\") contracts, which are recognized over time based on the amount invoiced as those amounts directly correspond with the value received by a customer. Generally, these contracts contain a single performance obligation involving a significant integration of various activities that are performed together to deliver a combined service or solution. Cost reimbursable contracts are usually subject to lower risk and tend to have lower margins. From time to time, the Company may have FFP contracts in which revenues are recognized using a cost-to-cost measurement method.\nUnder certain commercial contracts, customers may receive discounts (e.g., volume discounts, rebates, prompt-pay discounts) and adjustments to the amounts billed, which are considered variable consideration. Volume discounts are the largest component of variable consideration and are estimated using (i) the most likely amount method; (ii) contract terms; and (iii) estimates of revenue. Revenues are recognized net of variable consideration to the extent it is probable a significant reversal of revenues will not occur in subsequent periods. The Company includes billable expenses (allowable material costs and out-of-pocket reimbursable expenses) in revenues and the associated expenses are included in costs of services.\nThere are no incremental contract costs to obtain contracts. Contract fulfillment costs include, but are not limited to, direct labor for both employees and subcontractors, allowable materials such as third-party hardware and software that are integrated as part of the overall services and solutions provided to customers, and out-of-pocket reimbursable expenses. Contract fulfillment costs are expensed as incurred, except for certain set-up costs for a federal government project, which were capitalized and are being amortized over the expected period of benefit.\nThe Company’s contracts have termination for convenience provisions and do not have substantive termination penalties. Therefore, the contract duration for accounting purposes may be less than the stated terms. For accounting purposes, the Company's contracts with customers are considered to be of a short-term nature (one year or less). The Company does not disclose the value of remaining performance obligations for short-term contracts.\nThe Company has contract liabilities for payments received in advance of providing services under certain contracts. Contract liabilities for advance payments were $\n16.8\n million and $\n16.1\n million at December 31, 2023 and 2022, respectively. Contract liabilities are included in other current liabilities in the accompanying consolidated balance sheets and are generally recognized as revenues within three months from the balance sheet date. \nPayment terms vary and the time between invoicing and when payment is due is not significant. There are no financing components to the Company’s arrangements.\n \nCosts of Services —\n Costs of services include direct costs consisting primarily of payroll, payroll taxes, and benefit costs for the Company’s billable professionals. Costs of services also include other direct costs, and reimbursable out-of-pocket expenses.\n \nStock-Based Compensation —\n Stock-based compensation expense is measured based on the grant-date fair value of the respective awards and recognized over the requisite service period, net of an estimated forfeiture rate.\n \n26\nAmortization of Finite-Lived Intangible Assets — \nFinite-lived intangible assets are amortized over their useful lives and are tested for recoverability whenever events or changes in circumstances indicate that the carrying amount may not be recoverable. Customer and contractual relationships and contract backlog are amortized based on the annual cash flows observed in the valuation of the asset, which generally accelerates the amortization into the earlier years reflective of the economic life of the asset. Contractor relationships and non-compete agreements are amortized using the straight-line method.\n \nIncome Taxes — \nIncome taxes are accounted for using the liability method. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. Deferred tax assets are reduced by a valuation allowance if it is more likely than not that a portion of the deferred tax asset will not be realized.\nThe Company reviews its uncertain tax positions regularly. An uncertain tax position represents the Company’s expected treatment of a tax position taken in a filed return, or planned to be taken in a future tax return or claim that has not been reflected in measuring income tax expense for financial reporting purposes. The Company recognizes the tax benefit from an uncertain tax position when it is more-likely-than-not that the position will be sustained upon examination on the basis of the technical merits or the statute of limitations for the relevant taxing authority to examine and challenge the tax position has expired.\nForeign Currency Translation —\n The functional currency of the Company’s foreign operations is their local currency. Assets and liabilities are translated into U.S. dollars at the rate of exchange in effect on the balance sheet date. Revenues and expenses are translated at the average rates of exchange prevailing during each monthly period. The related translation adjustments are recorded as cumulative foreign currency translation adjustments in accumulated other comprehensive (loss) income as a separate component of stockholders’ equity.\n \nCash and Cash Equivalents —\n The Company considers all highly-liquid investments with original maturities of three months or less to be cash equivalents.\n \nAccounts Receivable Allowances — \nThe Company estimates an allowance for expected credit losses (the inability of customers to make required payments). These estimates are based on (i) a combination of past experience and current trends, (ii) consideration of the current aging of receivables, and (iii) a specific review for potential bad debts. The resulting bad debt expense is included in in selling, general, and administrative (\"SG&A\") expenses  in the accompanying consolidated statements of operations and comprehensive income. Receivables are written off when deemed uncollectible.\n \nThe accounts receivable allowance was $\n4.0\n million at December 31, 2023 and 2022.\n \nCloud Computing Arrangements\n — The Company has cloud computing arrangements which are accounted for as service contracts as the Company does not have the ability to take possession of the software nor can the Company run the software on its own hardware or contract with another party unrelated to the vendor to host the software. These cloud-based applications are used to enhance the capabilities of the Company's operating technology infrastructure. The Company capitalizes costs associated with the implementation of these cloud computing arrangements incurred during the application development stage of a project. Amortization is calculated on a straight-line basis and is included in SG&A expenses in the accompanying consolidated statements of operations and comprehensive income and was insignificant in 2023.\nLeases — \nThe Company has operating leases for corporate offices, branch offices, and data centers, which have lease terms ranging from \none year\n to \n12.6\n years. At the inception of a contract, the Company determines if the contract contains a lease. A contract contains a lease if it conveys the right to control the use of an identified asset for a period of time in exchange for consideration. Operating lease ROU assets and lease liabilities are recognized at the lease commencement date, based on the present value of the future minimum lease payments. The Company’s leases do not provide an implicit rate of return. Therefore, the Company uses its incremental borrowing rate (\"IBR\") in determining the present value of lease payments. In determining the IBR, the Company considers its credit rating and the current market interest rates. The IBR approximates the interest rate the Company would pay on collateralized debt with similar terms and payments as the lease agreements and in a similar economic environment where the leased assets are located. Leases with an initial term of 12 months or less are not recorded on the balance sheet. The Company does not have finance leases.\nLease expense is recognized on a straight-line basis over the lease term and is primarily included in SG&A expenses in the accompanying consolidated statements of operations and comprehensive income. Some lease agreements offer renewal options, which are assessed against relevant economic factors to determine whether it is reasonably certain that these renewal options will be exercised. As a result of this assessment, for most leases, renewal options were excluded from the minimum lease payments when calculating the operating lease assets and liabilities, as the Company does not consider the exercise of such options to be reasonably certain. \nThe Company has lease agreements with lease and non-lease components, which are accounted for as a single lease component for all underlying asset classes. Some leases require variable payments for common area maintenance, property taxes, parking, insurance, and other variable costs. The variable portion of lease payments is not included in operating lease assets or liabilities. Variable lease costs are expensed when incurred.\n \nProperty and Equipment —\n Property and equipment are stated at cost. Depreciation and amortization are provided using the straight-line method over the estimated useful lives of the related assets, generally \nthree\n to \nfive years\n. Leasehold improvements are amortized over the shorter of the life of the related asset or the remaining term of the lease. Costs associated with customized internal-use software systems that \n27\nhave reached the application development stage and meet recoverability tests are capitalized and include external direct costs utilized in developing or obtaining the applications and payroll and payroll-related expenses for employees who are directly associated with the application development.\nImpairment or Disposal of Long-Lived Assets —\n The Company evaluates long-lived assets, other than goodwill and identifiable intangible assets with indefinite lives, for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. An impairment loss is recognized when the sum of the undiscounted future cash flows is less than the carrying amount of the asset, in which case a write-down is recorded to reduce the related asset to its estimated fair value. There were no significant impairments of long-lived assets in \n2023\n, 2022 and 2021.\nRecognition of Goodwill and Acquired Intangible Assets — \nAt the acquisition date, the Company records all tangible and intangible assets acquired and liabilities assumed in a business combination at fair value, the most significant of which would be goodwill and acquired intangible assets. Acquisition-date fair value represents the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants as measured on the acquisition date. Fair values were derived from valuations based on information that existed as of the acquisition date. The fair value assigned to identifiable intangible assets is primarily determined using estimates including future cash flows, discount rates, royalty rates, and income tax rates utilized in a discounted cash flow model, which is a non-recurring fair value measurement based on unobservable inputs (Level 3 inputs). Acquired identified intangible assets typically include customer and contractual relationships, contractor relationships, contract backlog, non-compete agreements, and trademarks. In an acquisition, the excess amount of the purchase consideration paid over the fair value of the net assets acquired and liabilities assumed is recorded as goodwill. Goodwill represents the acquired assembled workforce, potential new customers, and future cash flows after the acquisition. During the measurement period, which does not exceed one year from the acquisition date, provisional amounts may be adjusted to reflect new information the Company has subsequently obtained regarding facts and circumstances that existed as of the acquisition date. Such fair value assessments require judgments and estimates, which may cause final amounts to differ materially from original estimates.\nRecoverability of Goodwill and Acquired Intangible Assets\n \n— \nGoodwill is evaluated for impairment annually, or more frequently if an event occurs or circumstances change, including but not limited to a significant decrease in expected revenues or cash flows; an adverse change in the business environment, regulatory environment or legal factors; or a substantial sustained decline in the market capitalization of our stock. Goodwill is tested at the reporting unit level, which is generally an operating segment or one level below the operating segment level, where a business operates and for which discrete financial information is available and reviewed by segment management. The Company performs its annual impairment assessment as of October 31\nst \nfor each of its reporting units. When evaluating goodwill for impairment, the Company may first perform a qualitative assessment to determine whether it is more likely than not that a reporting unit is impaired. If the Company decides not to perform a qualitative assessment, or if it determines that it is more likely than not that the carrying amount of a reporting unit exceeds its fair value, a quantitative assessment is performed to determine the estimated fair value of the reporting unit. If the carrying amount of the reporting unit exceeds the estimated fair value, an impairment charge is recorded to reduce the carrying amount to its estimated fair value. The decision to perform a qualitative impairment assessment in a given year is influenced by a number of factors including: (i) the significance of the excess of the reporting units’ estimated fair value over carrying amount at the last quantitative assessment date; (ii) the amount of time between quantitative fair value assessments; and (iii) the date of acquisition. \nThe Company's only indefinite-lived intangible assets are trademarks. The Company performs its annual impairment assessment for its trademarks as of October 31\nst\n. A qualitative assessment is performed for trademarks to determine if there are any indicators that the carrying amount might not be recovered. A quantitative analysis may be performed in order to test the trademarks for impairment. If a quantitative analysis is necessary, an income approach, specifically a relief-from-royalty method, is used to estimate the fair value of the trademarks. The estimated fair value of each trademark is compared with its carrying amount to determine if impairment exists. If the carrying amount of a trademark exceeds the estimated fair value, an impairment charge would be recorded to reduce the carrying amount of the trademark.\nThe Company performed a qualitative assessment for the October 31, 2023 annual impairment test for all of its reporting units and trademarks. The Company determined there were no indicators of impairment and it was more likely than not that the fair value of each of the three reporting units, and the trademarks, exceeded their respective carrying amounts by reviewing (i) macroeconomic, industry and market conditions; (ii) cost factors; (iii) overall financial performance compared with prior projections; (iv) the excess of fair value over carrying value as of the  most recent quantitative assessment performed; and (v) other relevant entity-specific events.\n \nWorkers’ Compensation Loss Reserves —\n The Company carries retention policies for its workers’ compensation liability exposures. Under these policies, the Company pays a base premium plus actual losses incurred, not to exceed certain stop-loss limits. The Company is insured for losses above these limits. The Company estimates its workers' compensation loss reserves based on a third-party actuarial study based on claims filed and claims incurred but not reported. The Company accounts for claims incurred but not yet reported based on estimates derived from historical claims experience and current trends of industry data. Changes in estimates, differences in estimates, and actual payments for claims are recognized in the period when the estimate changed or the payment was made.\nContingencies —\n The Company records an estimated loss from a loss contingency when information available prior to issuance of its financial statements indicates it is probable that an asset has been impaired or a liability has been incurred at the date of the financial statements and the amount of the loss can be reasonably estimated. Accounting for contingencies, such as legal settlements and workers’ compensation matters, requires the Company to use judgment.\n \nConcentration of Credit Risk —\n Financial instruments that potentially subject the Company to credit risks consist primarily of cash and cash equivalents and trade receivables. The Company places its cash and cash equivalents with high-quality financial institutions. Concentration of \n28\ncredit risk with respect to accounts receivable for the Commercial Segment is limited because of the large number of clients and their dispersion across different industries and geographies, thus spreading the trade credit risk. The Company performs ongoing credit evaluations to identify risks and maintains an allowance to address these risks. Accounts receivables for the Federal Government Segment are primarily from the U.S. government and are considered to have low credit risk.\nEarnings per Share\n \n— \nBasic earnings per share are computed using the weighted-average number of shares outstanding and diluted earnings per share are computed using the weighted-average number of shares and dilutive share equivalents (consisting of restricted stock units and employee stock purchase plan contributions) outstanding during the periods using the treasury-stock method.\n \n3. Accounting Standards Update\nIn November 2023, the Financial Accounting Standards Board (\"FASB\") issued Accounting Standards Update (\"ASU\") No. 2023-07, Segment Reporting (Topic 280) Improvements to Reportable Segment Disclosures, which requires disclosure of significant segment expenses and other segment items on an annual and interim basis and provide in interim periods all disclosures about a reportable segment’s profit or loss and assets that are currently required annually. Additionally, it requires disclosure of the title and position of the Chief Operating Decision Maker. The new standard is effective for fiscal years beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024. The Company expects this ASU to only impact its disclosures with no effect on results of operations, cash flows, and financial condition.\nIn December 2023, the FASB issued ASU No. 2023-09, Income Taxes (Topic 740) Improvements to Income Tax Disclosures, which requires (i) a tabular tax rate reconciliation using specified categories and presenting both percentages and amounts, and (ii) disclosure of income taxes paid disaggregated by jurisdiction if the amount is above a specified threshold. The new standard is effective for annual periods beginning after December 15, 2024. The Company expects this ASU to only impact its disclosures with no effect on results of operations, cash flows, and financial condition.\n4. Discontinued Operations\nOn August 17, 2021, the Company sold its Oxford business to an affiliate of H.I.G. Capital for $\n525.0\n million. The gain on the sale was $\n216.9\n million ($\n168.8\n million net of income taxes). The sale of the Oxford business was a strategic shift that provided for the redeployment of capital on acquisitions of businesses that enhance the Company's IT consulting capabilities and services in the commercial and federal government sectors. As a result of the sale, the financial results of the Oxford business are reported as discontinued operations in the accompanying consolidated statements of operations and comprehensive income. The Company's reporting segments were retrospectively changed in 2021 for the effects of the sale.\nThere were no significant operating results from discontinued operations in 2023 and 2022. The following table summarizes the results of operations of the Oxford business that are reported as discontinued operations (in millions).\nYear Ended December 31,\n2021\nRevenues\n$\n324.3\n \nCosts of services\n223.0\n \nGross profit\n101.3\n \nSelling, general, and administrative expenses\n90.1\n \nAmortization of intangible assets\n0.4\n \nIncome before income taxes\n10.8\n \nProvision for income taxes\n1.5\n \nGain on sale, net of income taxes\n168.8\n \nIncome from discontinued operations, net of income taxes\n$\n178.1\n \n29\nDuring 2022, the Company received $\n9.8\n million cash related to the finalization of the purchase price. The following table provides select cash flow information related to the Oxford business (in millions):\nYear Ended December 31,\n2021\nNet cash provided by (used in) operating activities\n$\n(\n84.0\n)\nNet cash provided by (used in) investing activities\n   Cash received from sale of discontinued operations\n503.8\n \n   Other\n(\n3.9\n)\n$\n499.9\n \n    \n5. Leases\nThe Company has operating leases for corporate offices, branch offices, and data centers. The following table includes certain information about these leases (dollars in millions).\nYear Ended December 31, \n2023\n2022\n2021\nComponents of lease expense  \n—\nOperating lease expense\n$\n26.1\n \n$\n25.4\n \n$\n26.9\n \nShort-term lease expense\n7.5\n \n6.9\n \n5.4\n \nVariable lease expense\n5.7\n \n4.8\n \n5.1\n \n$\n39.3\n \n$\n37.1\n \n$\n37.4\n \nWeighted-average remaining lease term of operating leases\n3.9\n years\n3.1\n years\n3.2\n years\nWeighted-average discount rate of operating leases\n5.03\n \n%\n3.67\n \n%\n3.47\n \n%\nSupplemental cash flow information  \n—\nCash paid for operating lease liabilities\n$\n26.3\n$\n28.3\n$\n29.1\nRight-of-use assets obtained with lease liabilities\n$\n36.3\n$\n15.6\n$\n10.8\n \nFuture maturities of operating lease liabilities are as follows (in millions): \n2024\n$\n22.8\n \n2025\n19.3\n \n2026\n15.1\n \n2027\n10.5\n \n2028\n5.8\n \nThereafter\n2.5\n \nTotal future minimum lease payments \n76.0\n \nLess: imputed interest \n7.4\n \n$\n68.6\n \n30\n6. Acquisitions\nThe following is a summary of the Company's acquisitions (in millions).\nYear Ended December 31,\n2022\n2021\nNumber of businesses acquired\nTwo\nThree\nStatus of purchase accounting\nClosed\nClosed\nAggregate purchase price\n$\n483.0\n \n$\n221.3\n \n___\nGenerally, working capital adjustments and contingent consideration account for the difference between the aggregate purchase price and cash paid, net of cash acquired in the accompanying statements of cash flows.\nDuring 2022, the Company increased its investment in IT consulting through the acquisition of two businesses. On July 6\nth\n, the Company acquired GlideFast Consulting (\"GlideFast\") for $\n350.0\n million in cash. GlideFast is part of the Commercial Segment. The preliminary fair value of the identifiable intangible assets related to this acquisition totaled $\n102.8\n million, including a trademark of $\n30.2\n million which has an indefinite life, and the remaining intangible assets have a weighted-average useful life of six years. On October 3\nrd\n, the Company acquired Iron Vine Security, which is included in the Federal Government Segment.\nNone of the acquisitions in the periods presented were material individually or in the aggregate; therefore, we did not present any pro forma results for these acquisitions.\n \n7. Goodwill and Other Identifiable Intangible Assets\n \nThe following table summarizes the activity related to the carrying amount of goodwill by reportable segment since December 31, \n2021\n (in millions).  See \nNote 15. Segment Reporting\n for more information on the Company's reportable segments.\nCommercial\nFederal Government\nTotal\nBalance as of December 31, 2021\n$\n829.3\n \n$\n740.2\n \n$\n1,569.5\n \n2022 acquisitions\n246.4\n \n85.5\n \n331.9\n \nPurchase price adjustment\n0.4\n \n(\n8.5\n)\n(\n8.1\n)\nTranslation adjustment\n(\n1.4\n)\n—\n \n(\n1.4\n)\nBalance as of December 31, 2022\n1,074.7\n \n817.2\n \n1,891.9\n \nPurchase price adjustment\n—\n \n1.1\n \n1.1\n \nTranslation adjustment\n1.1\n \n—\n \n1.1\n \nBalance as of December 31, 2023\n$\n1,075.8\n \n$\n818.3\n \n$\n1,894.1\n \n___________________\nApproximately $\n250.7\n million of the goodwill for the 2022 acquisitions is deductible for income tax purposes.\n31\nAcquired intangible assets consisted of the following (in millions):\n \n \nDecember 31, 2023\nDecember 31, 2022\n \nEstimated Useful Life (in years)\nGross Carrying Amount\nAccumulated Amortization\nNet Carrying Amount\nGross Carrying Amount\nAccumulated Amortization\nNet Carrying Amount\nSubject to amortization:\n \n \n \n \n \nCustomer and contractual relationships\n7\n - \n13\n$\n496.0\n \n$\n282.0\n \n$\n214.0\n \n$\n589.3\n \n$\n315.7\n \n$\n273.6\n \nContract Backlog\n1\n - \n3\n—\n \n—\n \n—\n \n44.1\n \n36.5\n \n7.6\n \nNon-compete agreements\n2\n - \n7\n29.3\n \n18.2\n \n11.1\n \n41.2\n \n25.6\n \n15.6\n \n \n \n525.3\n \n300.2\n \n225.1\n \n674.6\n \n377.8\n \n296.8\n \nNot subject to amortization:\n \n \n \n \n \nTrademarks\n272.8\n \n— \n272.8\n \n272.8\n \n— \n272.8\n \n \n$\n798.1\n \n$\n300.2\n \n$\n497.9\n \n$\n947.4\n \n$\n377.8\n \n$\n569.6\n \nThe Company removed gross and accumulated amortization balances related to intangible assets that are fully amortized as of  December 31, 2023.\nEstimated future amortization expense is as follows (in millions):\n2024\n$\n58.1\n \n2025\n48.8\n \n2026\n41.8\n \n2027\n32.0\n \n2028\n21.2\n \nThereafter\n23.2\n \n$\n225.1\n \n8. Property and Equipment\n \nNet property and equipment consisted of the following (in millions):\nDecember 31,\n \n2023\n2022\nComputer hardware and software\n$\n180.5\n \n$\n201.3\n \nFurniture, fixtures and equipment\n29.6\n \n27.9\n \nLeasehold improvements\n27.0\n \n27.0\n \nWork-in-progress\n6.5\n \n7.4\n \n \n243.6\n \n263.6\n \nLess: accumulated depreciation\n(\n162.2\n)\n(\n197.3\n)\n$\n81.4\n \n$\n66.3\n \nThe Company has capitalized costs related to its various technology initiatives. At December 31, 2023, the net book value of computer software was $\n44.5\n million, which included work-in-progress of $\n4.7\n million. At December 31, 2022, the net book value of computer software was $\n35.8\n million, which included work-in-progress of $\n7.3\n million.\nThe following table summarizes the presentation of depreciation expense within the accompanying consolidated statements of operations and comprehensive income (in millions).\n \nYear Ended December 31,\n \n2023\n2022\n2021\nSelling, general, and administrative expenses\n$\n26.5\n \n$\n25.3\n \n$\n23.4\n \nCosts of services\n1.4\n \n1.0\n \n4.6\n \n$\n27.9\n \n$\n26.3\n \n$\n28.0\n \n32\n9. Long-Term Debt\n \nLong-term debt consisted of the following (in millions):\nDecember 31,\n2023\n2022\nSenior Secured Credit Facility:\nRevolving credit facility\n$\n—\n \n$\n31.5\n \nTerm loan B\n498.8\n \n490.8\n \nUnsecured Senior Notes\n550.0\n \n550.0\n \n1,048.8\n \n1,072.3\n \nUnamortized deferred loan costs\n(\n7.2\n)\n(\n5.7\n)\nTerm loan B, principal payments due in the next 12 months\n(\n5.0\n)\n—\n \n$\n1,036.6\n \n$\n1,066.6\n \n__________\nIn connection with the amendments described below, the Company is required to make quarterly minimum principal payments totaling $\n5.0\n million annually on the term loan until its maturity date; this amount is included in other current liabilities on the accompanying consolidated balance sheet as of December 31, 2023. Taking into consideration the $\n5.0\n million annual required principal payments, the balance due at maturity will be $466.3 million.\nSenior Secured Credit Facility —\n In August 2023, the Company amended its senior secured credit facility (the \"facility\") to extend the maturity date of the term loan B (\"term loan\") to August 2030 and the maturity date of the revolving credit facility (the \"revolver\") to February 2028 and increased the borrowing capacity of the revolver to $\n500.0\n million. Related to the debt amendment there were $\n9.8 million\n of costs, comprised of $\n1.2\n million original issue discount and $\n8.6\n million in debt amendment costs. The Company accounted for the debt amendment as a modification and accordingly, $\n6.7\n million of the debt amendment costs were capitalized and will be amortized over the remaining life of the facility and $\n1.9\n million was expensed as incurred. There was an insignificant amount of previously capitalized costs that were written-off. Borrowings under the $\n498.8\n million term loan bear interest, at the Company's election, at (i) the secured overnight financing rate (\"SOFR\") plus \n2.25\n percent, or (ii) the bank’s base rate plus \n1.25\n percent. Borrowings under the revolver bear interest, at the Company's election, at (i) SOFR plus a 10 basis points adjustment plus \n2.00\n to \n3.00\n percent, or (ii) the bank’s base rate plus \n1.00\n to \n2.00\n percent, depending on leverage levels. A commitment fee of \n0.30\n to \n0.45\n percent is payable on the undrawn portion of the revolver. The facility is subject to various restrictive covenants including, when amounts are drawn under the revolver, a maximum ratio of senior secured debt to trailing-twelve-months of lender-defined consolidated EBITDA of \n3.75\n to 1, which was \n0.96\n to 1 at December 31, 2023. The facility is secured by substantially all of the Company's assets and at December 31, 2023, the Company was in compliance with its debt covenants.\nUnsecured Senior Notes \n— The Company has $\n550.0\n million of unsecured senior notes, due in 2028, which bear interest at \n4.625\n percent payable semiannually in arrears on May 15 and November 15. These notes are unsecured obligations and are subordinate to the senior secured credit facility. These notes also contain certain customary limitations including, the Company's ability to incur additional indebtedness, engage in mergers and acquisitions, transfer or sell assets, and make certain distributions.\n \n10. Commitments and Contingencies\n \nPurchase Obligations\n — The Company's purchase obligations include non-cancelable job board service agreements, software maintenance and license agreements and software subscriptions. \nThe following is a summary of these obligations as of December 31, 2023, which excludes lease liabilities and other current liabilities that are included in the accompanying consolidated balance sheets (in millions):\n2024\n$\n23.2\n \n2025\n20.2\n \n2026\n4.2\n \n2027\n$\n0.1\n \n$\n47.7\n \n \nOther Commitments\n — The workers' compensation loss reserves were $\n3.0\n million and $\n2.6\n million, net of anticipated insurance and indemnification recoveries of $\n10.5\n million and $\n10.2\n million, at December 31, 2023 and 2022, respectively. To secure obligations for workers’ compensation claims and other obligations, the Company has undrawn stand-by letters of credit of $\n3.9\n million.\nCertain employees participate in the Company’s Amended and Restated Change in Control Severance Plan and/or have separate agreements that provide for certain benefits in the event of termination at the Company's convenience, as defined by the plan or agreement. Generally, these benefits are based on the employee’s position in the Company and include severance and continuation of health insurance, and may contain acceleration of equity grants and a pro-rata bonus based on the portion of the year employed. \nLegal Proceedings\n \n— The Company is involved in various legal proceedings, claims, and litigation arising in the ordinary course of business, including collective class and PAGA actions alleging violations of wage and hour laws. The Company does not believe that the disposition of matters that are pending or asserted will have a material effect on its consolidated financial statements.\n33\n11. Stockholders' Equity\n    \nUnder stock repurchase programs approved by the Company’s Board of Directors, the Company repurchased \n3.4\n million of its common shares for $\n275.7\n million during 2023 and \n2.8\n million shares for $\n281.4\n million during 2022. All repurchased shares have been retired. Under the \ntwo-year\n, $\n500.0\n million stock repurchase program, which was approved on April 24, 2023 and superseded the previous program, there was approximately $\n273.7\n million remaining at year end for future stock repurchases.\n12. Stock-Based Compensation and Other Employee Benefit Plans\n \nThe Company believes that stock-based compensation aligns the interests of its employees and directors with those of its stockholders. Stock-based compensation provides incentives to retain and motivate executive officers and key employees responsible for driving Company performance and maintaining important relationships that contribute to the growth of the Company. As of December 31, 2023, the Company has two stock-based compensation plans:\n2010 Plan\n \n—\n On June 13, 2019, the stockholders of the Company approved the Second Amended and Restated 2010 Incentive Award Plan (the \"2010 Plan\"). This plan permits the grant of incentive stock options, nonqualified stock options, dividend equivalent rights, stock payments, deferred stock, restricted stock awards, restricted stock units (\"RSUs\"), performance shares and other incentive awards, stock appreciation rights and cash awards to its employees, directors, and consultants. As of December 31, 2023, there were \n1.5\n million shares available for issuance under the 2010 Plan.\n2012 Plan\n \n—\n The Board of Directors adopted the Second Amended and Restated 2012 Employment Inducement Incentive Award Plan on April 26, 2018 (the \"2012 Plan\"), which is amended from time to time to add additional shares. This plan allows for grants of stock to employees as employment inducement awards pursuant to NYSE rules. The terms of the 2012 Plan are similar to the 2010 Plan. As of December 31, 2023, there was an immaterial number of shares available for issuance under the 2012 Plan.\nStock-based compensation expense in the accompanying consolidated statements of operations and comprehensive income was as follows:\nYear ended December 31,\n \n2023\n2022\n2021\nContinuing operations (included in SG&A expenses)\n$\n44.0\n \n$\n49.3\n \n$\n39.6\n \nDiscontinued operations\n—\n \n—\n \n13.1\n \n$\n44.0\n \n$\n49.3\n \n$\n52.7\n \nThe Company recognized income tax benefits for stock-based compensation arrangements of $\n3.2\n million, $\n4.3\n million and $\n2.5\n million for the years ended December 31, 2023, 2022 and 2021, respectively. \nRestricted Stock Units \n— The Company issues RSUs with (i) service conditions; and (ii) a combination of service and market and/or performance conditions. RSUs generally vest over \none\n- to \nfive-year\n periods, and the RSUs that have performance conditions are based on the achievement of specified annual or multi-year financial or other targets. In addition, the Company grants awards to certain executives that include \nthree-year\n financial performance targets plus a component based on achievement of total shareholder return (\"TSR\") relative to an objectively selected group of industry peers over a \nthree-year\n period, with payouts ranging from \nzero\n to \n200\n percent of the target award. \nThe fair value of each RSU is based on the grant-date fair market value of the awards. The fair value of the Company's RSUs, other than the TSR components thereof, were determined on the grant date based on the closing market price for the Company's stock. The fair values of the TSR components of the awards were $\n6.41\n, $\n8.71\n, and $\n13.90\n per share for the 2023, 2022 and 2021 awards, respectively, determined on the grant date using a Monte Carlo simulation model based on the following assumptions: \n2023\n2022\n2021\nExpected term (years)\n3.0\n3.0\n3.0\nDividend yield\n—\n \n—\n \n—\n \nVolatility factor\n36.0\n \n%\n43.9\n \n%\n46.0\n \n%\nRisk-free interest rate\n3.7\n \n%\n1.8\n \n%\n0.3\n \n%\nCompensation expense for RSUs is determined based on the grant-date fair value of those awards, net of an estimated forfeiture rate. The forfeiture rate estimates the number of awards that will eventually vest and is based on historical vesting patterns. Compensation expense for RSUs with performance conditions based on financial targets are measured on the amount of shares ultimately expected to vest, estimated at each reporting date based on management’s expectations regarding the relevant performance criteria. Compensation expense for all other RSUs are recognized on a straight-line basis, net of an estimated forfeiture rate over the requisite service period of the award. \n34\nA summary of the status of the Company’s unvested RSUs as of December 31, 2023 and changes during the year then ended are presented below (number of units in millions, except fair value per unit): \n \nService Conditions\nPerformance/Market \nand Service Conditions\nTotal\nWeighted-Average Grant-Date Fair Value Per Unit\nUnvested RSUs outstanding at December 31, 2022 \n0.5\n \n0.2\n \n0.7\n \n$\n92.13\n \nGranted\n0.4\n \n0.7\n \n1.1\n \n$\n76.69\n \nVested\n(\n0.3\n)\n(\n0.3\n)\n(\n0.6\n)\n$\n72.70\n \nUnvested RSUs outstanding at December 31, 2023\n0.6\n \n0.6\n \n1.2\n \nUnvested and expected to vest RSUs outstanding at December 31, 2023\n0.6\n \n0.5\n \n1.1\n \n$\n92.83\n \n    \n__________________\nVested shares include \n0.2\n million shares surrendered for payment of employee income taxes, which are available for re-issuance under the 2010 Plan.\nAs of December 31, 2023, there was unrecognized compensation expense of $\n56.1\n million related to unvested RSUs based on awards that are expected to vest. The unrecognized compensation expense is expected to be recognized over a weighted-average period of approximately \n2.0\n years. The fair value of RSUs that vested was $\n50.2\n million in 2023, $\n49.3\n million in 2022, and $\n47.9\n million in 2021. The weighted-average grant-date fair value per unit of RSUs was $\n76.69\n in 2023, $\n110.62\n in 2022, and $\n93.36\n in 2021. \nEmployee Stock Purchase Plan\n \n— The stockholders of the Company approved the Second Amended and Restated 2010 Employee Stock Purchase Plan (“ESPP”) on June 18, 2020. The ESPP allows eligible employees to purchase common stock of the Company, through payroll deductions, at a \n15\n percent discount of the lower of the market price on the first day or the last day of the semi-annual purchase periods. Participants are required to hold the shares for a 12-month period after the purchase date. The ESPP is intended to qualify as an employee stock purchase plan under the Internal Revenue Service (\"IRS\") Code Section 423. Eligible employees may contribute up to a certain percentage set by the plan administrator of their eligible earnings toward the purchase of the stock (subject to certain IRS limitations). As of December 31, 2023, there were \n0.6\n million shares available for issuance under the ESPP.\nShares of common stock are transferred to participating employees at the conclusion of each \nsix-month\n offering period, which ends on the last business day of the month in March and September each year. Compensation expense is measured using a Black-Scholes valuation model. \nThe fair values of the options granted under the ESPP were estimated using the Black-Scholes valuation model at the date of grant based on the following assumptions: \n \nYear Ended December 31,\n \n2023\n2022\n2021\nExpected term (years)\n0.5\n0.5\n0.5\nDividend yield\n—\n \n—\n \n—\n \nExpected volatility\n38.1\n - \n38.7\n%\n27.8\n - \n32.4\n%\n39.2\n - \n55.2\n%\nWeighted-average risk-free interest rate\n3.8\n - \n4.7\n%\n0.1\n - \n1.0\n%\n0.1\n - \n0.1\n%\nAverage Black-Scholes valuation per share\n$\n23.01\n \n$\n27.60\n \n$\n21.70\n \nShares issued (millions)\n0.3\n \n0.2\n \n0.2\n \nStock-based compensation expense (millions)\n$\n6.1\n \n$\n6.2\n \n$\n4.9\n \nDeferred Compensation Plan \n— The Company’s Deferred Compensation Plan, which became effective on June 1, 2017 and has been amended from time to time (the \"DCP\"), allows for eligible management and highly-compensated key employees to elect to defer a portion of their compensation to later years. These deferrals are subject to investment risk and a risk of forfeiture under certain circumstances. Participants may choose from various investment options representing a broad range of asset classes. The Company’s deferred compensation plan liability was $\n16.6\n million and $\n13.6\n million at December 31, 2023 and 2022, respectively, which was primarily included in other long-term liabilities. The Company established a rabbi trust to fund the DCP and is primarily comprised of mutual funds, which are measured at fair value using the net asset value practical expedient.\nEmployee Defined Contribution Plans\n \n— The Company maintains various 401(k) retirement savings plans for the benefit of our eligible U.S. employees. Under terms of these plans, eligible employees are able to make contributions to these plans on a tax-deferred basis. The Company made matching contributions to the 401(k) plans of $\n26.1\n million in 2023, $\n22.5\n million in 2022, and $\n19.9\n million in 2021.\n \n35\n13. Income Taxes\nThe provision for income taxes consists of the following (in millions):\n \nYear Ended December 31,\n \n2023\n2022\n2021\nCurrent:\n \n \n \nFederal\n$\n34.8\n \n$\n44.4\n \n$\n43.6\n \nState\n11.8\n \n15.8\n \n15.5\n \nForeign\n5.0\n \n4.9\n \n3.0\n \n \n51.6\n \n65.1\n \n62.1\n \nDeferred:\n \n \n \nFederal and State\n28.5\n \n31.6\n \n19.5\n \nForeign\n(\n1.7\n)\n—\n \n—\n \n \n26.8\n \n31.6\n \n19.5\n \n$\n78.4\n \n$\n96.7\n \n$\n81.6\n \n \nIncome from continuing operations before income taxes consists of the following (in millions): \n \nYear Ended December 31,\n \n2023\n2022\n2021\nUnited States\n$\n283.5\n \n$\n347.6\n \n$\n304.5\n \nForeign\n14.2\n \n16.0\n \n8.9\n \n \n$\n297.7\n \n$\n363.6\n \n$\n313.4\n \nThe components of deferred tax (liabilities) assets are as follows (in millions):\n \nDecember 31,\n2023\n2022\nIntangibles\n$\n(\n185.3\n)\n$\n(\n159.9\n)\nDepreciation expense\n(\n7.2\n)\n(\n8.8\n)\nOperating lease right-of-use assets\n(\n15.2\n)\n(\n11.8\n)\nOperating lease liabilities\n15.9\n \n12.2\n \nAllowance for doubtful accounts\n1.2\n \n1.3\n \nEmployee-related accruals\n17.5\n \n21.0\n \nStock-based compensation\n11.8\n \n11.1\n \nOther\n5.3\n \n5.7\n \n$\n(\n156.0\n)\n$\n(\n129.2\n)\n36\nThe reconciliation between the amount computed by applying the U.S. federal statutory tax rate of \n21\n percent to income before income taxes and the income tax provision is as follows (in millions):\n \nYear Ended December 31,\n \n2023\n2022\n2021\nIncome tax provision at the statutory rate\n$\n62.5\n \n$\n76.3\n \n$\n65.8\n \nState income taxes, net of federal benefit\n13.6\n \n17.3\n \n15.2\n \nNondeductible executive compensation\n4.2\n \n5.4\n \n3.3\n \nDisallowed meals and entertainment expenses\n1.2\n \n0.5\n \n0.2\n \nExcess stock-based compensation benefit\n(\n2.6\n)\n(\n3.5\n)\n(\n2.0\n)\nWork opportunity tax credit\n(\n1.8\n)\n(\n2.1\n)\n(\n3.1\n)\nOther\n1.3\n \n2.8\n \n2.2\n \n$\n78.4\n \n$\n96.7\n \n$\n81.6\n \n \nAs of December 31, 2023, the Company had $\n0.2\n million domestic credit carryforwards and had $\n1.5\n million of foreign net operating losses, which will start to expire in 2030.\n \nThe Company has recorded a valuation allowance of approximately $\n0.6\n million and $0.9 million at December 31, 2023 and 2022, respectively, related to credits and net operating loss carryforwards. The Company had gross deferred tax assets of $\n61.0\n million and $\n59.3\n million and gross deferred tax liabilities of $\n216.4\n million and $\n187.6\n million at December 31, 2023 and 2022, respectively. Management has determined the gross deferred tax assets are realizable.\nAt December 31, 2023, the Company had undistributed earnings of foreign subsidiaries of approximately $\n25.1\n million, substantially all of which are permanently reinvested. The Company will repatriate a portion of these foreign earnings in situations it deems advantageous for business operations, tax, or cash management reasons. In doing so, the Company could be subject to state income and foreign taxes which would be insignificant. The determination of the amount of unrecognized deferred income tax liability for any basis differences on the permanently reinvested foreign earnings is not practicable due to the complexities associated with this hypothetical calculation.\nAt December 31, 2023 and 2022, there were $\n1.2\n million and $\n1.4\n million of unrecognized tax benefits, respectively, and changes during those years were not significant. If recognized, these unrecognized tax benefits would affect the annual effective tax rate. The gross unrecognized tax benefits are included in other long-term liabilities in the accompanying consolidated balance sheets. The Company recognizes interest and penalties related to uncertain tax positions in income tax expense in the accompanying consolidated statements of operations and comprehensive income. The amount of interest and penalties recognized in the consolidated financial statements is not significant. The Company believes that there will be no significant decrease in unrecognized tax benefits by the end of 2024. \n \nThe Company is subject to taxation in the United States and various states and foreign jurisdictions. The IRS has completed an examination of the Company's U.S. income tax return for the 2018 tax year with no change. The Company remains subject to U.S. federal income tax examinations for 2020 and subsequent years. For the majority of U.S. states, with few exceptions and generally for the foreign tax jurisdictions, the Company remains subject to examination for 2019 and subsequent years.\n \n37\n14. Earnings per Share\n \nThe following is a reconciliation of the number of shares and share equivalents used to calculate basic and diluted earnings per share (in millions, except per share amounts):\nYear Ended December 31,\n2023\n2022\n2021\nIncome from continuing operations\n$\n219.3\n \n$\n266.9\n \n$\n231.8\n \nIncome from discontinued operations, net of income taxes\n—\n \n1.2\n \n178.1\n \nNet income \n$\n219.3\n \n$\n268.1\n \n$\n409.9\n \nWeighted-average number of common shares outstanding - basic\n48.3\n \n50.6\n \n52.7\n \nDilutive effect of common share equivalents\n0.4\n \n0.7\n \n0.8\n \nWeighted-average number of common shares and share equivalents outstanding - diluted\n48.7\n \n51.3\n \n53.5\n \nBasic earnings per share:\nContinuing operations\n$\n4.54\n \n$\n5.27\n \n$\n4.40\n \nDiscontinued operations\n—\n \n0.03\n \n3.38\n \n$\n4.54\n \n$\n5.30\n \n$\n7.78\n \nDiluted earnings per share:\nContinuing operations\n$\n4.50\n \n$\n5.21\n \n$\n4.33\n \nDiscontinued operations\n—\n \n0.02\n \n3.33\n \n$\n4.50\n \n$\n5.23\n \n$\n7.66\n \n38\n15. Segment Reporting\n \nASGN provides information technology (\"IT\") services and professional solutions across the commercial and government sectors. ASGN operates through \ntwo\n segments, Commercial and Federal Government. The Commercial Segment, which is the largest segment, provides consulting, creative digital marketing, and permanent placement services primarily to large enterprises and Fortune 1000 companies. The Federal Government Segment provides mission-critical solutions to the Department of Defense, the intelligence community, and federal civilian agencies. Virtually all of the Company's revenues are generated in the United States. \nManagement evaluates the performance of each segment primarily based on revenues, gross profit, and operating income derived directly from internal financial reporting of the segments used for corporate management purposes, which is presented below by segment (in millions):\nYear Ended December 31,\n2023\n2022\n2021\nCommercial\nRevenues\n$\n3,174.4\n \n$\n3,435.7\n \n$\n2,927.1\n \nGross profit\n1,017.6\n \n1,126.2\n \n934.9\n \nOperating income\n344.1\n \n411.1\n \n355.9\n \nDepreciation and other amortization\n20.3\n \n16.3\n \n13.9\n \nAmortization of intangible assets\n34.8\n \n31.3\n \n25.7\n \nFederal Government\nRevenues\n$\n1,276.2\n \n$\n1,145.4\n \n$\n1,082.4\n \nGross profit\n262.4\n \n243.4\n \n207.6\n \nOperating income\n99.2\n \n89.1\n \n76.1\n \nDepreciation and other amortization\n5.7\n \n5.5\n \n8.5\n \nAmortization of intangibles assets\n36.9\n \n33.8\n \n30.0\n \nConsolidated\nRevenues\n$\n4,450.6\n \n$\n4,581.1\n \n$\n4,009.5\n \nGross profit\n1,280.0\n \n1,369.6\n \n1,142.4\n \nOperating income\n364.1\n \n409.5\n \n350.9\n \nDepreciation and other amortization\n28.6\n \n26.3\n \n28.0\n \nAmortization of intangible assets\n71.7\n \n65.1\n \n55.7\n \n___________________\nDepreciation and other amortization includes $\n0.7\n million amortization related to capitalized cloud-based application implementation costs.\nConsolidated operating income includes corporate operating expenses, which are not allocated to the segments. These include stock-based compensation expense, depreciation expense, compensation for corporate employees, acquisition, integration and strategic planning expenses and public company expenses.\n \n39\nVirtually all of the revenues from the Commercial Segment are generated from time-and-materials (\"T&M\") contracts where payments are based on fixed hourly rates for each direct labor hour expended and reimbursements for allowable material costs and out-of-pocket expenses. Revenues from the Federal Government Segment are generated from: (i) firm-fixed-price, (ii) T&M and, (iii) cost reimbursable contracts. \nRevenues by segment and by type are as follows (in millions):\n \nYear Ended December 31,\n2023\n2022\n2021\nCommercial\nAssignment\n$\n2,078.9\n \n$\n2,476.1\n \n$\n2,285.9\n \nConsulting\n1,095.5\n \n959.6\n \n641.2\n \n3,174.4\n \n3,435.7\n \n2,927.1\n \nFederal Government\nFirm-fixed-price\n386.7\n \n331.6\n \n295.6\n \nTime and materials\n504.9\n \n456.3\n \n399.0\n \nCost reimbursable\n384.6\n \n357.5\n \n387.8\n \n1,276.2\n \n1,145.4\n \n1,082.4\n \nConsolidated\n$\n4,450.6\n \n$\n4,581.1\n \n$\n4,009.5\n \nFederal Government Segment revenues by customer type are as follows (in millions):\nYear Ended December 31,\n2023\n2022\n2021\nDepartment of Defense and Intelligence Agencies\n$\n614.6\n \n$\n606.3\n \n$\n589.7\n \nFederal Civilian\n621.6\n \n503.4\n \n421.8\n \nOther\n40.0\n \n35.7\n \n70.9\n \n$\n1,276.2\n \n$\n1,145.4\n \n$\n1,082.4\n \n16. Fair Value Measurements\n \nRecurring Fair Value Measurements\n — The carrying amounts of cash and cash equivalents, accounts receivable, accounts payable, and accrued payroll approximate their fair value based on their short-term nature. The carrying amount of long-term debt recorded in the Company’s accompanying consolidated balance sheet at December 31, 2023 was $\n1.0\n billion (see \nNote 9. Long-Term Debt) \nand its fair value, determined using quoted prices in active markets for identical liabilities (Level 1 inputs), was slightly less than the carrying value.\nNonrecurring Fair Value Measurements\n — Certain assets, such as goodwill and trademarks, are not measured at fair value on an ongoing basis but are subject to fair value adjustments in certain circumstances, such as, when there is evidence of impairment.\n \n40\nItem 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\n \nNone.",
    "item9a": ">Item 9A. Controls and Procedures\n \nEvaluation of Disclosure Controls and Procedures\n \nAs of the end of the period covered by this Annual Report on Form 10-K, our management carried out an evaluation, under the supervision and with the participation of our Principal Executive Officer and Principal Financial Officer, of the effectiveness of our disclosure controls and procedures (as defined in Rule 13a-15(e) of the Exchange Act). Based on this evaluation, our Principal Executive Officer and Principal Financial Officer have concluded that our disclosure controls and procedures are effective as of the end of the period covered by this report. The term \"disclosure controls and procedures\" means controls and other procedures of the Company that are designed to ensure that information required to be disclosed by the Company in the reports that it files or submits under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the SEC’s rules and forms. \"Disclosure controls and procedures\" include, without limitation, controls and procedures designed to ensure that information required to be disclosed by the Company in the reports that it files or submits under the Exchange Act is accumulated and communicated to the Company’s management, including its Principal Executive Officer and Principal Financial Officer, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure.\nManagement’s Report on Internal Control over Financial Reporting\n \nManagement is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) of the Exchange Act) for the Company. The term \"internal control over financial reporting\" is defined as a process designed by, or under the supervision of, our Principal Executive and Principal Financial Officers, or persons performing similar functions and effected by our Board of Directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles and includes those policies and procedures that:\n•\nPertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company;\n•\nProvide reasonable assurance that the transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and\n•\nProvide reasonable assurance regarding prevention of timely detection of unauthorized acquisition, use, or disposition of the Company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with policies or procedures may deteriorate.\nManagement, under the supervision and with the participation of our Principal Executive Officer and Principal Financial Officer, assessed the effectiveness of our internal control over financial reporting as of December 31, 2023. In making this assessment, management used criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in \nInternal Control-Integrated Framework (2013)\n. Based on our assessment and those criteria, management believes that the Company maintained effective internal control over financial reporting as of December 31, 2023. Our independent registered public accounting firm, Deloitte & Touche LLP, has included an attestation report on our internal control over financial reporting, which is included above.\nChanges in Internal Control over Financial Reporting\n \nThere were no changes in the Company’s internal control over financial reporting that occurred during the Company’s fourth quarter that have materially affected, or are reasonably likely to materially affect, the Company’s internal control over financial reporting.\n41\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of ASGN Incorporated\nGlen Allen, Virginia\nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of ASGN Incorporated and subsidiaries (the “Company”) as of December 31, 2023, based on criteria established in \nInternal Control — Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2023, based on criteria established in \nInternal Control — Integrated Framework (2013)\n issued by COSO. \nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended December 31, 2023, of the Company and our report dated February 22, 2024, expressed an unqualified opinion on those financial statements.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management's Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. \nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements. \nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ DELOITTE & TOUCHE LLP\nRichmond, Virginia\nFebruary 22, 2024\n42",
    "item9b": ">Item 9B. Other Information\nNone.",
    "item9": ">Item 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\n \nNone.\n43\nPART III",
    "item10": ">Item 10. Directors, Executive Officers and Corporate Governance\n \nInformation responsive to this item will be set forth in the Company’s definitive proxy statement for use in connection with its 2024 Proxy Statement and is incorporated herein by reference. The 2024 Proxy Statement will be filed with the SEC within 120 days after the end of the Company’s fiscal year. ",
    "item11": ">Item 11. Executive Compensation\n \nInformation responsive to this item will be set forth in the 2024 Proxy Statement to be filed with the SEC within 120 days after the end of the Company’s fiscal year, and is incorporated herein by reference.",
    "item12": ">Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\n \nInformation responsive to this item will be set forth in the 2024 Proxy Statement to be filed with the SEC within 120 days after the end of the Company’s fiscal year, and is incorporated herein by reference.",
    "item13": ">Item 13. Certain Relationships and Related Transactions and Director Independence\n \nInformation responsive to this Item will be set forth in the 2024 Proxy Statement to be filed with the SEC within 120 days after the end of the Company’s fiscal year, and is incorporated herein by reference.",
    "item14": ">Item 14. Principal Accounting Fees and Services\n \nInformation responsive to this Item will be set forth in the 2024 Proxy Statement to be filed with the SEC within 120 days after the end of the Company’s fiscal year, and is incorporated herein by reference.\nPART IV\nItem 15. Exhibits and Financial Statement Schedule\n \n(a) List of documents filed as part of this report\n \n1. Financial Statements:\nReport of Independent Registered Public Accounting Firm (PCAOB ID No. \n34\n)\nConsolidated Balance Sheets at December 31, 2023 and 2022 \nConsolidated Statements of Operations and Comprehensive Income for the Years Ended December 31, 2023, 2022 and 2021 \nConsolidated Statements of Stockholders’ Equity for the Years Ended December 31, 2023, 2022 and 2021 \nConsolidated Statements of Cash Flows for the Years Ended December 31, 2023, 2022 and 2021 \nNotes to Consolidated Financial Statements\n \n2. Financial Statement Schedule:\nSchedule II—Valuation and Qualifying Accounts\nSchedules other than those referred to above have been omitted because they are not applicable or not required under the instructions contained in Regulation S-X or because the information is included elsewhere in the financial statements or notes thereto.\nItem 16. Form 10-K Summary\nNone.\n44\nASGN INCORPORATED AND SUBSIDIARIES\nSCHEDULE II—VALUATION AND QUALIFYING ACCOUNTS\nYears Ended December 31, 2023, 2022 and 2021 \n(In millions)\nDescription\nBalance at beginning of year\nCharged to costs and expenses\nDeductions\n(1)\nBalance at end of year\nYear ended December 31, 2023\n \n \n \nAllowance for doubtful accounts\n$\n4.0\n \n1.8\n \n(\n1.8\n)\n$\n4.0\n \nWorkers’ compensation loss reserves\n$\n12.8\n \n3.4\n \n(\n2.8\n)\n$\n13.4\n \n \n \n \nYear ended December 31, 2022\nAllowance for doubtful accounts\n$\n3.1\n \n2.0\n \n(\n1.1\n)\n$\n4.0\n \nWorkers’ compensation loss reserves\n$\n12.8\n \n3.2\n \n(\n3.2\n)\n$\n12.8\n \n \n \n \nYear ended December 31, 2021\n \n \n \nAllowance for doubtful accounts\n$\n3.9\n \n0.4\n \n(\n1.2\n)\n$\n3.1\n \nWorkers’ compensation loss reserves\n$\n13.1\n \n3.3\n \n(\n3.6\n)\n$\n12.8\n \n______\n(1)\n  Deductions from allowance for doubtful accounts include write-offs of uncollectible accounts receivable.\n     Deductions from workers’ compensation loss reserves include payments of claims and changes related to anticipated insurance and indemnification recoveries.\n45\nINDEX TO EXHIBITS\n  \nNumber\nDescription\n2.1\nMembership Interest Purchase Agreement, dated June 30, 2021, by and between ASGN Incorporated and H.I.G. Orca Acquisition Holdings, Inc. (incorporate by reference from Exhibit 10.1 to our Current Report on Form 8-K filed with the SEC on July 1, 2021)\n3.1\nAmended and Restated Certificate of Incorporation of On Assignment, Inc., effective June 23, 2014 (incorporated by reference from Exhibit 3.1 to our Current Report on Form 8-K filed with the SEC on June 25, 2014)\n3.2\nCertificate of Amendment of Amended and Restated Certificate of Incorporation of On Assignment, Inc. effective April 2, 2018 (incorporated by reference from Exhibit 3.1 to our Current Report on Form 8-K filed with the SEC on March 16, 2018)\n3.3\nFifth Amended and Restated Bylaws of ASGN Incorporated, effective December 7, 2022 (incorporated by reference from Exhibit 3.1 to our Current Report on Form 8-K filed with the SEC on December 13, 2022)\n4.1\nSpecimen Common Stock Certificate (P)\n4.2\nDescription of the Registrant Securities Registered Under Section 12 of the Securities Exchange Act of 1934 (incorporated by reference from Exhibit 4.2 to our Annual Report on Form 10-K filed with the SEC on March 2, 2020)\n4.3\nIndenture, dated November 22, 2019, among ASGN Incorporated, the guarantors party thereto and U.S. Bank National Association, as trustee (incorporated by reference from Exhibit 10.8 to our Annual Report on Form 10-K filed with the SEC on March 2, 2020)\n4.4\nSupplemental Indenture No. 1 dated as of June 7, 2021, among ASGN Incorporated, the guarantors party thereto, the released parties thereto and U.S. Bank National Association, as trustee (incorporated by reference from Exhibit 4.2 to our Quarterly Report on Form 10-Q filed with the SEC on August 9, 2021)\n4.5\nSupplemental Indenture No. 2 dated as of September 29, 2021 among ASGN Incorporated, the guarantors party thereto, the released parties thereto and U.S. Bank National Association, as trustee dated as of November 22, 2019 (incorporated by reference from Exhibit 10.1 to our Quarterly Report on Form 10-Q filed with the SEC on November 9, 2021)\n4.6\nSupplemental Indenture No. 3 dated as of November 15, 2022, among ASGN Incorporated, the guarantors party thereto, and U.S. Bank Trust Company, National Association, as trustee\n10.1\nThird Amended and Restated Credit Agreement, dated as of August 31, 2023, among ASGN Incorporated, as the borrower, Wells Fargo Bank, National Association, as administrative agent, and the syndication agents, documentation agents, and other lenders party thereto (incorporated by reference from Exhibit 10.1 to our Quarterly Report on Form 10-Q filed with the SEC on November 2, 2023)\n10.2\nASGN Incorporated Second Amended and Restated 2010 Employee Stock Purchase Plan, dated as of March 18, 2020 (incorporated by reference from Exhibit 10.1 to our Quarterly Report on Form 10-Q filed with the SEC on May 11, 2020)\n†\n10.3\nASGN Incorporated Second Amended and Restated 2010 Incentive Award Plan, dated as of August 8, 2019 (incorporated by reference from Exhibit 10.1 to our Quarterly Report on Form 10-Q filed with the SEC on November 8, 2019)\n†\n10.4\nASGN Incorporated 2010 Incentive Award Plan Senior Executive Time-Vesting Restricted Stock Unit Award Notice (incorporated by reference from Exhibit 10.11 to our Annual Report on Form 10-K filed with the SEC on March 2, 2020)\n†\n10.5\nASGN Incorporated 2010 Incentive Award Plan Form of Retention Notice Restricted Stock Unit Award and Agreement (incorporated by reference from Exhibit 10.3 to our Quarterly Report on Form 10-Q filed with the SEC on August 8, 2019)\n†\n10.6\nASGN Incorporated 2010 Incentive Award Plan Form of Senior Executive Performance-Based Restricted Stock Unit Award Notice (incorporated by reference from Exhibit 10.17 from our Annual Report on Form 10-K filed with the SEC on March 1, 2022)\n†\n10.7\nSecond Amended and Restated ASGN Incorporated 2012 Employment Inducement Incentive Award Plan, effective as of April 26, 2018 (incorporated by reference from Exhibit 10.20 to our Annual Report on Form 10-K filed with the SEC on March 1, 2019)\n†\n10.8\nFirst Amendment to the Second Amended and Restated ASGN Incorporated 2012 Employment Inducement Incentive Award Plan, effective as of June 8, 2021 (incorporated by reference from Exhibit 10.1 to our Quarterly Report on Form 10-Q filed with the SEC on August 9, 2021)\n†\n10.9\nASGN Incorporated Second Amended and Restated Deferred Compensation Plan, effective as of April 26, 2018 (incorporated by reference from Exhibit 10.2 to our Quarterly Report on Form 10-Q filed with the SEC on May 10, 2018)\n†\n10.10*\nASGN Incorporated Amended and Restated Change in Control Severance Plan and Summary Plan Description, effective January 1, 2024\n†\n46\n10.11\nEmployment Agreement, dated as of June 3, 2019, by and between ASGN Incorporated and Theodore S. Hanson (incorporated by reference from Exhibit 10.22 to our Annual Report on Form 10-K filed with the SEC on March 2, 2020)\n†\n10.12\nEmployment Agreement, dated as of January 8, 2007, by and between Rand Blazer and Apex Systems, Inc. (incorporated by reference from Exhibit 10.35 to our Annual Report on Form 10-K filed with the SEC on March 18, 2013)\n†\n10.13\nAmendment No. 1 to the Employment Agreement, dated as of December 31, 2008, by and between Rand Blazer and Apex Systems, Inc. (incorporated by reference from Exhibit 10.36 to our Annual Report on Form 10-K filed with the SEC on March 18, 2013)\n†\n10.14\nAmendment No. 2 to the Employment Agreement, dated as of August 3, 2009, by and between Rand Blazer and Apex Systems, Inc. (incorporated by reference from Exhibit 10.37 to our Annual Report on Form 10-K filed with the SEC on March 18, 2013)\n†\n10.15\nAmendment No. 3 to the Employment Agreement, dated as of May 15, 2012, by and between Rand Blazer, On Assignment, Inc. and Apex Systems, Inc. (incorporated by reference from Exhibit 10.38 to our Annual Report on Form 10-K filed with the SEC on March 18, 2013)\n†\n10.16\nAmendment No. 4 to the Employment Agreement, dated as of May 15, 2012, by and between Rand Blazer and Apex Systems, Inc. (incorporated by reference from Exhibit 10.39 to our Annual Report on Form 10-K filed with the SEC on March 18, 2013)\n†\n10.17\nEmployment Agreement, dated January 3, 2022, by and between ASGN Incorporated and Marie Perry (incorporated by reference form Exhibit 10.1 to our Quarterly Report on Form 10-Q filed with the SEC on November 7, 2022)\n†\n10.18\nSeverance Term Letter, as of December 13, 2017, by and between On Assignment, Inc. and Jennifer Hankes Painter (incorporated by reference from Exhibit 10.38 to our Annual Report on Form 10-K filed with the SEC on March 1, 2018)\n†\n10.19\nSeverance Term Letter, dated April 19, 2023, by and between ASGN Incorporated and Rose L. Cunningham (incorporated by reference from Exhibit 10.1 to our Quarterly Report on Form 10-Q filed with the SEC on May 4, 2023)\n†\n10.20\nForm of Indemnification Agreement (incorporated by reference from Exhibit 10.1 to our Annual Report on Form 10-K filed with the SEC on March 16, 2007)\n†\n19.1*\nASGN Incorporated Insider Trading Policy, effective January 25, 2023\n21.1*\nSubsidiaries of the Registrant\n23.1*\nConsent of Independent Registered Public Accounting Firm\n31.1*\nCertification of Theodore S. Hanson, Chief Executive Officer, pursuant to Rule 13a-14(a) or 15d-14(a)\n31.2*\nCertification of Marie L. Perry, Executive Vice President and Chief Financial Officer, pursuant to Rule 13a-14(a) or 15d-14(a)\n32.1*\nCertification of Theodore S. Hanson, Chief Executive Officer, pursuant to 18 U.S.C. Section 1350\n32.2*\nCertification of Marie L. Perry, Executive Vice President and Chief Financial Officer, pursuant to 18 U.S.C. Section 1350\n97.1*\nPolicy for Recovery of Erroneously Awarded Compensation, effective as of October 2, 2023\n†\n101.INS*\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the XBRL document)\n101.SCH*\nInline XBRL Taxonomy Extension Schema Document\n101.CAL*\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF*\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB*\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE*\nInline XBRL Taxonomy Extension Presentation Linkbase Document\n104.1*\nCover page interactive data file (embedded within the Inline XBRL document)\n____\n(*)\nFiled herewith.\n†\nThese exhibits relate to management contracts or compensatory plans, contracts or arrangements in which directors and/or named executive officers of the Registrant may participate.\nP\nThis exhibit originally filed in paper format.  Accordingly, a hyperlink has not been provided.\n47\nSIGNATURES\n \nPursuant to the requirements of Section 13 or 15(d) of the Exchange Act, the registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized, on this 22nd day of February 2024.\n \n \nASGN Incorporated\n \n/s/ Theodore S. Hanson\n \n     Theodore S. Hanson\n \n     Chief Executive Officer\n \nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities indicated and on the dates indicated.\n \nSignature\n \nTitle\n \nDate\n/s/ Theodore S. Hanson\n \nChief Executive Officer, Director\n \nFebruary 22, 2024\nTheodore S. Hanson\n \n(Principal Executive Officer)\n \n/s/ Marie L. Perry\n \nExecutive Vice President and Chief Financial Officer\n \nFebruary 22, 2024\nMarie L. Perry\n \n(Principal Financial Officer)\n \n/s/ Rose Cunningham\nVice President, Chief Accounting Officer and Controller\nFebruary 22, 2024\nRose Cunningham\n(Principal Accounting Officer)\n/s/ Arshad Matin\nFebruary 22, 2024\nArshad Matin\nChair of the Board of Directors\n/s/ Brian J. Callaghan\nFebruary 20, 2024\nBrian J. Callaghan\n \nDirector\n \n/s/ Joseph W. Dyer\nFebruary 20, 2024\n Joseph W. Dyer\nDirector\n/s/ Mark A. Frantz\nFebruary 20, 2024\nMark A. Frantz\n \nDirector\n \n/s/ Maria R. Hawthorne\nFebruary 20, 2024\nMaria R. Hawthorne\nDirector\n/s/ Jonathan S. Holman\nFebruary 20, 2024\nJonathan S. Holman\nDirector\n/s/ Mariel A. Joliet\nFebruary 20, 2024\nMariel A. Joliet\nDirector\n/s/ Marty R. Kittrell\n \n \nFebruary 20, 2024\nMarty R. Kittrell\nDirector\n/s/ Carol J. Lindstrom\nFebruary 20, 2024\nCarol J. Lindstrom\nDirector\n/s/ Edwin A. Sheridan IV\nFebruary 20, 2024\nEdwin A. Sheridan IV\nDirector\n48\n\n",
    "cik": "890564",
    "cusip6": "00191U",
    "cusip": [
        "00191u102",
        "00191U102"
    ],
    "names": [
        "A S G N INC",
        "ASGN INC"
    ],
    "source": "https://www.sec.gov/Archives/edgar/data/890564/000089056424000006/0000890564-24-000006-index.htm"
}